{
    "videoId": "2lUgTDJmO5g",
    "commentCount": 10,
    "comments": [
        {
            "text": "În emisiune, Naba a menționat numele Roxana, dar nimic nu a fost clar din ce a spus. Chiar a spus că „fără foc nu iese fum” și Călin nu o suportă pe Larisa. În schimb, Călin a făcut o referire la Marina și la cum ar dormi între ea și Yasmine. În emisiune nu o arată pe Larisa vorbind de Marina și Roxana",
            "author": "@mihaelita1",
            "likes": 0,
            "publishedAt": "2026-02-11T20:57:08Z"
        },
        {
            "text": "Bravo Donca spunele 🤝",
            "author": "@IoanMureșan-i1b",
            "likes": 1,
            "publishedAt": "2026-02-11T20:31:59Z"
        },
        {
            "text": "De ce nu l-ai lasat pe Paraschiv Live? M-am lamurit si cu tine Dane. Si cum vorbeste Donca de droguri cand voi aveti reclama la droguri(casino) pe fundal? Voi chiar nu sunteti constienti ca nu mai merge asa?",
            "author": "@FlorinTalpan-we1fb",
            "likes": 1,
            "publishedAt": "2026-02-11T20:12:26Z"
        },
        {
            "text": "lalalallala",
            "author": "@madalinavornicu21",
            "likes": 0,
            "publishedAt": "2026-02-11T20:11:44Z"
        },
        {
            "text": "Cancan, in seara asta v-ati aratat adevarata fatza. De ce nu l-ati bagat pe Paraschiv? Ce interese sunt in spate? Presa e cumparata pentru ca Donca e cu suveranistii? Cine va conduce baieti? Sper ca maine sa vorbeasca toata lumea despre modul nedrept in care prezentati informatiile.",
            "author": "@ManuChioveanu-pk9co",
            "likes": 0,
            "publishedAt": "2026-02-11T20:10:28Z"
        },
        {
            "text": "Bravo Dane, il lasi pe Donca sa isi spuna povestile dar pe Paraschiv nu il bagi cand toata lumea il cere. M-am saturat pana peste cap de presa partinitoare. Sa vedeti ce video-uri va face lumea despre voi.",
            "author": "@ConstantinescuAndrei-dk6ol",
            "likes": 1,
            "publishedAt": "2026-02-11T20:06:08Z"
        },
        {
            "text": "Oare asa se face presa in Romania? Sa vedeti clipuri ce vor iesi despre voi. Baiesti, in online interactiunea cu publicul e totul. Daca tot chatul l-a vrut pe Paraschiv, voi trebuia sa il bagati, pentru ca asa se face presa, auzi pareri din ambele directii. Nu sa il lasati pe Donca sa isi spuna povestile. V-a platit Donca? Care e ideea? Va duceti in jos rau de tot. Si de Capatos, pur si simplu nu stiu ce sa zic, chiar imi pare credibil dupa interviul cu Iorgulescu.",
            "author": "@FlorinDobro-qn5sm",
            "likes": 0,
            "publishedAt": "2026-02-11T20:04:25Z"
        },
        {
            "text": "Migdale s-a vopsit ce o zice serghei de asta😂😂😂",
            "author": "@puiuhasoti973",
            "likes": 0,
            "publishedAt": "2026-02-11T19:51:39Z"
        },
        {
            "text": "Dezgustator invitat...bye",
            "author": "@Nicho-x5z",
            "likes": 2,
            "publishedAt": "2026-02-11T19:44:04Z"
        },
        {
            "text": "Oare fără să puneți reclama de la păcănele nu aveți aceeași audiență sau de ce trebuie să începeți mereu cu ea? 😶😕🤔",
            "author": "@B.Cozmin",
            "likes": 1,
            "publishedAt": "2026-02-11T19:39:27Z"
        }
    ]
}