{
    "videoId": "DlzBErgATeM",
    "commentCount": 17,
    "comments": [
        {
            "text": "Real hero, now more than ever it is known that having a nuclear bomb is the only insurance against imperialist attacks.",
            "author": "@arturovazquez7653",
            "likes": 0,
            "publishedAt": "2026-02-11T21:32:46Z"
        },
        {
            "text": "As a German he wanted to punish the west for bombing Nazi Germany",
            "author": "@andyplus1352",
            "likes": 1,
            "publishedAt": "2026-02-11T21:14:03Z"
        },
        {
            "text": "Imagine what the Soviets would have done to him if the situation was reversed",
            "author": "@Darkangel754",
            "likes": 1,
            "publishedAt": "2026-02-11T21:08:45Z"
        },
        {
            "text": "It's insane that he only got 9 years in prison for this considering how murderously anti-communist the US is.",
            "author": "@KaradachTheHun",
            "likes": 0,
            "publishedAt": "2026-02-11T21:04:32Z"
        },
        {
            "text": "I can't really blame him. Men like Arthur Harris and Curtis LeMay were major advocates of strategic bombing and would've been all too happy to use multiple nuclear weapons if they could. No one nation or group of allied nations should have that kind of power.",
            "author": "@sirhenrymorgan1187",
            "likes": 0,
            "publishedAt": "2026-02-11T20:58:06Z"
        },
        {
            "text": "9??? Only 9 years for sending literal goverment secrets and our planets most powerfull weapon???",
            "author": "@Golfjong",
            "likes": 10,
            "publishedAt": "2026-02-11T20:39:27Z"
        },
        {
            "text": "The amusing part, McCarthy has been derided for paranoia about Soviet agents to the point his name is a meme, but everything found out proved he was correct.  We see the same thing today with Democrats and government bureaucracy today.  Crimes unpunished or lightly punished.",
            "author": "@kamaeq",
            "likes": 1,
            "publishedAt": "2026-02-11T20:38:48Z"
        },
        {
            "text": "He should have gotten the guillotine",
            "author": "@Ryfael",
            "likes": 3,
            "publishedAt": "2026-02-11T20:30:09Z"
        },
        {
            "text": "It's crazy people are saying that this was good. The world has rested on a knifes edge since this happened.",
            "author": "@paulvonlettow-vorbeck4302",
            "likes": 8,
            "publishedAt": "2026-02-11T20:23:25Z"
        },
        {
            "text": "If he wouldn't have given the bomb to sovits the world would have seen the amircan being the sole owner of the bomb and usa would have been even more unhinged then in our History ( for the time of 2 to 3 years till sovit got there own) a monopoly is never good and duopoly is not good but it is better than monopoly (bombs threat of mutual destruction somewhat in controversial way saved the world of its actually destruction in some way [not all ways ])",
            "author": "@gyukgaming6037",
            "likes": 4,
            "publishedAt": "2026-02-11T20:20:28Z"
        },
        {
            "text": "Sure he committed treason, but I think he did the right thing, imagine a world where the US is the only nuclear superpower in the world, today it's the world bully, imagine what would happen if there were no counterweights",
            "author": "@dany0320",
            "likes": 7,
            "publishedAt": "2026-02-11T20:18:43Z"
        },
        {
            "text": "Men like this is why I have no sympathy for communists or their similar ilk.",
            "author": "@chinesemassproduction",
            "likes": 4,
            "publishedAt": "2026-02-11T20:13:47Z"
        },
        {
            "text": "why did he not get the death penalty (like he deserved btw)?",
            "author": "@incursus1401",
            "likes": 4,
            "publishedAt": "2026-02-11T20:03:07Z"
        },
        {
            "text": "\"You single-handedly brought us to the verge of total planetary destruction, years ahead of schedule. And, for that, we sentence you to nine years in prison!\"\n\"Oh no!!!\"\n\"It's OK. With good behavior, you'll be out in four.\"",
            "author": "@andrewklang809",
            "likes": 37,
            "publishedAt": "2026-02-11T19:48:08Z"
        },
        {
            "text": "A hero. If only one nation had the bomb, it would have been terrible",
            "author": "@alessandromarchesan5957",
            "likes": 9,
            "publishedAt": "2026-02-11T19:46:01Z"
        },
        {
            "text": "True hero",
            "author": "@NomeDeArte",
            "likes": 7,
            "publishedAt": "2026-02-11T19:45:14Z"
        },
        {
            "text": "Fuchs served nine years in prison.  Meanwhile, the Rosenbergs, who may well not have even been spies, were executed.  WELP.",
            "author": "@Eyerleth",
            "likes": 26,
            "publishedAt": "2026-02-11T19:44:02Z"
        }
    ]
}