{
    "videoId": "mNbk2L0J-u0",
    "history": [
        {
            "fetchedAt": "20260213_210907",
            "commentCount": 3,
            "comments": [
                {
                    "text": "I’m 54 and I have auDHD and I’m also the sole caregiver to my 82 yr old mom. I struggle just to keep my own self afloat. I do have a younger brother who lives about 700 miles away. He’s always been exempt from having to do much of anything. He comes home for 3-4 days once or twice a year. He takes her out to eat and to shop and she enjoys it so much. I have tried to get her to join the senior center in our town but she is a diehard democrat and we live in a deep red community. She refuses to even try the senior center because she knows there’s likely a difference in politics. I have explained to her that all she has to do is refuse to discuss politics. She doesn’t have to say anything about her beliefs. They would never even know. She just wants me is what she always says. This is very difficult for me because I have different needs than a lot of folks. I sacrifice for her anyway because I love her. I take her to all of her doctors appointments, I take her out to eat, but I can’t do the shopping. Lighting in most stores makes me extremely anxious. There’s a strobe effect that I can see but everyone else claims they can’t. I don’t see how they miss it. My friends with autism know exactly what I mean. I’m dealing with challenges beyond the norm. I have called The Area on Aging and can’t get a call back. I’m thinking of doing what my husband suggested and get her a case manager through our local mental health provider. He would help me with my mom but he’s dealing with a dad with stage 4 liver cancer and his mom fell and broke her leg and needed surgery about a year ago and he has his hands full with them. It’s really tough. I take it day by day. I don’t think about tomorrow unless I need to plan something. I try to focus on what’s happening now. It keeps me from having multiple meltdowns every day. Meditation has been indispensable.",
                    "author": "@Cheese-is-its-own-food-group",
                    "likes": 1,
                    "publishedAt": "2026-02-13T18:36:54Z"
                },
                {
                    "text": "Thank youmnkxxx",
                    "author": "@FridayKicks-z3r",
                    "likes": 0,
                    "publishedAt": "2026-02-13T20:53:29Z"
                },
                {
                    "text": "We must find time to stop and thank the people who make a difference in our lives.\" — John F. Kennedy.   Allow me to do just that. Thank you for lighting my way through the labyrinth of dementia. My husband’s condition is a slippery uphill challenge; and I often felt that my own mental health was at risk on this journey. Now I can navigate through most of his symptoms without feeling angry or guilty. There are plenty of online resources available  including your book Forget Me Not but taking a coffee break while listening to your channel is best for me. Again, thank you for caring enough to share your invaluable knowledge with others.",
                    "author": "@EvelynDeJesus-p4t",
                    "likes": 0,
                    "publishedAt": "2026-02-13T18:42:13Z"
                }
            ]
        }
    ]
}