{
    "videoId": "ZybTwBIJvLU",
    "history": [
        {
            "fetchedAt": "20260214_041633",
            "commentCount": 25,
            "comments": [
                {
                    "text": "1:06:34 I remember. No Way Home didn't have a post-credits scene, they played the trailer to Multiverse of Madness. With Brand New Day, the post-credits could be the trailer to Avengers: Doomsday",
                    "author": "@JordanNCinema",
                    "likes": 10,
                    "publishedAt": "2026-02-13T22:44:55Z"
                },
                {
                    "text": "This accidental muting has got to stop!",
                    "author": "@SubSolar",
                    "likes": 6,
                    "publishedAt": "2026-02-13T23:48:29Z"
                },
                {
                    "text": "Bro if it weren't for John I wouldn't have known about the early Project Hail Mary screenings. Thank you for this",
                    "author": "@JordanNCinema",
                    "likes": 5,
                    "publishedAt": "2026-02-13T22:03:13Z"
                },
                {
                    "text": "John is there not an automated system you could get that would mute you when you stop speaking and unmute when you resume speaking?",
                    "author": "@vikasahuja3512",
                    "likes": 26,
                    "publishedAt": "2026-02-13T21:26:23Z"
                },
                {
                    "text": "Lol so crazy we getting gta 6 before doomsday",
                    "author": "@lebronjamesfan5583",
                    "likes": 3,
                    "publishedAt": "2026-02-13T22:14:20Z"
                },
                {
                    "text": "The marketing campaign before the last two Avengers films had a drastically different vibe going into them than this go round. People were excited, people were ready for the conclusion and anticipating what was coming afterwards.\n\nThis time, the vibes are cautious, worrisome and hopeful that Marvel can complete a comeback and return to what made them THE franchise for a decade. If anything, I would understand if the studio changed their marketing strategy to build the anticipation each and every month beginning with the summer movie season.",
                    "author": "@chrisharvill1353",
                    "likes": 6,
                    "publishedAt": "2026-02-13T21:29:10Z"
                },
                {
                    "text": "Please fix the mic issues",
                    "author": "@RobtheUnbelievable",
                    "likes": 3,
                    "publishedAt": "2026-02-14T02:50:28Z"
                },
                {
                    "text": "the creators of Skeleton crew said if they were to do a season 2 there probably would be a 4 yr gap",
                    "author": "@StonerWatchproductions",
                    "likes": 1,
                    "publishedAt": "2026-02-14T00:59:49Z"
                },
                {
                    "text": "A good example of the actor who won and the one who still hasn’t would be Eddie Redmayne and Ralph Fiennes.",
                    "author": "@HucksPopCultureCafe",
                    "likes": 2,
                    "publishedAt": "2026-02-13T22:46:06Z"
                },
                {
                    "text": "The Hail Mary showings on the 13th are exclusively IMAX. The Amazon Prime one is on the 16th the Monday prior to release",
                    "author": "@DavidBiliouris",
                    "likes": 0,
                    "publishedAt": "2026-02-14T04:09:45Z"
                },
                {
                    "text": "World Cup Final is schedule for Sunday, July 19th. That’s the week before Brand New Day releases. Huge guaranteed audience to get the entire world’s eyes on it. That would be the perfect drop date for a Doomsday trailer if you ask me.",
                    "author": "@pacman_423",
                    "likes": 3,
                    "publishedAt": "2026-02-14T01:30:30Z"
                },
                {
                    "text": "Stupid humanity getting in the way of my hobbies!😂",
                    "author": "@MON5T3R91",
                    "likes": 2,
                    "publishedAt": "2026-02-14T00:53:31Z"
                },
                {
                    "text": "1:07:00 he's talking about the Multiverse of Madness trailer",
                    "author": "@patricklarsen182",
                    "likes": 1,
                    "publishedAt": "2026-02-14T02:17:14Z"
                },
                {
                    "text": "25:44  bring me everyone..... EVERYONE",
                    "author": "@Night_Rider12312",
                    "likes": 3,
                    "publishedAt": "2026-02-13T21:26:44Z"
                },
                {
                    "text": "1:06:53 Just look at the live chat John lol… MoM trailer came with NWH in post credits instead of a post-credits scene. Also, the first teaser of Avengers came with Captain America First Avenger as a post credits scene.",
                    "author": "@vikasahuja3512",
                    "likes": 2,
                    "publishedAt": "2026-02-13T21:33:37Z"
                },
                {
                    "text": "RIP meema",
                    "author": "@Matt-Carter",
                    "likes": 2,
                    "publishedAt": "2026-02-13T22:20:08Z"
                },
                {
                    "text": "July-Sept. trailer release, the world will eat it up",
                    "author": "@MegaLaidback",
                    "likes": 0,
                    "publishedAt": "2026-02-14T01:30:12Z"
                },
                {
                    "text": "John, the second post credit scene of Spider-Man no way home was the first trailer for doctor strange multiverse of madness. It was the first time it was seen. It dropped on YouTube weeks later. I was thinking they might do the same with doomsday.",
                    "author": "@jonathanradut2595",
                    "likes": 1,
                    "publishedAt": "2026-02-14T02:16:47Z"
                },
                {
                    "text": "I think the fact they are making a season 2 of Skeleton Crew will boost the numbers of season one. Word of mouth is getting around. But the fact it’s not a limited series means people liked it and that should get others interested.",
                    "author": "@TheTastic79",
                    "likes": 0,
                    "publishedAt": "2026-02-14T00:01:40Z"
                },
                {
                    "text": "john i’ve been watching you for a while now and you guys do a wonderful job for telling us what’s going on with movies and articles and IM SO LOOKING FORWARD TO SEEING DOOMSDAY AND ALSO HUGH JACKMAN THE SHEEP DETECTIVE TOO AND john keep continuing with speaking the truth and anyway i apologize for repeating of my feelings about hugh jackman continuing to be wolverine for 10 years and in my heart i truly want hugh jackman to be happy with his girlfriend and spend time with his girlfriend before projects starts and i’m not a impatient person or fan i just thought to support hugh jackman as wolverine but also wanted him to be happy with his girlfriend",
                    "author": "@jackiewarner1293",
                    "likes": 1,
                    "publishedAt": "2026-02-13T21:24:46Z"
                },
                {
                    "text": "Thanks",
                    "author": "@HowtoDnD1",
                    "likes": 0,
                    "publishedAt": "2026-02-13T23:14:36Z"
                },
                {
                    "text": "I would honestly be pissed if doom didn't kill anyone. He literally in the top 3 or top 5 strongest marvel characters of all time. Thanos was strong but doom is 10 times more powerful in him. This movie better have deaths. You can't have a 3 hour movie centered on Dr doom and not have him kill anyone. That would be the biggest disrespect in marvel history. I have a feeling big but not huge characters are gonna die. Like maybe antman, Sam Wilson, one or two of the thunderbolts. Like those kinds of characters will be killed. Maybe Charles Xavier too. But I don't think they'll kill off any of the main avengers or Loki either.",
                    "author": "@dylansava4082",
                    "likes": 3,
                    "publishedAt": "2026-02-13T21:40:59Z"
                },
                {
                    "text": "Dune 2 is a great movie…\n\nTO TAKE A NAP TO 44:50",
                    "author": "@VideoSense",
                    "likes": 0,
                    "publishedAt": "2026-02-14T00:41:03Z"
                },
                {
                    "text": "\"I had a punctured tire and had to wait an eon for assistance!\"",
                    "author": "@jimijones0",
                    "likes": 2,
                    "publishedAt": "2026-02-13T22:12:38Z"
                },
                {
                    "text": "Johns sports analogy, while I sort of agree and get it, it’s a bit off. You ask any player if they would rather make it to the finals 5 times and lose, or make it there just 1 time and win that 1 time and never make the finals again, they’re going to pick that 1 time.",
                    "author": "@JBtheWARVillain",
                    "likes": 6,
                    "publishedAt": "2026-02-13T21:38:19Z"
                }
            ]
        }
    ]
}