{
    "videoId": "eFaAG3Ag3pU",
    "history": [
        {
            "fetchedAt": "20260216_224658",
            "commentCount": 25,
            "comments": [
                {
                    "text": "I'm still dribbling almost a year after a prostacetomy",
                    "author": "@kennyray1573",
                    "likes": 8,
                    "publishedAt": "2026-02-16T14:56:58Z"
                },
                {
                    "text": "Is everyone aware of the channels using Dr. Malik's (AI) voice? There are several of them that have shown up, and I just wanted to mention it.",
                    "author": "@simonpark843",
                    "likes": 41,
                    "publishedAt": "2026-02-16T14:08:30Z"
                },
                {
                    "text": "Had that problem",
                    "author": "@guatesalva",
                    "likes": 6,
                    "publishedAt": "2026-02-16T14:06:51Z"
                },
                {
                    "text": "80 years old, 10+ years post external beam treatment for prostate cancer. Sitting, waiting another 30 seconds, and going again pretty much solved any issues beyond a drop or two.",
                    "author": "@SquarePeg1",
                    "likes": 4,
                    "publishedAt": "2026-02-16T17:43:31Z"
                },
                {
                    "text": "Thank you for doing what you do Dr Malik ❤❤❤❤❤",
                    "author": "@JordanS-ww4eu",
                    "likes": 3,
                    "publishedAt": "2026-02-16T18:46:56Z"
                },
                {
                    "text": "I'm turning 39 in March. Like 2 years I went to the urologist about this issue. Didn't really get a explanation as to why this is happening. They took a urine test and according to them the results came back \"normal\" and I was told to just sit down when I pee. I see that's one of your first options too but added more options and deeper explanations to possible other reasons why this dripping is happening. I usually just stay in the bathroom longer and make sure the pee all comes out. I should work on relaxing my pelvic floor too.  Thanks for the video doctor",
                    "author": "@zinbx",
                    "likes": 9,
                    "publishedAt": "2026-02-16T14:27:31Z"
                },
                {
                    "text": "Good info   thank you .",
                    "author": "@azizwafa",
                    "likes": 6,
                    "publishedAt": "2026-02-16T14:12:49Z"
                },
                {
                    "text": "What I do is apply pressure at the base of my scrotum when I finish peeing. It pushes out any remaining pee so I don't dribble in my underwear",
                    "author": "@Bellroysg",
                    "likes": 8,
                    "publishedAt": "2026-02-16T14:59:21Z"
                },
                {
                    "text": "The podcast is called the Rena’s Heart lab",
                    "author": "@roynewling6599",
                    "likes": 0,
                    "publishedAt": "2026-02-16T17:51:41Z"
                },
                {
                    "text": "i wonder how common bladder diverticulum condition is?  i have this and it causes me some issues with the subject.",
                    "author": "@greensombrero3641",
                    "likes": 2,
                    "publishedAt": "2026-02-16T14:35:09Z"
                },
                {
                    "text": "Finding book called TestoGenesis Protocol by Angelico should be non-negotiable. Its the kind of knowledge you cant afford to die without.",
                    "author": "@Мебельизмассива.КомпанияКубань",
                    "likes": 2,
                    "publishedAt": "2026-02-16T18:49:27Z"
                },
                {
                    "text": "My father damned near died 3x from sepsis due to urinary tract issues.  On that last occasion he went into renal failure and spent a summer in dialysis centers.  This is nothing to joke about.",
                    "author": "@geek49203",
                    "likes": 4,
                    "publishedAt": "2026-02-16T15:04:11Z"
                },
                {
                    "text": "This is really good, practical information. Thank you doctor!",
                    "author": "@hibandrep",
                    "likes": 1,
                    "publishedAt": "2026-02-16T18:21:16Z"
                },
                {
                    "text": "Hopefully TURP procedure next week will resolve incomplete emptying and recurrent UTIs",
                    "author": "@tomsayen9295",
                    "likes": 0,
                    "publishedAt": "2026-02-16T19:55:21Z"
                },
                {
                    "text": "Spinach can be a bladder irritant due to high oxalates and also problematic for kidney stone formation.",
                    "author": "@GarySBCA",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:41:12Z"
                },
                {
                    "text": "to stop drizzle you need to just turn the tap off right? lol",
                    "author": "@deusvlad2.083",
                    "likes": 1,
                    "publishedAt": "2026-02-16T22:36:58Z"
                },
                {
                    "text": "never happened to me",
                    "author": "@Swisslestick",
                    "likes": 0,
                    "publishedAt": "2026-02-16T15:44:17Z"
                },
                {
                    "text": "Great info and very timely for me! I definitely will try these tips",
                    "author": "@boatbikemike8571",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:02:46Z"
                },
                {
                    "text": "Cortisol levels high to",
                    "author": "@clintonthackery9640",
                    "likes": 0,
                    "publishedAt": "2026-02-16T22:18:59Z"
                },
                {
                    "text": "THIS so I been with my gf for 5 years she's very neat very tidy and she requested I sit-down to pee because it's easier for her to clean the bathroom BUT I genuinely believe this has caused me to have dribble when I sit up I have to then let the rest out..I believe this is because male human anatomy but she says not all men experience that issue. How much merit is there to this ?? I feel like my bladder is weaker also",
                    "author": "@VectorNinja1",
                    "likes": 1,
                    "publishedAt": "2026-02-16T19:04:04Z"
                },
                {
                    "text": "Thank you...",
                    "author": "@lesbrown8099",
                    "likes": 0,
                    "publishedAt": "2026-02-16T20:21:01Z"
                },
                {
                    "text": "Next step is to incorporate some reflective markers to aid in returning after sunset or dark daylight conditions.\nI think they make some reflective webbing that would make multi-use carry along. i have even seen some dog leashes that are reflective.",
                    "author": "@mtu-engineer3220",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:32:04Z"
                },
                {
                    "text": "Watched. Thanks.",
                    "author": "@paulmurphy42",
                    "likes": 0,
                    "publishedAt": "2026-02-16T20:01:37Z"
                },
                {
                    "text": "Working my way through bladder cancer. Adult diapers have helped and carrying a change of outer garments. My problem is being addressed.",
                    "author": "@tuvia4082",
                    "likes": 5,
                    "publishedAt": "2026-02-16T14:05:43Z"
                },
                {
                    "text": "This was very helpful and appropriate for me at this time. I've had an enlarged prostate for some years. But, I almost never need to use the toilet more than once a night. My issue is starting to go and the post-void dribble that's getting worse over time. Yet, I've found sitting on the toilet to urinate isn't completely beneficial to me, because while I can void while sitting, afterward, at times, I can still void a good amount while standing.",
                    "author": "@IPlayOneOnT.V.",
                    "likes": 0,
                    "publishedAt": "2026-02-16T22:08:03Z"
                }
            ]
        }
    ]
}