{
    "videoId": "DlzBErgATeM",
    "history": [
        {
            "fetchedAt": "20260212_005611",
            "commentCount": 25,
            "comments": [
                {
                    "text": "9??? Only 9 years for sending literal goverment secrets and our planets most powerfull weapon???",
                    "author": "@Golfjong",
                    "likes": 28,
                    "publishedAt": "2026-02-11T20:39:27Z"
                },
                {
                    "text": "\"You single-handedly brought us to the verge of total planetary destruction, years ahead of schedule. And, for that, we sentence you to nine years in prison!\"\n\"Oh no!!!\"\n\"It's OK. With good behavior, you'll be out in four.\"",
                    "author": "@andrewklang809",
                    "likes": 59,
                    "publishedAt": "2026-02-11T19:48:08Z"
                },
                {
                    "text": "Fuchs gets nine years for giving the Soviets everything, the Rosenbergs were executed for information on a fuse.",
                    "author": "@dennisdilmore7115",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:08:24Z"
                },
                {
                    "text": "Fuchs had returned to the UK before he was identified by MI5 as a possible spy. He was only charged with espionage, not treason, because the Soviet Union was technically still an ally when he passed on the information. he also passed the same information to the British. 14 years was the maximum sentence for espionage in Britain at the time.\nI'm currently reading Defend the Realm, the authorized history of MI5 by Christopher Andrew.",
                    "author": "@chrisvickers7928",
                    "likes": 1,
                    "publishedAt": "2026-02-11T23:03:16Z"
                },
                {
                    "text": "It's insane that he only got 9 years in prison for this considering how murderously anti-communist the US is.",
                    "author": "@KaradachTheHun",
                    "likes": 2,
                    "publishedAt": "2026-02-11T21:04:32Z"
                },
                {
                    "text": "OMG! It's Sparty!! Run away!!! RUN AWAY!!!!",
                    "author": "@ericvantassell6809",
                    "likes": 0,
                    "publishedAt": "2026-02-11T23:13:14Z"
                },
                {
                    "text": "As a German he wanted to punish the west for bombing Nazi Germany",
                    "author": "@andyplus1352",
                    "likes": 1,
                    "publishedAt": "2026-02-11T21:14:03Z"
                },
                {
                    "text": "Good thing he did that, america goverment was.itching tò fight the russian",
                    "author": "@potato88872",
                    "likes": 0,
                    "publishedAt": "2026-02-11T22:36:09Z"
                },
                {
                    "text": "If he wouldn't have given the bomb to sovits the world would have seen the amircan being the sole owner of the bomb and usa would have been even more unhinged then in our History ( for the time of 2 to 3 years till sovit got there own) a monopoly is never good and duopoly is not good but it is better than monopoly (bombs threat of mutual destruction somewhat in controversial way saved the world of its actually destruction in some way [not all ways ])",
                    "author": "@gyukgaming6037",
                    "likes": 5,
                    "publishedAt": "2026-02-11T20:20:28Z"
                },
                {
                    "text": "Fuchs served nine years in prison.  Meanwhile, the Rosenbergs, who may well not have even been spies, were executed.  WELP.",
                    "author": "@Eyerleth",
                    "likes": 33,
                    "publishedAt": "2026-02-11T19:44:02Z"
                },
                {
                    "text": "Imagine what the Soviets would have done to him if the situation was reversed",
                    "author": "@Darkangel754",
                    "likes": 3,
                    "publishedAt": "2026-02-11T21:08:45Z"
                },
                {
                    "text": "Kinda excitable for 1-2 years; so the truth is ussr was right on uss and uks heels; they are a large industrialized country after all",
                    "author": "@animn7386",
                    "likes": 0,
                    "publishedAt": "2026-02-11T21:49:05Z"
                },
                {
                    "text": "He should have been drawn and quartered. Nine years. smh",
                    "author": "@v.e.7236",
                    "likes": 3,
                    "publishedAt": "2026-02-11T21:37:15Z"
                },
                {
                    "text": "Giving stalin the nuclear bomb is a bad thing. Like treason level bad",
                    "author": "@drewpamon",
                    "likes": 2,
                    "publishedAt": "2026-02-11T21:35:03Z"
                },
                {
                    "text": "Sure he committed treason, but I think he did the right thing, imagine a world where the US is the only nuclear superpower in the world, today it's the world bully, imagine what would happen if there were no counterweights",
                    "author": "@dany0320",
                    "likes": 8,
                    "publishedAt": "2026-02-11T20:18:43Z"
                },
                {
                    "text": "It's crazy people are saying that this was good. The world has rested on a knifes edge since this happened.",
                    "author": "@paulvonlettow-vorbeck4302",
                    "likes": 9,
                    "publishedAt": "2026-02-11T20:23:25Z"
                },
                {
                    "text": "Real hero, now more than ever it is known that having a nuclear bomb is the only insurance against imperialist attacks.",
                    "author": "@arturovazquez7653",
                    "likes": 1,
                    "publishedAt": "2026-02-11T21:32:46Z"
                },
                {
                    "text": "He should have gotten the guillotine",
                    "author": "@Ryfael",
                    "likes": 4,
                    "publishedAt": "2026-02-11T20:30:09Z"
                },
                {
                    "text": "I can't really blame him. Men like Arthur Harris and Curtis LeMay were major advocates of strategic bombing and would've been all too happy to use multiple nuclear weapons if they could. No one nation or group of allied nations should have that kind of power.",
                    "author": "@sirhenrymorgan1187",
                    "likes": 1,
                    "publishedAt": "2026-02-11T20:58:06Z"
                },
                {
                    "text": "Is mad better than unilateral nuclear genocide as what happened to Japan in WW2?",
                    "author": "@Anonymous-n6i6m",
                    "likes": 1,
                    "publishedAt": "2026-02-11T22:33:34Z"
                },
                {
                    "text": "A hero. If only one nation had the bomb, it would have been terrible",
                    "author": "@alessandromarchesan5957",
                    "likes": 9,
                    "publishedAt": "2026-02-11T19:46:01Z"
                },
                {
                    "text": "True hero",
                    "author": "@NomeDeArte",
                    "likes": 7,
                    "publishedAt": "2026-02-11T19:45:14Z"
                },
                {
                    "text": "Men like this is why I have no sympathy for communists or their similar ilk.",
                    "author": "@chinesemassproduction",
                    "likes": 4,
                    "publishedAt": "2026-02-11T20:13:47Z"
                },
                {
                    "text": "why did he not get the death penalty (like he deserved btw)?",
                    "author": "@incursus1401",
                    "likes": 4,
                    "publishedAt": "2026-02-11T20:03:07Z"
                },
                {
                    "text": "The amusing part, McCarthy has been derided for paranoia about Soviet agents to the point his name is a meme, but everything found out proved he was correct.  We see the same thing today with Democrats and government bureaucracy today.  Crimes unpunished or lightly punished.",
                    "author": "@kamaeq",
                    "likes": 2,
                    "publishedAt": "2026-02-11T20:38:48Z"
                }
            ]
        }
    ]
}