{
    "videoId": "a9ZlYhgnI-g",
    "history": [
        {
            "fetchedAt": "20260217_202040",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Russ is making me fat with all these snacks and drinks.",
                    "author": "@quickperson68",
                    "likes": 247,
                    "publishedAt": "2026-02-17T14:07:27Z"
                },
                {
                    "text": "Glad to see you covering this aspect. The addition of playing epic games easily is a huge deal since many people have gotten lots of free game giveaways on that store",
                    "author": "@buzzrot",
                    "likes": 62,
                    "publishedAt": "2026-02-17T14:27:14Z"
                },
                {
                    "text": "Perfect timing. I was just exploring GameNative in my Odin 3. No idea what settings to adjust. I didn't see many guides out there. Thank you for this.",
                    "author": "@Maeiourk",
                    "likes": 14,
                    "publishedAt": "2026-02-17T15:39:33Z"
                },
                {
                    "text": "I'm glad to see GameNative has matured so much. Exciting times, excellent guide!",
                    "author": "@RJNY-86",
                    "likes": 24,
                    "publishedAt": "2026-02-17T14:41:11Z"
                },
                {
                    "text": "Thanks for covering us Russ!",
                    "author": "@dalalutkarsh",
                    "likes": 5,
                    "publishedAt": "2026-02-17T16:17:40Z"
                },
                {
                    "text": "I just purchased the AYN Thor and was super excited to get some lightweight PC games going with Gamehub but GameNative definitely sounds like the route I'd rather go. Thanks so much for spotlighting this!",
                    "author": "@itsmorphinetime",
                    "likes": 9,
                    "publishedAt": "2026-02-17T15:54:32Z"
                },
                {
                    "text": "\"Yeah man, I wanna do it\" is back for good! Yeah man! :D",
                    "author": "@Dimitar.Tsonov",
                    "likes": 14,
                    "publishedAt": "2026-02-17T14:31:51Z"
                },
                {
                    "text": "Just today I received my RP6! Thanks Russ for the guide!",
                    "author": "@JohnParr1990",
                    "likes": 9,
                    "publishedAt": "2026-02-17T14:06:05Z"
                },
                {
                    "text": "Just got my Ayn Thor last week so this is perfect I was having trouble setting PC games on this thing",
                    "author": "@Retrohut305",
                    "likes": 12,
                    "publishedAt": "2026-02-17T14:20:16Z"
                },
                {
                    "text": "I love that your videos always go in depth, for people that are already familiar with the scene, while still explaining everything in an easy way, with great graphics and explanations.",
                    "author": "@leonardos.1507",
                    "likes": 0,
                    "publishedAt": "2026-02-17T17:39:40Z"
                },
                {
                    "text": "Finally gamenative is getting more and proper and new video content",
                    "author": "@user-ux8gi8mn8p",
                    "likes": 5,
                    "publishedAt": "2026-02-17T14:43:11Z"
                },
                {
                    "text": "Do I need to watch this tutorial? - no.\nHave I grabbed snack and drink? - yes 😎",
                    "author": "@moxdox1529",
                    "likes": 6,
                    "publishedAt": "2026-02-17T14:02:03Z"
                },
                {
                    "text": "I was literally tinkering with this on my rp4pro last night! Thanks for the rundown and the tips!",
                    "author": "@danielc4510",
                    "likes": 0,
                    "publishedAt": "2026-02-17T17:20:06Z"
                },
                {
                    "text": "Incredible, I just got my RP6 today and this timing could not be more perfect. I plan to make it my little indie machine, this and the started guide are simply amazing, Much appreciated!",
                    "author": "@mr.martian7",
                    "likes": 0,
                    "publishedAt": "2026-02-17T18:25:27Z"
                },
                {
                    "text": "21:45 inverted Y axis on right thumbstick is wild",
                    "author": "@bastianarevalo2146",
                    "likes": 2,
                    "publishedAt": "2026-02-17T18:27:50Z"
                },
                {
                    "text": "i’m living for these videos, can’t wait to get my retroid",
                    "author": "@im2tired2sleep",
                    "likes": 0,
                    "publishedAt": "2026-02-17T18:15:18Z"
                },
                {
                    "text": "Exactly what I needed. Right on time as always 🙏",
                    "author": "@JUSTIC3FOR4LL",
                    "likes": 1,
                    "publishedAt": "2026-02-17T15:50:07Z"
                },
                {
                    "text": "Handheld gaming has come a long way i went all the way from the psp fat to ayaneo pocket s mini and now seeing you can also play pc game on these is kinda amazing! My next dream is we get portable ps3 library on these handheld soon",
                    "author": "@MegaVSable",
                    "likes": 5,
                    "publishedAt": "2026-02-17T14:52:19Z"
                },
                {
                    "text": "Wow, this is awesome. I've not used one of these apps before, but decided to try this out. The setup took under a minute. Ball x Pit and Ori have been loaded onto the Pocket ACE and we are feeling GREAT. Thanks, Russ!",
                    "author": "@zeni1hp",
                    "likes": 0,
                    "publishedAt": "2026-02-17T16:38:05Z"
                },
                {
                    "text": "I'm at a coffee shop while watching this Russ, so I can only grab a coffee and one of those tiny complementary coffee cookies. Hope it'll suffice! ❤️",
                    "author": "@VladNerd",
                    "likes": 16,
                    "publishedAt": "2026-02-17T14:59:24Z"
                },
                {
                    "text": "24:03 omg thank you. This is the game I've been struggling to get running since I picked up my RP5",
                    "author": "@Phoenixcaptain46",
                    "likes": 0,
                    "publishedAt": "2026-02-17T16:09:36Z"
                },
                {
                    "text": "TY! I have been hoping you'd make a gamenative video.",
                    "author": "@ravenknight_gaming3177",
                    "likes": 0,
                    "publishedAt": "2026-02-17T17:00:57Z"
                },
                {
                    "text": "Dude perfect timing. I got my Thor a coupon of weeks ago and I haven’t decided which direction I’m going to take for some PC games like Sea of Stars I have on both Steam and Switch.",
                    "author": "@robhulson",
                    "likes": 0,
                    "publishedAt": "2026-02-17T16:09:40Z"
                },
                {
                    "text": "Epic video, very helpful! Thanks Russ!!",
                    "author": "@jaideepnaik7454",
                    "likes": 0,
                    "publishedAt": "2026-02-17T17:14:20Z"
                },
                {
                    "text": "THANK YOU! This got a game working that was NOT working in gamehub!!!",
                    "author": "@RichardServello",
                    "likes": 0,
                    "publishedAt": "2026-02-17T16:43:53Z"
                }
            ]
        }
    ]
}