{
    "videoId": "5EZFrSXBDiA",
    "history": [
        {
            "fetchedAt": "20260216_191345",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Only cool people like, comment and subscribe!",
                    "author": "@Gamingwithmatteo311",
                    "likes": 8,
                    "publishedAt": "2026-02-16T14:37:43Z"
                },
                {
                    "text": "PSVR2 is my first options for VR due to OLED true blacks , adaptive triggers and haptic feedback with headset rumble at an affordable price! ❤ I am also a trophy hunter. I am optimistic for its future so lets hope for all the best 😊",
                    "author": "@Man9oorKSA",
                    "likes": 9,
                    "publishedAt": "2026-02-16T16:57:49Z"
                },
                {
                    "text": "Seeing how amazing No Man's Sky looks, makes me think about all these beautiful sci-fi retro shooters that could've been ported to VR. Halo, Half-Life 2, Deus Ex and especially Unreal. Imagine Facing Worlds map in VR with the music we all love. I'm so crazy about Unreal games I created a documentary on my channel for every game for 25th Anniversary of Unreal Tournament. Over 350 maps, 1TB of footage to edit, 1 year in the making but who can stop us when we love something? :)",
                    "author": "@angelsidefx",
                    "likes": 11,
                    "publishedAt": "2026-02-16T16:03:39Z"
                },
                {
                    "text": "Psvr2 guy here as well 😊 Ofc we want your game on that platform",
                    "author": "@DoomSly82",
                    "likes": 2,
                    "publishedAt": "2026-02-16T16:51:46Z"
                },
                {
                    "text": "Yeah I would play your game on psvr2",
                    "author": "@cory2016",
                    "likes": 3,
                    "publishedAt": "2026-02-16T16:40:23Z"
                },
                {
                    "text": "id love it on the psvr2",
                    "author": "@RustyJMedia",
                    "likes": 2,
                    "publishedAt": "2026-02-16T17:23:54Z"
                },
                {
                    "text": "I would love your game on psvr2 man!! I am going to try to start my game as soon as i can get the funds up for a high end pc..",
                    "author": "@kilartist1thedreamweaverga3",
                    "likes": 3,
                    "publishedAt": "2026-02-16T16:20:08Z"
                },
                {
                    "text": "As a PSVR2 user…I gladly welcome any and all new games (besides A.I. shovelware).",
                    "author": "@YusukeTomB",
                    "likes": 2,
                    "publishedAt": "2026-02-16T17:49:16Z"
                },
                {
                    "text": "My first experience into VR was the OG Playstation VR at launch in 2016.  I immediately went out and got an oculus rift and then I have owned many headsets since then.  As soon as I put in the included Demo Disk that came with PSVR I was absolutely hooked forever.  Firewall was the first game in VR that I really dove into and we had a squad that plated together for months.",
                    "author": "@angrybeaver6667",
                    "likes": 0,
                    "publishedAt": "2026-02-16T17:37:22Z"
                },
                {
                    "text": "I’ve had all the quest headsets and both ps headsets. My quest 3 broke a few weeks ago, and along with meta being aholes I didn’t want to go back to their products. The psvr 2 on pc is glorious! Zero latency and no compression artifacts. The mura is much less pronounced on pcvr with it. Gaming on ps5 with psvr 2 is great too",
                    "author": "@Quest4Horror",
                    "likes": 3,
                    "publishedAt": "2026-02-16T16:59:47Z"
                },
                {
                    "text": "i just like the psvr2 headset i find it 10x more comfortable that the Q3 i use it for pcvr tho the tracking is a little janky",
                    "author": "@hollow9946",
                    "likes": 1,
                    "publishedAt": "2026-02-16T19:00:52Z"
                },
                {
                    "text": "What no more doom and gloom?",
                    "author": "@amd8365",
                    "likes": 2,
                    "publishedAt": "2026-02-16T16:35:08Z"
                },
                {
                    "text": "I'd like to see your game on the PSVR2!",
                    "author": "@innesmacdonald1344",
                    "likes": 0,
                    "publishedAt": "2026-02-16T19:01:13Z"
                },
                {
                    "text": "I'm looking forward to picking up a dirt cheap PSVR 2 second hand in a few years. Will be nice for sim racing.",
                    "author": "@seebarry4068",
                    "likes": 1,
                    "publishedAt": "2026-02-16T17:52:43Z"
                },
                {
                    "text": "I realy appreciate your news channel dude, this helps me plan my content ahead ♥",
                    "author": "@SparrrowEXE",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:16:09Z"
                },
                {
                    "text": "VR2 here.",
                    "author": "@VIRTUA-AM2",
                    "likes": 1,
                    "publishedAt": "2026-02-16T16:47:15Z"
                },
                {
                    "text": "on man, let's see this",
                    "author": "@thevrarchive8169",
                    "likes": 0,
                    "publishedAt": "2026-02-16T15:57:10Z"
                },
                {
                    "text": "PSVR2 is my daily PC headset since 2 years.",
                    "author": "@b.s.7693",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:32:48Z"
                },
                {
                    "text": "All good news never heard of inverse, of its free I’ll be playing this week",
                    "author": "@youngobesity",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:30:22Z"
                },
                {
                    "text": "Looking fresh there Brother! Don’t be lonely though, I’m always up for a game of something, especially games like Battlemarked. Zero caliber 2 remastered would be really fun in co-op too! 👍🏻",
                    "author": "@LeeoSeven",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:15:34Z"
                },
                {
                    "text": "I really hope you get a chance to review the Pimax Crystal Super Micro OLED and also the Dream Air.  Did you ever get a chance to use the Crystal Super 50ppd?  I have been impressed by it and now that it has the lighthouse faceplate, its solid all around, but a 5090 is a must for it.",
                    "author": "@angrybeaver6667",
                    "likes": 0,
                    "publishedAt": "2026-02-16T17:30:03Z"
                },
                {
                    "text": "Alsovi think re9 will come to psvr2 in a year most of time it come out in a year",
                    "author": "@cory2016",
                    "likes": 2,
                    "publishedAt": "2026-02-16T16:51:52Z"
                },
                {
                    "text": "Pinball FX with UEVR @ 120fps with ray tracing on psvr2 PC is amazing.  Or 3d movie viewing.  5090 as well.",
                    "author": "@eeeeyuke",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:34:37Z"
                },
                {
                    "text": "PSVR2 on PC gang! Games like Metro and HL:A just shine on OLED. You really need those pitch blacks to elevate the unnerving factor. But if you can afford a microoled instead go for it!",
                    "author": "@MacPanama",
                    "likes": 2,
                    "publishedAt": "2026-02-16T16:39:16Z"
                },
                {
                    "text": "I have quest and PSVR2 - of those my PSVR2 is my favorite. I would definitely be interested in your game coming to PSVR2. \nAs to what you said about Sony - I was extremely disappointed about state of play and have major hopium that there will be a blog post or a mini show focusing on PSVR2 given we have its 3 year next weekend. Sony does seem to support the device but quietly in the background via throwing money at big external devs about once a year - they pushed hard to secure PSVR2 support for Microsoft flight simulator which should be coming this year.",
                    "author": "@mattankuda5766",
                    "likes": 2,
                    "publishedAt": "2026-02-16T17:22:50Z"
                }
            ]
        }
    ]
}