{
    "videoId": "HdG5WmtBB6k",
    "history": [
        {
            "fetchedAt": "20260213_020113",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Alright my friends… I want to know 👀 Which truth hit a little too close to home?\n\nAnd more importantly… what room in your house is frustrating you RIGHT NOW? Tell me what’s not working. I read these comments and they inspire future videos because my whole goal is to help YOU create a home you truly love. \n\nSo…let’s talk about it. RR",
                    "author": "@rebeccarobeson1",
                    "likes": 11,
                    "publishedAt": "2026-02-12T20:37:07Z"
                },
                {
                    "text": "I love when you do these for people - I learn so much and you are so right every time 👍👍❤️❤️",
                    "author": "@Reillygirl",
                    "likes": 19,
                    "publishedAt": "2026-02-12T20:16:45Z"
                },
                {
                    "text": "Literally died laughing at \"there is no U-Haul attached to your hearse!\"😂⚰️💀",
                    "author": "@sue-shu",
                    "likes": 24,
                    "publishedAt": "2026-02-12T21:15:35Z"
                },
                {
                    "text": "IRON THE CURTAINS!!! OMG THANK YOU for saying this!",
                    "author": "@LisaMarie-br8tn",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:53:23Z"
                },
                {
                    "text": "I've learned so much from you already!! YOU Rock!",
                    "author": "@pambuck7043",
                    "likes": 6,
                    "publishedAt": "2026-02-12T20:51:22Z"
                },
                {
                    "text": "I would love you to come to my home too!",
                    "author": "@marjorieeaston293",
                    "likes": 6,
                    "publishedAt": "2026-02-12T20:12:58Z"
                },
                {
                    "text": "You are an amazing, genuine lady! I have learned so much from watching your videos. Thank you for taking the time to make them!",
                    "author": "@Blessed-dsg",
                    "likes": 1,
                    "publishedAt": "2026-02-13T00:49:00Z"
                },
                {
                    "text": "Love it…best video ever!",
                    "author": "@carolkelly638",
                    "likes": 3,
                    "publishedAt": "2026-02-12T21:17:09Z"
                },
                {
                    "text": "Hello Rebecca!! Oh my goodness I was shocked watching your new video today.. I saw my consultation with you about my entertainment center. I have been with you from your first youtube video's to design sessions member.  It has been the BEST investment ever!! I have to say that even after learning many of your principals having our consultation reaffirmed many ideas I had and you gave sooo many more ideas!!! The design consultation was the best investment I have ever  done!! And Rebecca you are AHHHHmazing !!!  Beautiful soul inside and out!!",
                    "author": "@reneewirtanen6114",
                    "likes": 5,
                    "publishedAt": "2026-02-12T21:35:34Z"
                },
                {
                    "text": "I love all the ladies responses.  I feel so overwhelmed in my house.  Way too many things.",
                    "author": "@KAstarGod",
                    "likes": 0,
                    "publishedAt": "2026-02-12T23:23:32Z"
                },
                {
                    "text": "I see all the old stuff coming back with vengeance and I think it’s pretty too",
                    "author": "@DorisBallard-h2b",
                    "likes": 2,
                    "publishedAt": "2026-02-12T21:15:01Z"
                },
                {
                    "text": "Rebecca you are awesome.  You have the \"eye\" and the ability to explain your thoughts and visions in a very clear and understandable way.  You just know if something looks right or if it is off.  Thanks for giving us the skills and directions to make things look \"right\".",
                    "author": "@janeeberly4289",
                    "likes": 9,
                    "publishedAt": "2026-02-12T20:31:57Z"
                },
                {
                    "text": "If I wake up kind of down and low energy, you perk me right up! You don’t just make homes look more beautiful, life too! 💗😘",
                    "author": "@susandelongis885",
                    "likes": 1,
                    "publishedAt": "2026-02-12T22:06:57Z"
                },
                {
                    "text": "I think you are so darn talented!!! I’ve learned so much from you! ❤",
                    "author": "@mariannedressler6784",
                    "likes": 0,
                    "publishedAt": "2026-02-13T00:20:11Z"
                },
                {
                    "text": "Love your design recommendations!",
                    "author": "@christinepokriefka9173",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:22:12Z"
                },
                {
                    "text": "My problem is getting my husband on board with hanging the curtains up to the ceiling. Among others.  TV, lighting, light fixtures etc.\nI really live watching and learning from you.",
                    "author": "@terrihart2133",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:38:04Z"
                },
                {
                    "text": "You are super sweet on the way you  help people, You truly are a wealth of information Just love listening to you speak Thank you❤",
                    "author": "@peggan471",
                    "likes": 0,
                    "publishedAt": "2026-02-13T00:05:36Z"
                },
                {
                    "text": "lol my TV is small and inside a cabinet.",
                    "author": "@Melissa-w3b",
                    "likes": 2,
                    "publishedAt": "2026-02-12T21:19:36Z"
                },
                {
                    "text": "Amen on the area rugs I think people just don't want to spend the proper amount of money",
                    "author": "@juderichard-1976",
                    "likes": 1,
                    "publishedAt": "2026-02-12T21:55:13Z"
                },
                {
                    "text": "You have such an eagle eye with all your experience. Your suggestions are so helpful and fun too.Love your honesty and am a fan and viewer for a very long time. I love my home and love high low since I’m young. I’m your age now and still get inspired",
                    "author": "@loretta7851",
                    "likes": 0,
                    "publishedAt": "2026-02-12T23:33:44Z"
                },
                {
                    "text": "You are, amazing Becky. We trust you so, you can say anything you want to us. Take care😊❤",
                    "author": "@soffyabad",
                    "likes": 0,
                    "publishedAt": "2026-02-12T22:56:12Z"
                },
                {
                    "text": "Your hair looks great. You  look stylish and fabulous.",
                    "author": "@Kathleen-q9w",
                    "likes": 0,
                    "publishedAt": "2026-02-13T00:44:02Z"
                },
                {
                    "text": "Amazing video! I have the same plant that is sitting over your counter. Your pot has a metallic sheen to it ❤️",
                    "author": "@ingeborgbryce4197",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:32:41Z"
                },
                {
                    "text": "Love this video! I have used several of your design tips! My favorite is the one when you went to that young mom’s home and did the 3 big mirrors on the dining room wall! I headed right over to  Hobby Lobby with the intention of getting the same ones for above my couch on a vaulted wall. Instead, I got 6 square pieces and stacked them 2 high and 3 wide. Amazing! I never would have thought of this if you hadn’t posted that video with the 3 mirrors!",
                    "author": "@Jaclynjillcarroll",
                    "likes": 0,
                    "publishedAt": "2026-02-13T00:00:03Z"
                },
                {
                    "text": "Every time I see you, you look more amazing than before. Been following you for 3 years and taken tips to incorporate into my home. You are an inspiration❤.",
                    "author": "@barbara7611",
                    "likes": 0,
                    "publishedAt": "2026-02-12T21:38:12Z"
                }
            ]
        }
    ]
}