{
    "videoId": "uxbEyVUkKM4",
    "history": [
        {
            "fetchedAt": "20260218_163911",
            "commentCount": 9,
            "comments": [
                {
                    "text": "I don't mind being single. I mind feeling lonely.",
                    "author": "@scratchybrush",
                    "likes": 16,
                    "publishedAt": "2026-02-18T14:14:20Z"
                },
                {
                    "text": "I am of the catastrophic variety",
                    "author": "@Billbeaux",
                    "likes": 3,
                    "publishedAt": "2026-02-18T14:05:23Z"
                },
                {
                    "text": "I count it a blessing these days. Relationships are a scam in contemporary times.",
                    "author": "@b5f096e4",
                    "likes": 1,
                    "publishedAt": "2026-02-18T14:32:40Z"
                },
                {
                    "text": "Hilariously cheerful single woman here. I know that I am enough, and I am the right person and don't need anyone to want me because I love and approve of myself.  I went to a therapist 30+ years ago after a failed relationship devastated me which seems incredible to me now. But my therapist, Molly, told me that I needed to learn to love myself. She suggested I get a dog to do it, and I told her the dog wasn't necessary, that I could do that. And thankfully I have. I've thought of writing this  on the wall in my bedroom--Imagine a woman in love with herself...😊❤",
                    "author": "@sbrehabaddict",
                    "likes": 2,
                    "publishedAt": "2026-02-18T14:26:18Z"
                },
                {
                    "text": "I'm in between and I'm working on being in the happy single group. Most days I'm in that group, but there are times, days when I'm not so happy about being single",
                    "author": "@mikaelah8254",
                    "likes": 1,
                    "publishedAt": "2026-02-18T15:14:37Z"
                },
                {
                    "text": "I don’t date anymore because woman I like. Need more money than I make",
                    "author": "@Callmesmitty",
                    "likes": 4,
                    "publishedAt": "2026-02-18T14:08:15Z"
                },
                {
                    "text": "Feels impossible to balance.  Can't realistically afford rent or a house mortgage without someone else.  Social media makes you feel lonely even if you're in a relationship.  Travelling solo sucks (unless you use a group like via Gadventures or something, and then hope you get lucky with a good group instead of solo weirdos).  Eating solo sucks.  Cinema alone sucks.  And if we don't have kids, there's less to pay taxes toward your care when you're older.\n\nBut being with someone can suck too.  More money spent each month and the pressure that adds.  Constantly needing to think of date ideas.  You end up missing your alone time...even though during that alone time you hate being alone and want someone else.  Ugh.",
                    "author": "@Dynasty1818",
                    "likes": 0,
                    "publishedAt": "2026-02-18T14:32:39Z"
                },
                {
                    "text": "Being attractive and single is ok, otherwise it is probably your lack of attraction that means you can not date people that you like. But SOL is too kind to point that out.",
                    "author": "@LastLinux",
                    "likes": 0,
                    "publishedAt": "2026-02-18T15:01:56Z"
                },
                {
                    "text": "Woman here. After decades of caring for others, I'm alone now and happier than I have ever been. I don't need a thing from the outside world. I'm not A-lone. I'm lone, like a wolf.  AH-WOOOOOO! IF you are a nice person, you can find company.",
                    "author": "@FlowerBoots",
                    "likes": 1,
                    "publishedAt": "2026-02-18T14:46:07Z"
                }
            ]
        }
    ]
}