{
    "videoId": "OpzyvWuRGhk",
    "history": [
        {
            "fetchedAt": "20260213_020104",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Homemade Apple Pie Steps:\n\nIngredients\nCrust: 2 (9-inch) pie crusts (homemade or store-bought)\nApples: 6–8 cups (peeled, cored, and 1/4-inch sliced) – Granny Smith, Honeycrisp, or a mix are recommended\nSugar: 1/2 cup granulated sugar and 1/4 cup packed light brown sugar\nThickener: 1/4 cup all-purpose flour or cornstarch\nSpices & Flavor: 1 tsp cinnamon, 1/4 tsp nutmeg, 1 tbsp lemon juice\nFat: 2 tbsp unsalted butter, cubed (for dotting)\nFinish: 1 large egg + 1 tbsp milk (for egg wash), coarse sugar (optional) \nStep-by-Step Instructions\n1. Prepare the Crust\nIf making homemade, combine flour, salt, and chilled butter, then add ice-cold water until the dough just holds together.\nDivide into two disks, wrap in plastic, and chill for at least 1 hour.\nOn a floured surface, roll out one disk to a 12-inch circle and place it in a 9-inch pie plate. \n2. Prepare the Filling\nPeel, core, and slice apples to 1/4-inch thickness.\nIn a large bowl, toss apple slices with lemon juice, sugars, flour (or cornstarch), cinnamon, and nutmeg until well coated.\nTip: Let the mixture sit for 20 minutes to allow the spices to penetrate. \n3. Assemble the Pie\nPreheat oven to 400°F (200°C) or 425°F (220°C) depending on your recipe.\nSpoon the apple filling into the bottom crust, mounding slightly in the center.\nDot the top of the apples with small pieces of butter.\nRoll out the second disk of dough and place it on top of the filling.\nTrim excess dough, seal the edges by pinching or fluting, and cut 4–5 slits in the top for steam ventilation.\nBrush the top crust with egg wash and sprinkle with sugar. \n4. Bake the Pie\nPlace the pie on a rimmed baking sheet (to catch leaks) on the lower-middle rack.\nBake at 400°F–425°F for 15-25 minutes, then reduce oven temp to 350°F–375°F for another 40-50 minutes.\nTip: Cover the edges with a pie shield or foil if they brown too quickly.\nThe pie is done when the crust is deep golden brown and the filling is bubbling through the vents. \n5. Cool and Serve\nPlace the pie on a wire rack and let it cool for at least 3 hours. Note: Cutting into a warm pie will result in runny filling´´´´´´",
                    "author": "@XLARITA-x4b",
                    "likes": 140,
                    "publishedAt": "2026-02-13T01:55:13Z"
                },
                {
                    "text": "12:24 That was pure evil.",
                    "author": "@MickeyMousePlushShow1928",
                    "likes": 146,
                    "publishedAt": "2026-02-13T01:24:59Z"
                },
                {
                    "text": "9:53 That was smooth af 😮",
                    "author": "@21kClxoudy",
                    "likes": 36,
                    "publishedAt": "2026-02-13T01:27:25Z"
                },
                {
                    "text": "The heroes who watched the video in less than five hours should gather here....´´´",
                    "author": "@XLARITA-x4b",
                    "likes": 112,
                    "publishedAt": "2026-02-13T01:37:21Z"
                },
                {
                    "text": "The heroes who watched the video in less than five hours should gather here.....",
                    "author": "@gotopb9328",
                    "likes": 195,
                    "publishedAt": "2026-02-13T01:29:06Z"
                },
                {
                    "text": "6:52  I love how the SML Danger Theme plays the moment \"Can't Hold Us\" started playing😭🤣😭🤣",
                    "author": "@animederek0392",
                    "likes": 5,
                    "publishedAt": "2026-02-13T01:48:46Z"
                },
                {
                    "text": "R.I.P. Robin Williams (He was The Genie)",
                    "author": "@DavidPeartFanProductions",
                    "likes": 13,
                    "publishedAt": "2026-02-13T01:30:38Z"
                },
                {
                    "text": "I honestly feel bad for that Genie",
                    "author": "@sharkgames8332",
                    "likes": 30,
                    "publishedAt": "2026-02-13T01:26:58Z"
                },
                {
                    "text": "Idea 'sml movie: Cody's puzzle\" its were cody takes his two friends to his house were ken and cody are working on a puzzle but ever time cody and ken is on the last piece someone breaks it one idea of that is Joseph shoots a basketball in codys mini hoop the ball bounces off the rim and lands on the puzzle breaking it-love you logan😊",
                    "author": "@immortalsnail-y5k",
                    "likes": 0,
                    "publishedAt": "2026-02-13T02:00:35Z"
                },
                {
                    "text": "SML idea Cody fails the test for the first time got more then his parents kicked him the house for getting a F and Cody live with a different family make this a top comment so Logan can see this",
                    "author": "@fredydelvalle1984",
                    "likes": 1,
                    "publishedAt": "2026-02-13T01:56:36Z"
                },
                {
                    "text": "0:19 He's clearly becoming Goodman's successor",
                    "author": "@elvininoa3367",
                    "likes": 13,
                    "publishedAt": "2026-02-13T01:24:42Z"
                },
                {
                    "text": "1:33 Rose found out Marvin ran over her cat from the last episode.",
                    "author": "@embricke.coyote4173",
                    "likes": 20,
                    "publishedAt": "2026-02-13T01:27:34Z"
                },
                {
                    "text": "the effects by Nicktastic looked amazing great to see one of the new vfx members already on a video",
                    "author": "@comehelpmae",
                    "likes": 2,
                    "publishedAt": "2026-02-13T01:54:47Z"
                },
                {
                    "text": "The ceiling really can’t hold him",
                    "author": "@JaydenSeldon",
                    "likes": 3,
                    "publishedAt": "2026-02-13T01:31:21Z"
                },
                {
                    "text": "I would wish for the ability to teleport so I can teleport to places and meet people 😂",
                    "author": "@Blaze252_The_Ace_of_M.O.M",
                    "likes": 0,
                    "publishedAt": "2026-02-13T02:00:15Z"
                },
                {
                    "text": "SML idea this is a really amazing and brand new concept that they have never thought of or done so basically it would be a video where Cody is upset because he was born in a leap year and he built a Time Machine and he goes back in time to stop his mother from giving birth on that date, but he figure out that his mother was in his real mother, and he was adopted not gonna lie you might have to pay me for this concept",
                    "author": "@Pinkdiamon0",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:59:18Z"
                },
                {
                    "text": "Respect to the kid who made an entire recipe for homemade Apple Pie",
                    "author": "@Leonamous123",
                    "likes": 0,
                    "publishedAt": "2026-02-13T02:00:18Z"
                },
                {
                    "text": "SML Movie Idea: The Genie’s Revenge\nPlot: Basically, Rose feels bad for the Genie, so she finds the lamp and sets him free, and this makes the Genie set out to get his revenge on Jeffy, Marvin, and Brooklyn Guy!",
                    "author": "@crossoverproductions2395",
                    "likes": 5,
                    "publishedAt": "2026-02-13T01:35:55Z"
                },
                {
                    "text": "I would wish to set the Genie free so that he doesn’t have to suffer from any more blumpkins",
                    "author": "@almonkeyboy5250",
                    "likes": 5,
                    "publishedAt": "2026-02-13T01:33:05Z"
                },
                {
                    "text": "6:10 poor guy 😂😂",
                    "author": "@thesmg201show",
                    "likes": 9,
                    "publishedAt": "2026-02-13T01:47:59Z"
                },
                {
                    "text": "SML Idea: Jeffy Unhuman\n\nA test is run on jeffy in which jeffy has no interactions with anyone for years, in a small room with water and a bed, and everything is documented on a security camera. It is a test to see if humans are dependent on parents and others. When jeffy is let out of the room he is feral and doesn't recognize anyone anymore, and slowly has to regain his memories like how to walk and talk\n\nthis is based off a game called pikabuu unhuman or smth",
                    "author": "@PhinnKonieczny-jj3hp",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:58:28Z"
                },
                {
                    "text": "I am surprised they are actually returning to the genie plotline. Thought they would have just left it alone as a running gag or something",
                    "author": "@michaeldotYT",
                    "likes": 6,
                    "publishedAt": "2026-02-13T01:26:16Z"
                },
                {
                    "text": "Does anyone remember the old SML when Cody was begging to be in the Mario games because he wasn’t a playable character? Now in Mario Tennis Fever they finally added him, along with characters like Goomba — which is funny because he used to get mad when they added characters like that instead of him. And remember when he said it didn’t even matter if the characters didn’t have arms? 😂",
                    "author": "@SebasCuarta",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:55:47Z"
                },
                {
                    "text": "I feel sorry for the genie he didn't deserve that including the ending and I kinda agree with Jeffy and Goodman Marvin should have instead of wishing for a billion dollars he should have gotten 31 billion and also that no one can remove the money but him",
                    "author": "@JasmineVelez-n9q",
                    "likes": 1,
                    "publishedAt": "2026-02-13T01:57:48Z"
                },
                {
                    "text": "BRO: \"SML\" legit made the: \"Genie\" sing my favorite song: \"Can't Hold Us\" in the video and also: \"SML\" put the: \"Can't Hold Us\" song in the description below of the video and that is really AWESOME!!!!",
                    "author": "@DallenNye17",
                    "likes": 0,
                    "publishedAt": "2026-02-13T01:58:27Z"
                }
            ]
        }
    ]
}