{
    "videoId": "t1IV5G1ptBQ",
    "history": [
        {
            "fetchedAt": "20260215_220746",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Take control and protect your files! Sign up to Proton Drive for FREE!  https://proton.me/howmoneyworks",
                    "author": "@HowMoneyWorksUncut",
                    "likes": 4,
                    "publishedAt": "2026-02-13T01:04:09Z"
                },
                {
                    "text": "The main issue with UBI is that the rich would rather have everyone else die rather than pay any form of taxes.",
                    "author": "@atzouff",
                    "likes": 239,
                    "publishedAt": "2026-02-15T16:15:13Z"
                },
                {
                    "text": "The people who already have everything are playing a 'heads I win, tails you lose' game with all of our housing, health, safety, food and water. What left is there for us but an army of Luigis?",
                    "author": "@iconsting",
                    "likes": 376,
                    "publishedAt": "2026-02-15T16:25:41Z"
                },
                {
                    "text": "In America, people who lose their jobs also lose their health insurance.  So those people will dramatically cut back on healthcare, like doctor visits and dental care.  If you're a dental hygienist, you're thinking \"AI can't replace me\", but if the dentist has half as many patients, then the dentist needs half as many dental hygienists.",
                    "author": "@stevechance150",
                    "likes": 278,
                    "publishedAt": "2026-02-15T15:57:27Z"
                },
                {
                    "text": "Those poor Stakeholders will lose their pocket money, we can't let that happy 😢",
                    "author": "@MrAdBounty",
                    "likes": 260,
                    "publishedAt": "2026-02-15T15:07:58Z"
                },
                {
                    "text": "wait youre telling me the whale economy from games is coming irl? OH NO NO NO NO",
                    "author": "@CssHDmonster",
                    "likes": 121,
                    "publishedAt": "2026-02-15T15:23:27Z"
                },
                {
                    "text": "Every time Microsoft is mentioned, Microslop is showing up for me. \n\nI love extensions 🤣🤣🤣",
                    "author": "@nothereandthereanywhere",
                    "likes": 120,
                    "publishedAt": "2026-02-15T15:30:08Z"
                },
                {
                    "text": "I still think C-suite execs need to realize that AI could easily replace them in decision-making. Easily.",
                    "author": "@jasonirons_299",
                    "likes": 77,
                    "publishedAt": "2026-02-15T15:57:07Z"
                },
                {
                    "text": "Rampant unemployment and further loss of work. We are reaching the point were money doesn't work.",
                    "author": "@swedichboy1000",
                    "likes": 72,
                    "publishedAt": "2026-02-15T15:15:56Z"
                },
                {
                    "text": "I wish economists actually understood LLMs and the issues they'll have with scaling and doing what they say it will. I understand that part but I don't understand economics so it would be nice to hear someone with a good understanding of both fields.",
                    "author": "@austinphillip2164",
                    "likes": 35,
                    "publishedAt": "2026-02-15T16:42:36Z"
                },
                {
                    "text": "Can't wait to live in the streets, or with 9 other people",
                    "author": "@gamerchair9330",
                    "likes": 33,
                    "publishedAt": "2026-02-15T16:16:06Z"
                },
                {
                    "text": "Billionaires: \"If you give us all the money, there will be UBI\" \nSure, and I have a bridge to sell you.",
                    "author": "@occupationalhazard",
                    "likes": 17,
                    "publishedAt": "2026-02-15T16:55:45Z"
                },
                {
                    "text": "It’s well known in the consulting industry that Deloitte has always paid well below market value so only the most desperate or newest workers accept work from them. When I was consulting, average wages for an analyst was $70k/year. Deloitte paid $50k for the same job.",
                    "author": "@heatherthurber4695",
                    "likes": 19,
                    "publishedAt": "2026-02-15T16:23:38Z"
                },
                {
                    "text": "Why this man posting in my normal hours?\n\nAm I people?",
                    "author": "@bionmccool",
                    "likes": 188,
                    "publishedAt": "2026-02-15T15:03:16Z"
                },
                {
                    "text": "In short, the Roaring 20s are getting an AI remake.",
                    "author": "@keeblebrox",
                    "likes": 9,
                    "publishedAt": "2026-02-15T17:45:54Z"
                },
                {
                    "text": "The Jetsons addressed this , they had a running gag that Jim Jetsons boss was over working him because he worked 10 minutes over his 1 day a week job.\n\nThe idea is that the worker is protected and paid to ensure they can live the ‘American Dream’, have a home, a family and a holiday.\n\n\nThen we threw it all away in the 1980’s and 50 years later a significant number of people are looking down the barrel of a financial/AI gun.",
                    "author": "@marcredsell2622",
                    "likes": 81,
                    "publishedAt": "2026-02-15T16:03:53Z"
                },
                {
                    "text": "What's really striking is that the technology exists, progress is being made. But the level of investment is just absurd. This is technology that in 20 years of persistent, cautious development will change everything. \n\nInstead, they're hyperscaling and hyping themselves up that everything's going to change next year.",
                    "author": "@NinjaMan47",
                    "likes": 22,
                    "publishedAt": "2026-02-15T15:26:40Z"
                },
                {
                    "text": "The AI bubble bursting could actually lead to full systemic change. This is definitely one of those times it is better to let the existing system burn. \nMuch like a civil war, no one will like the time during which the mad king is deposed but the survivors will see a better tomorrow. \n\nLike how Jefferson thought the only way to cure systemic corruption is to have a revolution, hence his 2nd amendment. \nThe economy tends to only improve and get enough safeguards creating upwards momentum when companies collapse and are allowed to die. No bailouts, no manipulation to maintain the status quo and if it happens directly maybe involving that 2nd amendment, no army protection.",
                    "author": "@liamnehren",
                    "likes": 10,
                    "publishedAt": "2026-02-15T17:47:24Z"
                },
                {
                    "text": "The Luddites were right all along.",
                    "author": "@JARV9701",
                    "likes": 35,
                    "publishedAt": "2026-02-15T16:34:52Z"
                },
                {
                    "text": "And then this : employees who use AI burn out more than those who don't. When AI takes over some of your tasks it doesn't mean you get to go home earlier. When the AI finishes a task you still need to fix and process the result, in addition to the other tasks you took on in parallel. Do this too long and you burn out. AI doesn't reduce your workload, it increases it.",
                    "author": "@Not_An_Expert",
                    "likes": 6,
                    "publishedAt": "2026-02-15T18:19:38Z"
                },
                {
                    "text": "Ah sweet, two paths - getting replaced by a robot, or maybe your boss is replaced by a robot and you are stuck in the Paperclip Production situation",
                    "author": "@potchatokpotchatok6084",
                    "likes": 11,
                    "publishedAt": "2026-02-15T16:45:56Z"
                },
                {
                    "text": "Glad to hear you kept your silly little cutout editor 😊",
                    "author": "@anthanomical",
                    "likes": 28,
                    "publishedAt": "2026-02-15T15:27:28Z"
                },
                {
                    "text": "26:31 yeah as a Amazon warehouse associate, I promise you, the middle management is getting replaced first. It's not even a question and they know it",
                    "author": "@DJToMyHits",
                    "likes": 12,
                    "publishedAt": "2026-02-15T17:08:37Z"
                },
                {
                    "text": "It ends with corporate bailouts",
                    "author": "@gearratio6773",
                    "likes": 34,
                    "publishedAt": "2026-02-15T16:15:11Z"
                },
                {
                    "text": "6:50 Don't know if this is mentioned elsewhere in the video since I haven't finished watching it yet, but the car industry in America is doing the same thing. GM had their best year in recent times when they stopped prioritizing selling people cheap sedans and started prioritizing selling rich people oversized battleships like the GMC Hummer.",
                    "author": "@bokunogentoo4420",
                    "likes": 12,
                    "publishedAt": "2026-02-15T16:23:55Z"
                }
            ]
        }
    ]
}