{
    "videoId": "Bup88P6d1-Y",
    "history": [
        {
            "fetchedAt": "20260220_080615",
            "commentCount": 24,
            "comments": [
                {
                    "text": "Need Help Navigating Medicare? 🩺 Don’t go it alone. Get expert guidance from those who know the system inside and out.\r\n📞 Call Now: 352-841-0632 (Chapter Medicare)\r\n💻 Get Help Online: https://bit.ly/Chapter_Medicare\r\n\r\nRESOURCES & ADVOCACY\r\n👤 Private 1-on-1 Consultation: Speak with a Former Social Security Insider.\r\nSchedule here: https://24help.org/experts\r\n\r\nFree Resource Hub: https://linktr.ee/MyGovExpert\r\n\r\nQuestions or Suggestions? Record a video message for us here: https://www.videoask.com/fmqmdblp6",
                    "author": "@MyGovExpert",
                    "likes": 0,
                    "publishedAt": "2026-02-20T00:29:41Z"
                },
                {
                    "text": "Thank you Dr. Weir and chat",
                    "author": "@bonniemartenez5294",
                    "likes": 0,
                    "publishedAt": "2026-02-19T05:15:27Z"
                },
                {
                    "text": "Thank you Dr. Ed !!",
                    "author": "@trylliumt5441",
                    "likes": 0,
                    "publishedAt": "2026-02-19T04:51:34Z"
                },
                {
                    "text": "Was interupted by a commercial while trying to exlain section 8, and lost everything when that commercial came on",
                    "author": "@harolddouglas5582",
                    "likes": 1,
                    "publishedAt": "2026-02-19T01:16:57Z"
                },
                {
                    "text": "*1st Comment To how can I live on That?  Could you discuss Section 8*",
                    "author": "@ellej3112",
                    "likes": 3,
                    "publishedAt": "2026-02-19T00:09:23Z"
                },
                {
                    "text": "HI Dr. Ed.  In today's live you mentioned state of California Calpers employees don't pay into social security.  I retired last year and paid SS, as did my state agency.  The only ones that don't are firefighters, teachers, and peace officers.  Thanks",
                    "author": "@Scott63-d4x",
                    "likes": 1,
                    "publishedAt": "2026-02-19T01:03:16Z"
                },
                {
                    "text": "VA benefits",
                    "author": "@GSDENALI1",
                    "likes": 3,
                    "publishedAt": "2026-02-19T01:31:27Z"
                },
                {
                    "text": "Too many long ads!",
                    "author": "@addienelson179",
                    "likes": 2,
                    "publishedAt": "2026-02-19T01:35:45Z"
                },
                {
                    "text": "A lot of us dont have spouses, disabilities, not widowed..SINGLE. Can you please make a video for us...programs available (maybe there aren't any?) Who are retired single no kids, no disabilities etc. What besides SS, medicare, ABDGN etc  is available for us? Thank.you",
                    "author": "@janLyd",
                    "likes": 3,
                    "publishedAt": "2026-02-19T05:44:24Z"
                },
                {
                    "text": "Got beat by my sister when I was 7. Worked until I 2012 when I was fully disabled then. Been taking care of my dad until he passed. \nI had to take care of the insurance as dad was incapable after the 2018 fire took their house.\nWas suppose to get paid for working 24/7 for 2,219 days. Never got paid. Getting kicked out of the house we were suppose to split 50/50. Also Sister took me off the POD. I have taken care of dad, and I have nothing to live on as dad took care of the rent. Help.",
                    "author": "@harolddouglas5582",
                    "likes": 2,
                    "publishedAt": "2026-02-19T01:12:30Z"
                },
                {
                    "text": "I got some money from the 2018 Camp Fire and according to thw state congress, and federal congress. Because the money was for my lung damage, I read as it was a medical issue I didn’t have to claim for the money i recieved. I'm not rich, i apparently don't have a house, and i barely have a car.",
                    "author": "@harolddouglas5582",
                    "likes": 1,
                    "publishedAt": "2026-02-19T01:30:12Z"
                },
                {
                    "text": "I've had to go on SSDI  IN FEB. 2021 Just before my 56th birthday that September. I have no clue what to expect in the next few years when I would be at retirement age. On a different live I heard you say it will automatically become retirement. Its increased with cola $1730.. waiting for the decision they gave me SSI and that got me Medicaid. \n\nSSI Stopped once SSDI Started and Medicaid stopped at 2 years became Medicare. The amount is what I've been providing for my family of 4. I learned last year that my school aged son can draw from my SSDI so I applied and they allotted him just over $800, a tremendous help! My wife is being deported not able to return for 10 years if granted . There's nothing on her side for SS benefits. My sons will end at 18 I think. They reduced the SNAP to $24 I assume because of what my son gets now. Should I be worried?",
                    "author": "@JohnPaulBrewer-cd5bo",
                    "likes": 1,
                    "publishedAt": "2026-02-19T01:29:15Z"
                },
                {
                    "text": "I have a friend who lost her husband and she is not old enough to get security. Can she get his?",
                    "author": "@cindytrout4452",
                    "likes": 0,
                    "publishedAt": "2026-02-19T02:14:39Z"
                },
                {
                    "text": "Dr. Ed , if a person retired at 62, does he has to pay penalty for early retirement? If is fixable tell me how please.",
                    "author": "@mirianaquino5772",
                    "likes": 0,
                    "publishedAt": "2026-02-19T20:01:57Z"
                },
                {
                    "text": "",
                    "author": "@cayennenaturetrails8953",
                    "likes": 0,
                    "publishedAt": "2026-02-19T04:49:18Z"
                },
                {
                    "text": "To get Tricare for Life I have to get Medicare parts A&B. Tricare will be my supplement plan. So very wrong that I do not get free medical for life because of Bill Clinton!",
                    "author": "@robertbelar5341",
                    "likes": 1,
                    "publishedAt": "2026-02-19T02:51:10Z"
                },
                {
                    "text": "This doesn't seem to apply to never-married and childless people. \nWho knows where you have been all day, just make sure you are home before the porch light comes on. \nAn age vs benefits chart would be helpful.",
                    "author": "@roundtwo3321",
                    "likes": 0,
                    "publishedAt": "2026-02-19T09:10:28Z"
                },
                {
                    "text": "If my divorce was in 2009 is my alimony still deductible on my 2025 taxes… thank you for your response in advance and if I I am able to and didn’t use the write off for my 2024 taxes can I file for not using it last year ???",
                    "author": "@PaulRichardson-j1i",
                    "likes": 0,
                    "publishedAt": "2026-02-19T21:53:32Z"
                },
                {
                    "text": "I receive SSDI Under survival spouse benefit beginning at 60.  I was receiving SSI due to becoming disabled. I worked for many years but because I was a stay home for period and then became disabled I did not meet the # of months requirement i qualified for SSI.  Once I started receiving SSDI I was told my $2400 was the max I could receive, is this true?",
                    "author": "@JanaBonner-e1d",
                    "likes": 0,
                    "publishedAt": "2026-02-19T07:04:24Z"
                },
                {
                    "text": "Hide in the ditch and throw water balloons at cars\n.or other kids on bikes. Lol",
                    "author": "@lavestamatt8988",
                    "likes": 1,
                    "publishedAt": "2026-02-19T01:56:16Z"
                },
                {
                    "text": "Your over, I'm tired. I give up.",
                    "author": "@harolddouglas5582",
                    "likes": 1,
                    "publishedAt": "2026-02-19T01:31:40Z"
                },
                {
                    "text": "I am going to be 62 yrs.old this year and was hoping to retire early, but I plan to live in the Philippines, so my early retirement SS will be enough.  Question. I was married to my X-husband for 23 years, we divorced in 2012,  he remarried in 2025.  I also remarried 2017.  My X-husband is turning 67 this year in June 16, and I would assume he is going to collect his Full SS benefit this year. \n\nCan I claim on his SS benefit, even though we are divorced?  \n\nWhat other benefits can I claim feom his benefits, since we were marrried for a long time?  \n\nKindly help and advise!  Thank you!",
                    "author": "@THREEGEEZANDS",
                    "likes": 0,
                    "publishedAt": "2026-02-19T03:30:17Z"
                },
                {
                    "text": "If my husband retires at 65 and starts benefits and I retire at the same time but age 60 , is there anything I  can collect?",
                    "author": "@elainestika5076",
                    "likes": 0,
                    "publishedAt": "2026-02-19T14:42:31Z"
                },
                {
                    "text": "Dr. Weir. I’ am willing to retire 65 and i have tree kids are 11/yrs, 9/yrs and 6/yrs  do i get any benefit from them.  Thanks",
                    "author": "@saidosman8968",
                    "likes": 3,
                    "publishedAt": "2026-02-19T00:31:52Z"
                }
            ]
        }
    ]
}