{
    "videoId": "OS9QAB-GzyY",
    "history": [
        {
            "fetchedAt": "20260216_191340",
            "commentCount": 25,
            "comments": [
                {
                    "text": "My songs might not have lyrics, but they have stories - and if you don't mind me sharing this \"last one\" with you, I'd love to do that!\n\nThe initial draft of this song [back in 2017] used to be called 'Chords', and some people would remember that. But after things got more serious and I finally finished writing this piece, I felt this song needed another name. \n\n'Kawaii' was probably one of the most memorable words my brain kept after my first trip to Japan 9 years ago. It is an easy word to absorb sonically. And another thing I noticed around that trip was - Kawaii was a word often to be associated with kids and babies. I just remember hearing people saying 'kawaii' and laughing or showing their biggest and most genuine smile after speaking that word - and that moved me in a special way. \n\nThis song is probably the most simple of the album - one guitar track, quiet bass, small drums and an electric piano. Almost a lo-fi type of song, with the effect of \"less is more\" activated - which is so rare for a guitar player, including myself. \nI remember while recording the demo and the final version at East West - I wanted it to feel the \"purity\" of this music, even though I still can't explain what that means exactly.\n\nThe idea of Kawaii's Music Video was the easiest to visualize comparing the other ones we did. It was clear enough to me that there was no better message than having kids as the main characters to carry the message of it.\n\nThis song is a reminder to the innocence - a call to genuine joy, and the search for a pure life's perspective. \nThe shortcut to God's happiness.\n\nThank you for watching! \n\nPs.: \"ASATO' is around the corner! Can't believe!!!\n\nKindest regards,\nMA.",
                    "author": "@MateusAsato",
                    "likes": 335,
                    "publishedAt": "2026-02-16T08:37:45Z"
                },
                {
                    "text": "The description reminds me of this verse:\n\nThen he said, “I tell you the truth, unless you turn from your sins and become like little children, you will never get into the Kingdom of Heaven.",
                    "author": "@Kwaician",
                    "likes": 93,
                    "publishedAt": "2026-02-16T14:14:10Z"
                },
                {
                    "text": "これはかわいい",
                    "author": "@daikirad1120",
                    "likes": 2,
                    "publishedAt": "2026-02-16T16:51:16Z"
                },
                {
                    "text": "かわいい",
                    "author": "@othersiderick",
                    "likes": 7,
                    "publishedAt": "2026-02-16T14:18:11Z"
                },
                {
                    "text": "Hendrix has the biggest smile watching you play man",
                    "author": "@MichaelJohn-id5jg",
                    "likes": 2,
                    "publishedAt": "2026-02-16T18:47:13Z"
                },
                {
                    "text": "1:19\n\nOh Mateus, dude... The sounds you take out of this instrument sometimes are unreal. I flew around the universe just by hearing these notes.",
                    "author": "@andreilima_sw",
                    "likes": 12,
                    "publishedAt": "2026-02-16T14:51:04Z"
                },
                {
                    "text": "Mateus Asato is kawaii now lol",
                    "author": "@rishibonamguitar",
                    "likes": 24,
                    "publishedAt": "2026-02-16T10:44:51Z"
                },
                {
                    "text": "Not for your ears,but for your soul to hear 🫶",
                    "author": "@kuirdng357",
                    "likes": 3,
                    "publishedAt": "2026-02-16T18:03:02Z"
                },
                {
                    "text": "Exquisite soulful touch. Looking forward to album.",
                    "author": "@chrislloydguitarstudio",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:59:58Z"
                },
                {
                    "text": "What a great revival of the old tune",
                    "author": "@mikkojensen",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:51:05Z"
                },
                {
                    "text": "すてき😍",
                    "author": "@cmonica2677",
                    "likes": 3,
                    "publishedAt": "2026-02-16T14:52:19Z"
                },
                {
                    "text": "O único guitarrista que ficou famoso que continua crescendo em estilo e musicalidade sem deixar se vender!!! Incrível o que deus fez na sua vida menino, simplesmente o melhor!! MATEUS ASATO",
                    "author": "@Juliodorock",
                    "likes": 3,
                    "publishedAt": "2026-02-16T15:21:32Z"
                },
                {
                    "text": "When you have so much chops you don't think about chops anymore. You just play with so much sincerity and tell the story that way it needs to be told.",
                    "author": "@dylanlamarre3768",
                    "likes": 7,
                    "publishedAt": "2026-02-16T15:06:11Z"
                },
                {
                    "text": "This Album is like an advent Calendar and opening a door every Month 🚪 up to 27. Februar where all doors open up, like when I was a kid and couldn't wait and secretly opened every door of the calendar. ❤🎸🎉",
                    "author": "@Haifischsalamander",
                    "likes": 7,
                    "publishedAt": "2026-02-16T10:46:21Z"
                },
                {
                    "text": "Just beautiful",
                    "author": "@matthewmurphy8872",
                    "likes": 0,
                    "publishedAt": "2026-02-16T17:43:26Z"
                },
                {
                    "text": "表参道で会えるの楽しみにしてます",
                    "author": "@oka5983",
                    "likes": 3,
                    "publishedAt": "2026-02-16T14:22:03Z"
                },
                {
                    "text": "I could touch a little piece of heaven with your melodies. Thanks, Mateus. Give us some concerts in sampa.",
                    "author": "@Violadepau",
                    "likes": 2,
                    "publishedAt": "2026-02-16T16:28:59Z"
                },
                {
                    "text": "Muito sentimento.",
                    "author": "@FabioMouraSJR",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:20:50Z"
                },
                {
                    "text": "As a long-time fan, “north (天の目)” is the song I’m looking forward to the most. \nGod bless man.",
                    "author": "@abelemmart577",
                    "likes": 2,
                    "publishedAt": "2026-02-16T15:02:16Z"
                },
                {
                    "text": "its been blessing after blessing seeing each of the pieces we listen over the years, evolving to a whole tightly knitted stories, looking forward to the full album!",
                    "author": "@teawithrey",
                    "likes": 1,
                    "publishedAt": "2026-02-16T16:25:24Z"
                },
                {
                    "text": "Your music makes me think a lot.",
                    "author": "@마법의램프지니",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:30:43Z"
                },
                {
                    "text": "Nice Harmony!  I have a Jupiter Thinline that I love.",
                    "author": "@jeepnut1",
                    "likes": 0,
                    "publishedAt": "2026-02-16T19:11:35Z"
                },
                {
                    "text": "Fofo",
                    "author": "@LeonidasPedro",
                    "likes": 1,
                    "publishedAt": "2026-02-16T16:59:54Z"
                },
                {
                    "text": "Its chords! So happy to hear and see this has been adapted to a full song! Beautiful as always",
                    "author": "@HuyNguyen-tb1lw",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:58:02Z"
                },
                {
                    "text": "❤❤❤",
                    "author": "@fandyah6634",
                    "likes": 0,
                    "publishedAt": "2026-02-16T16:37:29Z"
                }
            ]
        }
    ]
}