{
    "videoId": "tdOd3ZJse6A",
    "history": [
        {
            "fetchedAt": "20260218_163857",
            "commentCount": 25,
            "comments": [
                {
                    "text": "He taught you basic manners, the morals clearly went over your head.",
                    "author": "@powellpker",
                    "likes": 77,
                    "publishedAt": "2026-02-18T00:35:38Z"
                },
                {
                    "text": "It's not about commanding respect. You missed the point. It's about SHOWING respect.",
                    "author": "@ronaldlay6953",
                    "likes": 655,
                    "publishedAt": "2026-02-17T19:39:05Z"
                },
                {
                    "text": "He missed the lesson entirely!  Wasn’t about control and power, was about humility and respect.",
                    "author": "@darrellwilliams705",
                    "likes": 10,
                    "publishedAt": "2026-02-18T13:27:32Z"
                },
                {
                    "text": "\"My sister and I...\"",
                    "author": "@andygnatovich",
                    "likes": 152,
                    "publishedAt": "2026-02-17T17:21:37Z"
                },
                {
                    "text": "This guy read how to win friends and influence people and made a podcast clip about it",
                    "author": "@jakeatencio305",
                    "likes": 117,
                    "publishedAt": "2026-02-17T23:17:31Z"
                },
                {
                    "text": "When I was in hospitality I  HATED it when customers used my name. Hated it. Every time.",
                    "author": "@vlnow",
                    "likes": 35,
                    "publishedAt": "2026-02-18T04:50:56Z"
                },
                {
                    "text": "The wrong person got rich",
                    "author": "@duybui3088",
                    "likes": 37,
                    "publishedAt": "2026-02-17T16:55:47Z"
                },
                {
                    "text": "_\"A person's name is one of their favourite words in the whole wide world!\"_ 💯\n– Dale Carnegie",
                    "author": "@YaNeK92",
                    "likes": 22,
                    "publishedAt": "2026-02-18T03:36:09Z"
                },
                {
                    "text": "Mega respect for the dad to take a backstep and let the son lead. Unfortunately too many parents, specially people born in the 50s and 60s, don't want to lose control ever. That's a great man who knew when to step back and let his son lead while still being present to take of things if it went beyond his son's capabilities. True leader.",
                    "author": "@Whatreally123",
                    "likes": 10,
                    "publishedAt": "2026-02-18T03:16:04Z"
                },
                {
                    "text": "Knowing someone's name and using it consciously definitely deepens the connection, however, the other day I was walking my dog and a kid was walking to school through the same park and greeted me with a \"Hi Sir! 😊\" walking past. I was so surprised by that, since he took the time to pause his phone conversation, though I responded right back at him with a smile and it actually made my day, almost bringing a tear to my eye. All at once it hit me that I'm getting older, made me feel good for being seen but also really proud of him and his parents for raising such a polite young man. I thought if my kids turn out that way one day I'd be pretty happy myself. 💯",
                    "author": "@YaNeK92",
                    "likes": 5,
                    "publishedAt": "2026-02-18T03:51:36Z"
                },
                {
                    "text": "this is 100% the best example i've ever seen of someone learning and mastering something they don't understand, this is why the modern world iss in shambles folks, the rich dropped the ball with their kids, none of them know HOW any of it works",
                    "author": "@intrepidless853",
                    "likes": 1,
                    "publishedAt": "2026-02-18T10:59:33Z"
                },
                {
                    "text": "He so right.. something I've done for years is try to read the name tag of the bank teller, grocery store register clerk, home depot rep, etc.... when I leave I say : \"Thank you Sarah (or whatever) have an amazing day\". Try it and watch the reaction you get by calling them by their name... You'll see the power",
                    "author": "@SignatureRoofing",
                    "likes": 6,
                    "publishedAt": "2026-02-17T21:19:28Z"
                },
                {
                    "text": "Idk about commanding respect. More like reciprocating respect. You show respect you get respect.",
                    "author": "@mrchefhayden",
                    "likes": 3,
                    "publishedAt": "2026-02-18T05:05:27Z"
                },
                {
                    "text": "Spot on. Always the right approach in any given situation when interacting with others.\nRecognition and respect is everything.",
                    "author": "@minerva1287",
                    "likes": 0,
                    "publishedAt": "2026-02-18T11:16:35Z"
                },
                {
                    "text": "Totally true. When you make a situation personalized towards the other person, they automatically feel better about themselves and will just naturally treat you with more attentiveness and respect. So just remember to always be polite and respect others and take the time to get to know someone's name. You never know what kind of a difference that could make in some person's day. They could be having the shittiest day of their life and just to know that somebody recognized them by their name and was happy to see them that day could mean the world to them.",
                    "author": "@ASDsteve",
                    "likes": 0,
                    "publishedAt": "2026-02-18T03:42:55Z"
                },
                {
                    "text": "Solid work been doing that since I was a boy and it’s a life changer for you and also the people you communicate with. Being present, it’s a lost art.",
                    "author": "@FELIX-KINCAID",
                    "likes": 0,
                    "publishedAt": "2026-02-18T03:36:22Z"
                },
                {
                    "text": "I did exactly that this past weekend when i had to do “ make up bday dinner “ for my wife . I kept asking his name and interacted with him and hooked me up with something for wifey. Gave him a hefty tip although i don’t usually do that. I know next time im set but i recognize his job and also been human!!!",
                    "author": "@Minicupra-m6o",
                    "likes": 2,
                    "publishedAt": "2026-02-17T19:56:26Z"
                },
                {
                    "text": "It’s recognition acknowledgment and respect , and if you do that you win every single time and you do something good for the people around you.",
                    "author": "@Ksport31",
                    "likes": 0,
                    "publishedAt": "2026-02-18T06:26:58Z"
                },
                {
                    "text": "Addressing a person by name personlizes the experience,  it shows a sign of respect that you know there name.",
                    "author": "@robertmurray8267",
                    "likes": 2,
                    "publishedAt": "2026-02-17T21:06:16Z"
                },
                {
                    "text": "I once heard, anyone's name, is their favorite word.    It's the MOST beautiful word they have ever heard, using it MAKES them feel good.    Use their name as often as you can, and they might favor you over others (hopefully).",
                    "author": "@PORTEDLEAF",
                    "likes": 0,
                    "publishedAt": "2026-02-18T00:29:56Z"
                },
                {
                    "text": "Its called Humility.",
                    "author": "@Albo96286",
                    "likes": 4,
                    "publishedAt": "2026-02-18T00:39:01Z"
                },
                {
                    "text": "Kindness is magical!!",
                    "author": "@lagalaxy9516",
                    "likes": 0,
                    "publishedAt": "2026-02-18T05:44:32Z"
                },
                {
                    "text": "Barry is speaking truth here. Always important to use their name respectfully and correctly.",
                    "author": "@jbapples4611",
                    "likes": 0,
                    "publishedAt": "2026-02-18T08:32:59Z"
                },
                {
                    "text": "If the dad was doing it, he would not have to be told to do it!",
                    "author": "@TheFrenchMan69",
                    "likes": 5,
                    "publishedAt": "2026-02-18T00:42:42Z"
                },
                {
                    "text": "I been working in a couple of luxury places in Milan and Forte dei Marmi. I have lot of tattoos (one is a knife on the left side of my head behind my hear) met more than few families like his one, always the best people to deal with and always a pleasure to make their time and experience in the restaurant as good as i can. But is not about commanding respect, is about showing.",
                    "author": "@SouthEastCoast1312",
                    "likes": 0,
                    "publishedAt": "2026-02-17T23:28:51Z"
                }
            ]
        }
    ]
}