{
    "videoId": "iDPrl8wO-Bk",
    "history": [
        {
            "fetchedAt": "20260214_212223",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Get 20% off on ALL of our Poppy Playtime items using the code PLAYTIME20! Sale is valid until February 23rd. Shop here ✨► https://www.theoryverse.store/discount/TOM10OFF",
                    "author": "@GameTheory",
                    "likes": 104,
                    "publishedAt": "2026-02-13T22:47:38Z"
                },
                {
                    "text": "The light being green at the statement of her birthdate but immediately going to red when he says \"she was the most sweet and adorable little girl\" is hilarious",
                    "author": "@skippydinglechalk.",
                    "likes": 1334,
                    "publishedAt": "2026-02-14T18:18:24Z"
                },
                {
                    "text": "its gonna be revealed at the end of the entire franchise that it was actually markiplier who wrote the whole thing and \"mob games\" is actually a shadow company under markiplier",
                    "author": "@Ekical",
                    "likes": 666,
                    "publishedAt": "2026-02-14T18:06:37Z"
                },
                {
                    "text": "I always had a theory that the prototype is the actual Poppy human girl while poppy doll is just a clone with her memories",
                    "author": "@lil_eon2732",
                    "likes": 335,
                    "publishedAt": "2026-02-14T18:39:44Z"
                },
                {
                    "text": "5 years 5 updates PERFECTION",
                    "author": "@enrike9404",
                    "likes": 296,
                    "publishedAt": "2026-02-14T18:06:57Z"
                },
                {
                    "text": "22:03 it was revealed in the arg that a worker called preston was the one who let the toys out,he was traumized by the actions of playtime co , so he let the toys out causing the hour of joy, but he also survived until getting turned into a toy by the prototype",
                    "author": "@AmudhanMaharajan",
                    "likes": 108,
                    "publishedAt": "2026-02-14T19:25:10Z"
                },
                {
                    "text": "matpat with fnaf.. and now tom with poppyplaytime.. seems to be a tradition 😭😭💔💔",
                    "author": "@RexEditz72655",
                    "likes": 168,
                    "publishedAt": "2026-02-14T18:16:42Z"
                },
                {
                    "text": "1:34 I'm glad we are bringing this method back! I think they used it in the FNAF timeline? Helps keep us informed on different aspects of the theory.",
                    "author": "@Zekron88",
                    "likes": 174,
                    "publishedAt": "2026-02-14T18:09:13Z"
                },
                {
                    "text": "Its good that yall posted this on valentines day because i have nothing to do....i am lonely. but i do love this game",
                    "author": "@dennisthomas7624",
                    "likes": 349,
                    "publishedAt": "2026-02-14T18:09:38Z"
                },
                {
                    "text": "I can never resist clicking on a video about the franchise that made Tom lose his mind.",
                    "author": "@An1ssue",
                    "likes": 76,
                    "publishedAt": "2026-02-14T18:09:46Z"
                },
                {
                    "text": "Game Theory is one step away from becoming just as insane as the Theorizer",
                    "author": "@JustinY.",
                    "likes": 80,
                    "publishedAt": "2026-02-14T18:12:29Z"
                },
                {
                    "text": "Something I noticed from the trailer is that all the secondary antagonists for chapter 5 seem to parallel the antagonists from all the previous chapters. Huggy is back, Lily is a lot like mommy, the monster plushies are similar to the smiling critters and catnap, and the root monster(if it actually ends up being an antagonist) is very similar to doughy. It’s like chapter 5 is circling back to pay homage to each of the previous chapters before the final confrontation with the prototype. If that really ends up being the case. Then bravo Mob entertainment. BRAVO!",
                    "author": "@cartersouthern",
                    "likes": 31,
                    "publishedAt": "2026-02-14T19:06:32Z"
                },
                {
                    "text": "I appreciate the acknowledgement that a lot of this video is wild speculation",
                    "author": "@GTrevise",
                    "likes": 24,
                    "publishedAt": "2026-02-14T18:48:29Z"
                },
                {
                    "text": "2:21  oh. I was born on march 7th. Yall wish me luck so I don’t become a fricking doll",
                    "author": "@L1LW31RD0",
                    "likes": 31,
                    "publishedAt": "2026-02-14T19:00:39Z"
                },
                {
                    "text": "\"The Prototype is not terrifying because of his looks... Hi is terrifying because of what he understands...\"",
                    "author": "@MommyPlaytime-d2b",
                    "likes": 17,
                    "publishedAt": "2026-02-14T18:51:12Z"
                },
                {
                    "text": "Judging from what we see of Preston in the Chapter 5 ARG, I think Prototype manipulated Stella and Preston into thinking the Hour of Joy was THEIR idea, and in a way, it was. The Hour of Joy was their plan, to release the experiments for freedom, but the massacre that followed was the Prototype’s plan.",
                    "author": "@Descender98",
                    "likes": 19,
                    "publishedAt": "2026-02-14T20:00:40Z"
                },
                {
                    "text": "the prototype being elliot would be so sad look at the bond those two had, poppy doesn’t know he’s a monster now, what if he’s a good guy just trying to get his daughter back,",
                    "author": "@datguypdawg",
                    "likes": 53,
                    "publishedAt": "2026-02-14T18:37:02Z"
                },
                {
                    "text": "I love that this whole thing is from Poppy's perspective. Not us as viewers, but from someone who watched it all happen, unable to do much to stop it. Like a true narrator character, almost.",
                    "author": "@sassysunbeam",
                    "likes": 10,
                    "publishedAt": "2026-02-14T19:43:29Z"
                },
                {
                    "text": "1:51 putting the gift shop at the beginning of the ride? That's probably the most poppytime co thing you could do.",
                    "author": "@Shadowreaper5",
                    "likes": 13,
                    "publishedAt": "2026-02-14T19:30:27Z"
                },
                {
                    "text": "The Spirit of FNAF lives on with Poppy Playtime, pretty soon we'll have theories that are built upon years of theories",
                    "author": "@JustinY.",
                    "likes": 69,
                    "publishedAt": "2026-02-14T18:12:09Z"
                },
                {
                    "text": "Is it just me or is Tom a lot more soft-spoken in this episode?",
                    "author": "@hatenate7921",
                    "likes": 12,
                    "publishedAt": "2026-02-14T19:08:17Z"
                },
                {
                    "text": "Oh great this is FNAF and MatPat all over again 😭 Love this video though and I can’t wait for Chapter 5",
                    "author": "@Ellakinito",
                    "likes": 12,
                    "publishedAt": "2026-02-14T18:27:48Z"
                },
                {
                    "text": "I really hope that at the end of the entire game, we really find out who the Player is.",
                    "author": "@DelphinSquared",
                    "likes": 5,
                    "publishedAt": "2026-02-14T20:36:14Z"
                },
                {
                    "text": "I PRAY this isn't rushed and buggy''",
                    "author": "@จันทมณีเทศเอม-ฎ5ฝ",
                    "likes": 238,
                    "publishedAt": "2026-02-14T18:21:33Z"
                },
                {
                    "text": "So you didnt mention the body wound in the Ludwig estate what if that's Ollie and the prototype? It's kinda one of those two pieces that dont have answers maybe fitting together kinda theory",
                    "author": "@blindsamhare5954",
                    "likes": 9,
                    "publishedAt": "2026-02-14T19:04:35Z"
                }
            ]
        }
    ]
}