{
    "videoId": "bfu4BrHygzs",
    "history": [
        {
            "fetchedAt": "20260218_234811",
            "commentCount": 25,
            "comments": [
                {
                    "text": "\"Look,I told you I wasn't a hero\"😭 Giblet is still a hero in our hearts",
                    "author": "@Frosted_ForTax",
                    "likes": 232,
                    "publishedAt": "2026-02-18T20:36:33Z"
                },
                {
                    "text": "I don’t think Huggy is dead just yet. Kissy Missy is definitely dead, but I’m thinking Huggy will be on our side while the Doctor is with us too.",
                    "author": "@Subzeroh123",
                    "likes": 21,
                    "publishedAt": "2026-02-18T22:12:33Z"
                },
                {
                    "text": "The ending was amazing! \nThis makes a lot of sense, since they betrayed the doctor, and he wants to get revenge who turn his back on him! Cuz may be or not Leith Pierre the prototype",
                    "author": "@Just_SamRebz",
                    "likes": 49,
                    "publishedAt": "2026-02-18T20:36:37Z"
                },
                {
                    "text": "Anyone noticed huggy was still breathing after getting hit against the wall? Bro is def coming back for revenge on the prototype.☠",
                    "author": "@FlippimelonYT",
                    "likes": 42,
                    "publishedAt": "2026-02-18T20:44:07Z"
                },
                {
                    "text": "My main character just really went like\n“Oh! I just got stabbed by the prototype! I guess Imma just go on a nice little walk with giblet!”",
                    "author": "@Cfjmwcjby",
                    "likes": 42,
                    "publishedAt": "2026-02-18T20:44:40Z"
                },
                {
                    "text": "There's no way kissy missy and huggy wuggy died 😭",
                    "author": "@apersonthatlovescats",
                    "likes": 34,
                    "publishedAt": "2026-02-18T20:36:55Z"
                },
                {
                    "text": "If we survived the stab huggy and kissy would have been fine also we can also see huggy hand moving",
                    "author": "@Dreamy_keii",
                    "likes": 17,
                    "publishedAt": "2026-02-18T20:45:57Z"
                },
                {
                    "text": "Now it makes sense that Huggy was only going on a killing spree cause he missed Kissy. He was reunited with her and finally seemed happy",
                    "author": "@JcbGaming-ij8yx",
                    "likes": 4,
                    "publishedAt": "2026-02-18T20:54:43Z"
                },
                {
                    "text": "Wait, I have a theory. Maybe Dr. Harley will be a hero. This isn't 100% certain, but why didn't he contact the prototype right away? And yeah that's the most crazy chapter",
                    "author": "@MR.MAKARON-123",
                    "likes": 6,
                    "publishedAt": "2026-02-18T20:43:11Z"
                },
                {
                    "text": "Giblet was a real one, a man built to be a hero but forced to be innocent",
                    "author": "@Just_Rain21",
                    "likes": 19,
                    "publishedAt": "2026-02-18T20:43:35Z"
                },
                {
                    "text": "Bro the prototype went from “WOW!” To foul on this chapter he literally took a step back on the charts of excellence. (Of course I’m talking about how he makes me feel emotionally, he’s a W villain in Poppy playtime",
                    "author": "@alexisramseur2969",
                    "likes": 1,
                    "publishedAt": "2026-02-18T23:24:38Z"
                },
                {
                    "text": "7:17:45 Guess the prototype must have actually considered giving the doctor lab access then. Next thing you’re gonna tell me is that Dogday randomly appears to be alive next chapter.",
                    "author": "@ArchieBate-t5z",
                    "likes": 8,
                    "publishedAt": "2026-02-18T20:41:44Z"
                },
                {
                    "text": "I thought that chapter 5 would be the finale, but now i cant belive were getting a chapter 6!?!?!?!?!?",
                    "author": "@PearGG-l2i",
                    "likes": 4,
                    "publishedAt": "2026-02-18T21:07:51Z"
                },
                {
                    "text": "I hope in Chapter 6 the Prototype gets worst death out of all the deaths in Poppy playtime",
                    "author": "@nataliegriffith6391",
                    "likes": 5,
                    "publishedAt": "2026-02-18T21:01:55Z"
                },
                {
                    "text": "Who was in the stream for over 5h+👇",
                    "author": "@Hiisme159",
                    "likes": 199,
                    "publishedAt": "2026-02-18T20:38:19Z"
                },
                {
                    "text": "W Poppy Playtime Chapter 5 play-trough stream Kreek!  Stream ends at 7:23:10",
                    "author": "@rosbindadolmo",
                    "likes": 9,
                    "publishedAt": "2026-02-18T20:51:09Z"
                },
                {
                    "text": "7:03:19 I'm gonna say it just how poppy said it in chapter 3 \"KISSY\"",
                    "author": "@cinnamon_with_friends",
                    "likes": 6,
                    "publishedAt": "2026-02-18T22:03:33Z"
                },
                {
                    "text": "DAMN, this chapter is PEAK(maybe even more than ch3)\nIT MIGHT BE ABOVE PEAK\nI also love everything in it the adrenaline, the correct hype and excitement\nPrototype face is actually a jester which....uhh look interesting but good enough to make me scared",
                    "author": "@NoraffezanMdDaud-k2v",
                    "likes": 2,
                    "publishedAt": "2026-02-18T21:04:32Z"
                },
                {
                    "text": "This chapter is crazy and honestly? The developers didn’t lie, one of the best chapters yet (and emotional rollercoaster)",
                    "author": "@RobloxGinemena",
                    "likes": 1,
                    "publishedAt": "2026-02-18T21:15:08Z"
                },
                {
                    "text": "Crazy that the prototype a fear of children is like a Clown and spieder mix and also, why does he give me some Pomni vibes.",
                    "author": "@sadhamster10-b9p",
                    "likes": 2,
                    "publishedAt": "2026-02-18T20:51:10Z"
                },
                {
                    "text": "Now there is harley but I am also thinking that if chapter 6 is coming so that would be long if we can see new villain also like boxy boo we never seen him",
                    "author": "@SanataniDamon",
                    "likes": 7,
                    "publishedAt": "2026-02-18T20:40:32Z"
                },
                {
                    "text": "My heart stopped beating when huggy and kissy THE ONLY FAVOURITE CHARACTERS ALIVE dead... But I guess if Giblet dies I am bombing this whole factory I ma throw a plane at prototype and because he's used to getting hit by a train",
                    "author": "@Sofia_angel",
                    "likes": 2,
                    "publishedAt": "2026-02-18T22:34:19Z"
                },
                {
                    "text": "I like when Lilly grab the player and at the prototype grab the player and drop him in the gooey stuff and chum help us hide before the prototype came",
                    "author": "@Robloxplayerlegend",
                    "likes": 2,
                    "publishedAt": "2026-02-18T23:00:41Z"
                },
                {
                    "text": "DUDE. THEY KNOCKED IT OUT THE PARK! THIS IS THE BEST CHAPTER, IT WAS SO WELL WRITTEN! 👏👏👏👏👏👏👏👏👏👏👏👏",
                    "author": "@QuackAndJay",
                    "likes": 1,
                    "publishedAt": "2026-02-18T20:45:02Z"
                },
                {
                    "text": "Harley Sawyer (the Doctor) said it himself in chapter 4, he wants to leave the place, even from the prototype. He will definetly help us beat the prototype now that he is still alive.",
                    "author": "@FlippimelonYT",
                    "likes": 2,
                    "publishedAt": "2026-02-18T20:45:24Z"
                }
            ]
        }
    ]
}