{
    "videoId": "FzpKwxwGfs4",
    "history": [
        {
            "fetchedAt": "20260216_191344",
            "commentCount": 25,
            "comments": [
                {
                    "text": "This is really cool! Thanks to the MTG dev team for their hard work and also allowing me and other creators to post raw gameplay. I decided to show all of it to you guys right off the bat, completely unedited and uncut, to let the game do the talking. If you would like to hear my input, that's in the 2nd half of the video. Overall, I think they are on the right path and they have the correct team to make this happen. As a moto gamer, I am extremely excited for this game and can't wait for it's release! Feel free to let me know what you guys think in the comments, the more opinions the better, that is how progress is made. Thanks again to the MTG team (JV this track is unbelievable), keep working hard guys the community see's it and appreciates it!",
                    "author": "@troyjannn",
                    "likes": 26,
                    "publishedAt": "2026-02-16T17:25:39Z"
                },
                {
                    "text": "rev limiter sounds sooo good",
                    "author": "@TheEnduranceDadLife",
                    "likes": 14,
                    "publishedAt": "2026-02-16T17:57:34Z"
                },
                {
                    "text": "When he oj's i don't like how the camera looks straight down at the fender. you cant see anything. Hopefully they can get the camera to be more like dynamic is in bikes.",
                    "author": "@chillrider141",
                    "likes": 20,
                    "publishedAt": "2026-02-16T17:53:44Z"
                },
                {
                    "text": "I love how everyone like a month ago was saying this game is a scam. Looks good. Trust the process.",
                    "author": "@YeahImAnthony",
                    "likes": 16,
                    "publishedAt": "2026-02-16T17:36:21Z"
                },
                {
                    "text": "O game está ficando muito bom, espero que eles se dediquem bastante  até nós mínimos detalhes que ele cresça muito por que estou esperando muito esse game !",
                    "author": "@FERNANDOALKMIMFPS",
                    "likes": 1,
                    "publishedAt": "2026-02-16T18:19:51Z"
                },
                {
                    "text": "One thing of note, is that when they are changing the weather, they do not end the game running in UE5, the game is just paused and still simulating, the change in weather happened with the game running live, it is also called dynamic weather meaning this is indicating that the game will be able to change weather dynamically during game play and mid races.This can lead to very unique challenges and races not really seen elsewhere. I am excited to see the future of this game!",
                    "author": "@HeyyItsNick",
                    "likes": 5,
                    "publishedAt": "2026-02-16T18:17:43Z"
                },
                {
                    "text": "Bike sounds noice",
                    "author": "@bernardoberner4",
                    "likes": 31,
                    "publishedAt": "2026-02-16T17:08:53Z"
                },
                {
                    "text": "The graphics are litteraly like FS23/25 looks cool",
                    "author": "@Marek_MX",
                    "likes": 4,
                    "publishedAt": "2026-02-16T18:01:06Z"
                },
                {
                    "text": "looks like any milestone game",
                    "author": "@lil_scrotum7002",
                    "likes": 1,
                    "publishedAt": "2026-02-16T18:29:56Z"
                },
                {
                    "text": "Looking beautiful, thrusting the process",
                    "author": "@TheLastCowboy007",
                    "likes": 2,
                    "publishedAt": "2026-02-16T17:17:57Z"
                },
                {
                    "text": "Massive W in the chat for the MTG boys this is dope!",
                    "author": "@slippfilms",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:54:38Z"
                },
                {
                    "text": "mx bikes needs this for competition",
                    "author": "@ronburgundy8100",
                    "likes": 2,
                    "publishedAt": "2026-02-16T17:57:54Z"
                },
                {
                    "text": "I’ve always wanted to be able to race mini’s, specifically like start on an 85 or supermini work up hitting all the amateur nationals basically like in real life. It looks like will have the tracks and bikes to do that. Also building out my bikes is one of favorite things to do. As a console guy my legends gives you that but there’s still things you can’t change like triple clamp brands, linkage, clutch cover. They have suspension but being able to decide if you want it to be coated, anodized, air or spring etc.. I’m really looking forward to this game.",
                    "author": "@PatrickCahill-z2e",
                    "likes": 0,
                    "publishedAt": "2026-02-16T19:03:30Z"
                },
                {
                    "text": "I imagine the headsgake stuff is just a result of getting the rider weight on the bike because from the footage from last year idont think there was any shake",
                    "author": "@M0N573R11",
                    "likes": 0,
                    "publishedAt": "2026-02-16T19:13:17Z"
                },
                {
                    "text": "need to see some whips and oppos",
                    "author": "@nahkelfish",
                    "likes": 2,
                    "publishedAt": "2026-02-16T17:38:24Z"
                },
                {
                    "text": "I think if they do what they are talking about with the game it will compete with mx bikes, im just hoping it’s like they are saying it’s going to be, im looking forward to the release of this one",
                    "author": "@jaredquick2150",
                    "likes": 8,
                    "publishedAt": "2026-02-16T17:06:51Z"
                },
                {
                    "text": "If you look at when he changes the weather, you can see it says \"SM_Yamaha_2026_YZ450F\" which probably means that we're getting the Yamaha.",
                    "author": "@NathanRanover",
                    "likes": 6,
                    "publishedAt": "2026-02-16T18:05:11Z"
                },
                {
                    "text": "Love the video keep up the good work 👍",
                    "author": "@JasonGniewecki",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:02:42Z"
                },
                {
                    "text": "finally ive been waiting for this!",
                    "author": "@Taylor.741",
                    "likes": 1,
                    "publishedAt": "2026-02-16T17:35:50Z"
                },
                {
                    "text": "Oh My Johnny",
                    "author": "@Stoffxl",
                    "likes": 0,
                    "publishedAt": "2026-02-16T19:07:36Z"
                },
                {
                    "text": "Bike sounds great",
                    "author": "@jamaquelreynolds58",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:37:37Z"
                },
                {
                    "text": "Bike sounds amazing",
                    "author": "@seedabassman",
                    "likes": 0,
                    "publishedAt": "2026-02-16T18:12:18Z"
                },
                {
                    "text": "Fireeee vid troy",
                    "author": "@Hoodratzrippin",
                    "likes": 0,
                    "publishedAt": "2026-02-16T17:03:13Z"
                },
                {
                    "text": "Looks and sounds great so far",
                    "author": "@TACTICALWOOKIE",
                    "likes": 0,
                    "publishedAt": "2026-02-16T17:25:57Z"
                },
                {
                    "text": "They just posted this and I was watching it then u posted",
                    "author": "@DirtyMaxx2312",
                    "likes": 2,
                    "publishedAt": "2026-02-16T17:04:04Z"
                }
            ]
        }
    ]
}