{
    "videoId": "5B2s0hqUXwY",
    "history": [
        {
            "fetchedAt": "20260218_163851",
            "commentCount": 25,
            "comments": [
                {
                    "text": "I recently heard a sad story about an elderly lady who died from an infection from her dog licking her wound. Apparently the bacteria that killed her is only found in domesticated dogs. The dog was just trying to comfort her.",
                    "author": "@muhajir8469",
                    "likes": 18,
                    "publishedAt": "2026-02-18T03:46:30Z"
                },
                {
                    "text": "We love you for Allah’s sake brother. You’re doing a great job may Allah keep you steadfast. Aamiin.",
                    "author": "@Skeptic_Waryaa",
                    "likes": 30,
                    "publishedAt": "2026-02-17T22:11:44Z"
                },
                {
                    "text": "Skip to 39:20 👍🏽",
                    "author": "@FR33_PALESTIN33",
                    "likes": 60,
                    "publishedAt": "2026-02-18T00:27:50Z"
                },
                {
                    "text": "Last few video been absolute gold, Allahumma barek, truly amazing work",
                    "author": "@shainn2237",
                    "likes": 11,
                    "publishedAt": "2026-02-18T02:10:02Z"
                },
                {
                    "text": "Brother Asrar has a very high social pull. That's why you must collaborate and expand your reach. You don't want to be alone in this fight. Even work with Safina society.",
                    "author": "@activemeasures6251",
                    "likes": 8,
                    "publishedAt": "2026-02-18T05:40:06Z"
                },
                {
                    "text": "*The moon casts its silvery light, a holy month that speaks to us. The world grows quiet, the noise fades away, for now peace prevails in the heart. Patience and faith, hand in hand, spread as a blessing throughout the land. Ramadan Mubarak to you all!* 🤲",
                    "author": "@achmedk3658",
                    "likes": 40,
                    "publishedAt": "2026-02-17T21:46:37Z"
                },
                {
                    "text": "Thank you for calling out that the FCNA methodology is trash from a scientific standpoint. If it was accurate, it should correlate with the moonsighters; imagine a stress test that was 50% accurate and 50% inaccurate at predicting CAD, or some lab test that had terrible sensitivity and specificity of a coin toss. Would we ever use that? Yet these clowns act as if they are so sophisticated, when in fact that they are the ignoramuses from a scientific standpoint. They can come up with a mathematical model based on criteria that gives 95+% accuracy for scheduling purposes which they can then confirm with visual moonsighting as the clincher, but they refuse based on pure hatred of tradition and arrogance, I suspect.",
                    "author": "@bigdawgification",
                    "likes": 13,
                    "publishedAt": "2026-02-18T03:15:16Z"
                },
                {
                    "text": "Dog rant was hilarious 😂",
                    "author": "@HalalZoomer",
                    "likes": 12,
                    "publishedAt": "2026-02-18T01:40:50Z"
                },
                {
                    "text": "imagine ur reward for the heat u take, i am glad that you speak about those things, its really important and u bring proofs,\nis not like \"these ohters\", and in expense of u and ur family's pain, they do expose themselves and show who not to actually \nlisten about those matters.\njazaakALlah khayran, may Almighty bless you n ur family with Jannatul Firdaus and Nuur in Kabr and Successful life in dunya according to Almighty Creator of all ameen \nAllahumma Salli we sallem ala nebyyna Muhammad we ala alihi we sahbihi",
                    "author": "@estonian44",
                    "likes": 8,
                    "publishedAt": "2026-02-18T01:48:31Z"
                },
                {
                    "text": "Salaam Brother Daneil, \nGreat show as always. \nI was the women that had the dog. Rescued the animal myself and the respomsibility was mine. My husband didn't take on the stereotypical man/dog relationship. Dog lived 13yrs. He took it to see the vet once and never walked her independant of myself. The dog isn't really the issue. It is how people treat these animals. Great show in regards to the moon sighting.",
                    "author": "@SHARDAE84",
                    "likes": 6,
                    "publishedAt": "2026-02-18T02:56:03Z"
                },
                {
                    "text": "Episode over this modernist fiqh club would be good",
                    "author": "@shainn2237",
                    "likes": 9,
                    "publishedAt": "2026-02-18T02:35:59Z"
                },
                {
                    "text": "The Islamic view on Dogs as Pets is on point",
                    "author": "@homtanks7259",
                    "likes": 1,
                    "publishedAt": "2026-02-18T11:17:45Z"
                },
                {
                    "text": "Thank you brother Daniel.",
                    "author": "@readred2011",
                    "likes": 8,
                    "publishedAt": "2026-02-18T03:47:38Z"
                },
                {
                    "text": "The house of Saud are so careless Wednesday was predicted to be the first day of Ramadhan as early as last year according to their calender 😂😂",
                    "author": "@nomorejunkmalemateuk2009",
                    "likes": 1,
                    "publishedAt": "2026-02-18T12:11:59Z"
                },
                {
                    "text": "My school teacher taught that the Sun visibly sets below the horizon approx 2 minutes after it technically sets.",
                    "author": "@mohtadansari9708",
                    "likes": 1,
                    "publishedAt": "2026-02-18T12:00:26Z"
                },
                {
                    "text": "Jazakullah khairan, akhi for shedding light on this. 10 years ago it was easy to find a masjid that followed moonsighting, now it's almost impossible. This was an intentional and deliberate move by Yasir Kazi and the FCNA to force this upon the western Muslims (he boasts in one video that soon moonsighting masajid will disappear). But these idiots are so unscientific that they don't realize that by using an elongation of >8 degrees and the moon > 5 degrees above the horizon as their criteria as opposed to conjunction, they have accepted moonsighting as the gold standard. And why shouldn't it be? Visual confirmation trumps any mathematic model that attempts at to predict the visual reality, and which can by definition be only at best as good as the gold standard. As a cardiac surgeon, it's like someone saying that they will take a stress test which indirectly checks for coronary artery disease, over a cath where one can visualize the blockage. Smh, these fools are so enamored with science, they don't even know foundational epistemology and statistics.",
                    "author": "@bigdawgification",
                    "likes": 4,
                    "publishedAt": "2026-02-18T03:01:30Z"
                },
                {
                    "text": "Great work Brother Daniel. \nWe witness a FULL literal LUNAR ECLIPSE...\n\nSo where is the crescent.",
                    "author": "@easternhealingsecrets3010",
                    "likes": 6,
                    "publishedAt": "2026-02-17T21:51:37Z"
                },
                {
                    "text": "Am in lebanon wee didnt se the moon..so ramadan start 19 feb😮",
                    "author": "@ShdyZTR",
                    "likes": 13,
                    "publishedAt": "2026-02-17T23:28:09Z"
                },
                {
                    "text": "LOL @ the dog rant. Hilarious",
                    "author": "@aalaaal-saad8928",
                    "likes": 14,
                    "publishedAt": "2026-02-17T22:25:27Z"
                },
                {
                    "text": "Fantastic video and it made things clear for me after many years of confusion Thank God!    We were meant to witness God's miracles like the moon so we can be reminded of His signs and praise Him, as well as never take for granted the harmony of the universe.",
                    "author": "@saghafo1",
                    "likes": 1,
                    "publishedAt": "2026-02-18T07:20:33Z"
                },
                {
                    "text": "If they have new satellites then connect to camera and record videos so we can also see it",
                    "author": "@WajidAliKhilji",
                    "likes": 5,
                    "publishedAt": "2026-02-17T23:05:13Z"
                },
                {
                    "text": "May Allah give you a all good Ramadan ameen",
                    "author": "@sofianaba5761",
                    "likes": 0,
                    "publishedAt": "2026-02-18T12:17:30Z"
                },
                {
                    "text": "this stream was hilarious",
                    "author": "@Gokbori1991",
                    "likes": 8,
                    "publishedAt": "2026-02-17T22:42:51Z"
                },
                {
                    "text": "39:00 we had those tv programs about dogs and football/s etc\nthen i was thinking about vegan where it comes form... and i was thinking about disney animation and how they \ndepict animals exactly like humans, speaking, feelings, full shabang",
                    "author": "@estonian44",
                    "likes": 4,
                    "publishedAt": "2026-02-18T01:37:45Z"
                },
                {
                    "text": "The horror game that been coming out with a new title on the past 3 Ramadans in In a role is resident evil\nResident evil village - may 7 ,2021 -during Ramadan \n\nResident evil 4 remake - march 24,2023- during Ramadan \n\n\nResident evil requiem - February 27, 2026 - this Ramadan",
                    "author": "@Trilliman707",
                    "likes": 3,
                    "publishedAt": "2026-02-18T01:42:17Z"
                }
            ]
        }
    ]
}