{
    "videoId": "0tV9R8rH52s",
    "history": [
        {
            "fetchedAt": "20260212_201033",
            "commentCount": 25,
            "comments": [
                {
                    "text": "❤❤ NOTHING BUT LOVE AND KINDNESS!!! ❤❤\n🍿 ALL UNBLURRED reactions are Uploaded early to PATREON with our Patreon Exclusives!! \r\nhttps://www.patreon.com/gotgames\r\n💛💛💛💛💛💛💛💛💛💛\r\r\r\nDON'T FORGET! All LIVE reactions take place on TWITCH!!\r\nhttps://www.twitch.tv/gotgames_tb\r\n❤❤❤❤❤❤❤❤❤\r\n👕 EXPLORE THE NEW CLOTHING RANGE! 👕\r\nwww.gotgamesclothing.com\r\n❄❄❄❄❄❄❄❄❄❄❄",
                    "author": "@GOTGames",
                    "likes": 285,
                    "publishedAt": "2026-02-11T20:11:29Z"
                },
                {
                    "text": "A Brit, from a completely different continent, and didn’t speak Spanish; yet understood the message to a T ❤",
                    "author": "@ChargerDriven",
                    "likes": 1331,
                    "publishedAt": "2026-02-11T22:52:33Z"
                },
                {
                    "text": "Bad Buny understood the assignment. \n\nPeriod.",
                    "author": "@anaperez5442",
                    "likes": 551,
                    "publishedAt": "2026-02-12T00:35:34Z"
                },
                {
                    "text": "I'm Brazilian, and I felt that Bad Bunny's performance was also for me. After all, America isn't a country, it's a continent. Imagine there being a country in Europe called \"United States of Europe\" and its citizens being called Europeans, as if there weren't other countries in Europe. That's the feeling.",
                    "author": "@deborasuzana807",
                    "likes": 1630,
                    "publishedAt": "2026-02-11T21:05:59Z"
                },
                {
                    "text": "Did you know than less than TEN years ago Bad Bunny was working in a supermarket in Puerto Rico working for tips packing the groceries?\nIt doesn't get more humble than that.",
                    "author": "@miltongonzalez772",
                    "likes": 602,
                    "publishedAt": "2026-02-12T00:05:23Z"
                },
                {
                    "text": "Im Mexican and very proud of the performance ❤",
                    "author": "@Rmhiakins90",
                    "likes": 560,
                    "publishedAt": "2026-02-11T23:10:30Z"
                },
                {
                    "text": "I am an older lady in a nursing home in Ohio, USA. I love Bad Bunny and his Super Bowl performance was legendary. Top viewed live and in my opinion in the top 5 of all time half time shows . I speak some Spanish but his message that the only thing powerful than hate is LOVE is understood. Viva Puerto Rico!",
                    "author": "@debrawalkermeyer9109",
                    "likes": 264,
                    "publishedAt": "2026-02-12T01:23:36Z"
                },
                {
                    "text": "Loved your reaction! Thank you for watching. Big hugs from Puerto Rico!",
                    "author": "@andresramirezmolina",
                    "likes": 662,
                    "publishedAt": "2026-02-11T21:05:54Z"
                },
                {
                    "text": "Bad Bunny made freaking history. So moved, so proud of him. Haiti.",
                    "author": "@woyblank751",
                    "likes": 133,
                    "publishedAt": "2026-02-12T02:06:06Z"
                },
                {
                    "text": "Unbelievable that you had a better reaction than many people in the US. As a puertorrican, I was a bit worried about what he will do in the show because I knew they would go hard against him. After the show, I couldn't have been more proud of everything he did. My heart was full of joy and I enjoyed every second of it. The last part was very emotional, seeing all the flags from every American country. Loved it so much ❤️",
                    "author": "@Rosy-pw6lr",
                    "likes": 407,
                    "publishedAt": "2026-02-12T00:26:08Z"
                },
                {
                    "text": "11:59 you’re not intruding, you were INVITED, Latin Style. Benito invited all of us.",
                    "author": "@treble1200",
                    "likes": 337,
                    "publishedAt": "2026-02-12T00:27:33Z"
                },
                {
                    "text": "When he was naming all the countries that are part of the American Continent there was a huge billboard sign that read: \"The only thing more powerful than hate is love\".",
                    "author": "@chavelaec1085",
                    "likes": 132,
                    "publishedAt": "2026-02-12T00:47:13Z"
                },
                {
                    "text": "The kid sleeping in the chair is something that everybody experience as a child in weddings.",
                    "author": "@vqcruz572",
                    "likes": 118,
                    "publishedAt": "2026-02-12T02:06:43Z"
                },
                {
                    "text": "He mention, 'God bless America' marking that every country in the continent is America, not only the US cause they call themselfs 'americans', when everyone in the continent is technically 'american'. \nThis is a tribute to the Latin culture, every little detail has a meaning. ❤",
                    "author": "@brishyou1711",
                    "likes": 118,
                    "publishedAt": "2026-02-12T02:18:41Z"
                },
                {
                    "text": "Bad Bunny did not speak Spanish at the Super Bowl. He spoke love, he spoke unity, he spoke happiness and kindness. He spoke a universal language that we all understand to communicate things we all care for.",
                    "author": "@cristabelmeza",
                    "likes": 29,
                    "publishedAt": "2026-02-12T03:18:40Z"
                },
                {
                    "text": "The way you got emotional, it’s because you felt the love. I wish everyone felt like this over here in the U.S. The divide and hate happening is so heartbreaking. Our presidents administrating said nothing but nasty things about bad bunny and now they’ve sent a letter to our congress to review the Super Bowl because they have so much hate. I’m happy it moved you like it did me!",
                    "author": "@moniquenicole88",
                    "likes": 550,
                    "publishedAt": "2026-02-11T21:01:36Z"
                },
                {
                    "text": "Bad bunny message was loud clear and beautiful. I cried. Im not even spanish, nor do I speak the language. It was unnecessary. The message was gorgous and so needed",
                    "author": "@bonniebernido8510",
                    "likes": 128,
                    "publishedAt": "2026-02-11T23:47:57Z"
                },
                {
                    "text": "Reguetton, Salsa, Merengue, Bomba, Plena and Hip Hop music in 12 minutes while showing the good times and bad times of Puerto Rican culture but always keeping the hope and love alive.",
                    "author": "@SyLuX636",
                    "likes": 426,
                    "publishedAt": "2026-02-11T20:29:37Z"
                },
                {
                    "text": "I'll be honest with you, I never heard of Bad Bunny up until the Superbowl. Well I heard the name but I never listened to his music. When I heard that some people were upset that he was performing all in Spanish I had to check it out for myself to see what the hype was about.  I loved it so much I replayed it five more times  and put his music on my phone. When lady ga ga came on I felt emotional. Needless to say I'm  becoming a fan and I never thought I would. I don't understand anything he's saying, but I can't get enough of the positive colorful  vibes and the beats. This was one  of the best halftimes I think I've ever seen.",
                    "author": "@jacobmccorry125",
                    "likes": 47,
                    "publishedAt": "2026-02-11T23:35:12Z"
                },
                {
                    "text": "That was an actually wedding! The couple invited Bad Bunny to their wedding but he couldn't make it so he instead invited them to the Superbowl, and they got married there. The officiate of the wedding is from Sacramento California where I'm from.",
                    "author": "@CreepyLolita",
                    "likes": 604,
                    "publishedAt": "2026-02-11T20:16:35Z"
                },
                {
                    "text": "This is us!  That’s how we party.  Thank you for the reaction of love!",
                    "author": "@mb-mz1yb",
                    "likes": 30,
                    "publishedAt": "2026-02-12T00:59:30Z"
                },
                {
                    "text": "The best description I have read about Benito's half time show is...\"That while it was a celebration of Latin American culture, it was also a statement that culture is meant to be shared. Love is stronger than hate, together we are America-and everyone is welcome on the dance floor.\"",
                    "author": "@ckealago",
                    "likes": 429,
                    "publishedAt": "2026-02-11T20:28:04Z"
                },
                {
                    "text": "As a Mexican American I was bawling my eyes out 😭😂 it felt like this was my family’s party and my cousins, aunts and uncles were on stage partying it up 💃🏻",
                    "author": "@nicolelunax",
                    "likes": 28,
                    "publishedAt": "2026-02-12T03:31:09Z"
                },
                {
                    "text": "Loved the reaction. Loved the show. I’m 71 from New Jersey now living in California. And I don’t speak Spanish. I was moved by this performance. The music, the dancing, and the emotion speak for themselves. The messages came through loud and clear. The criticism from the far right is ridiculous and unwarranted. They are complaining  about his not speaking English. . For the record more people speak Spanish in the U.S. than in Spain or Colombia.plus the unifying nature of the performance for all of the hemisphere. Great to watch this again with you.",
                    "author": "@timb.4742",
                    "likes": 222,
                    "publishedAt": "2026-02-11T21:37:42Z"
                },
                {
                    "text": "I am glad that you enjoyed the show as much as we did in Puerto Rico 🇵🇷",
                    "author": "@ana-juliacintron1927",
                    "likes": 29,
                    "publishedAt": "2026-02-11T23:07:11Z"
                }
            ]
        }
    ]
}