{
    "videoId": "GP_XZHAPvCs",
    "history": [
        {
            "fetchedAt": "20260218_163857",
            "commentCount": 25,
            "comments": [
                {
                    "text": "A riddle I once heard:\n\nQ: What do you call people who use the rhythm method?\n\n\nA: parents",
                    "author": "@eph2vv89only1way",
                    "likes": 592,
                    "publishedAt": "2026-02-17T18:50:02Z"
                },
                {
                    "text": "The biggest thing I preached to my now adult kids....CONDOMS, CONDOMS, CONDOMS.   I came of age in the 80s during the AIDS crisis.  Never come home from the party with something you didn't take with you.",
                    "author": "@maryg9482",
                    "likes": 370,
                    "publishedAt": "2026-02-17T18:58:09Z"
                },
                {
                    "text": "If you're not using prevention, you need to take prenatals because you are trying.",
                    "author": "@ciani2396",
                    "likes": 91,
                    "publishedAt": "2026-02-17T23:33:54Z"
                },
                {
                    "text": "Omgggggggg the just...lack of concern about their own fertility is astounding to me. Like...your talking about the potential for something that will change your life FOREVER and they're approaching it with all of the concern of a shrug and a 'Meh'. Holy moly.",
                    "author": "@sinclairmaxwellao3",
                    "likes": 166,
                    "publishedAt": "2026-02-17T19:15:24Z"
                },
                {
                    "text": "I'm pretty sure the rhythm method, for most people, is more effective at *getting* pregnant on purpose than it is for prevention.",
                    "author": "@beth8775",
                    "likes": 55,
                    "publishedAt": "2026-02-17T21:10:59Z"
                },
                {
                    "text": "Babies aren’t psychic. They can’t tell that you’re not ready.",
                    "author": "@AngelaBox-n8s",
                    "likes": 110,
                    "publishedAt": "2026-02-17T19:20:34Z"
                },
                {
                    "text": "Rythm method is why I'm 31 weeks pregnant with our 3rd right now. I ovulated a week earlier than normal, which would have been fine expcept it turns out sperm can definitely live for 6 days. \n\nFound out I ovulated after it had already happened and I thought, \"I'm pretty sure his swimmers won't have lived that long\" two weeks later I felt more tired than I've ever felt before. I did a test, but I definitely didn't need to!\n\nFortunately, we were planning to start trying in a couple of years, so it's just been brought up sooner. But I would totally only recommend the rythm method to anyone if they wouldn't be upset if they did get pregnant 😂 (we're delighted and getting a vasectomy scheduled 😂)",
                    "author": "@jenniferhine5400",
                    "likes": 97,
                    "publishedAt": "2026-02-17T21:18:53Z"
                },
                {
                    "text": "Tubes tied and still got pregnant! Watching one of her videos probably saved my life",
                    "author": "@andreareed4402",
                    "likes": 30,
                    "publishedAt": "2026-02-17T21:59:59Z"
                },
                {
                    "text": "“The rhythm is gonna get you.” 😂😂",
                    "author": "@lindaarmstrongjackman9788",
                    "likes": 7,
                    "publishedAt": "2026-02-18T01:14:59Z"
                },
                {
                    "text": "All I needed to know about the rhythm method was that I learned about it for the first time from this show.",
                    "author": "@jamiesmith9922",
                    "likes": 10,
                    "publishedAt": "2026-02-18T00:49:08Z"
                },
                {
                    "text": "This is wild to me. Like, truly wild.",
                    "author": "@RaspberryMint_1",
                    "likes": 24,
                    "publishedAt": "2026-02-17T18:51:33Z"
                },
                {
                    "text": "the number of people who don't use any kind of birth control (even just cycle monitoring) and then are surprised when they get pregnant baffle me. \n\nat this point I've had a bisalp and an IUD, but when my now husband and I were first dating it was a whole conversation before we were ready to swap from condoms+IUD to just IUD. and that conversation involved test results and \"so in the unlikely event my IUD fails, we're splitting the cost of an abortion\"",
                    "author": "@justletmelisten243",
                    "likes": 129,
                    "publishedAt": "2026-02-17T19:07:26Z"
                },
                {
                    "text": "I'm going to be 60 this year. I had a hysterectomy at 32. I STILL have nightmares about late periods and pregnancy tests. The worst is dreaming you can't find pregnancy tests anywhere and can't get in to see the doctor for 2 months.",
                    "author": "@JoanieBC",
                    "likes": 82,
                    "publishedAt": "2026-02-17T19:08:23Z"
                },
                {
                    "text": "I was actually tracking my regular cycle and still got pregnant lol. This is a recipe for disaster",
                    "author": "@BroccoliAndCheese01",
                    "likes": 45,
                    "publishedAt": "2026-02-17T18:52:40Z"
                },
                {
                    "text": "Gamblers love the rhythm method",
                    "author": "@enteracoakpo",
                    "likes": 24,
                    "publishedAt": "2026-02-17T19:25:52Z"
                },
                {
                    "text": "8 to 25% failure rate is pretty high! 😅",
                    "author": "@itoshiibaka8267",
                    "likes": 9,
                    "publishedAt": "2026-02-17T20:16:42Z"
                },
                {
                    "text": "I have always wanted as much control over my fertility as possible. I can't do the, \"If we get pregnant on the rhythm method we get pregnant\" thing because I need to know when I should stop doing dangerous things like drinking alcohol. I want to know when I need prenatal care, when I should be taking prenatal vitamins, etc. I especially don't want to have a kid when I'm not ready to in any way shape or form. Not everyone has the same approach, but I want to be prepared for the creation of a new human and give them the best possible start in life.",
                    "author": "@nikkifahy7762",
                    "likes": 7,
                    "publishedAt": "2026-02-18T00:54:10Z"
                },
                {
                    "text": "\"I guess our technique...\" you lost me right there buddy.",
                    "author": "@karifaller9284",
                    "likes": 2,
                    "publishedAt": "2026-02-18T04:09:35Z"
                },
                {
                    "text": "I’m the result of rhythm method!",
                    "author": "@Sk8rToon",
                    "likes": 8,
                    "publishedAt": "2026-02-17T21:16:21Z"
                },
                {
                    "text": "The way I see it, if you’re using birth control, you don’t wanna be pregnant.",
                    "author": "@alyssa2796",
                    "likes": 9,
                    "publishedAt": "2026-02-17T19:09:07Z"
                },
                {
                    "text": "I have PCOS and really don't want to be pregnant. I have an IUD and my partner has a vasectomy. I still take pregnancy tests every 3 months just to make sure. It used to be every 6 months but with the new abortion laws in the US I've upped how often. I buy the strips so it's pretty cheap and not too much waste",
                    "author": "@AAllan-mo1ll",
                    "likes": 26,
                    "publishedAt": "2026-02-17T19:36:07Z"
                },
                {
                    "text": "As I was told \"it works until it doesn't.\"",
                    "author": "@Vaska.sedai1",
                    "likes": 8,
                    "publishedAt": "2026-02-17T20:10:13Z"
                },
                {
                    "text": "I feel like it also bears mentioning that if you are sexually active and not using birth control because you're okay with a surprise pregnancy...try to be practically prepared for a pregnancy to occur at any time. Take prenatal vitamins (or at least supplemental folate), make sure you have health insurance, get a check-up, etc. And yes, do test if your period is late or test regularly if you can't tell whether it is. Take responsibility for a potential child's well-being, too.",
                    "author": "@harringt100",
                    "likes": 11,
                    "publishedAt": "2026-02-18T02:51:46Z"
                },
                {
                    "text": "\"we didn't think it was a possibility\" I'm sorry what? You do know how babies are made right? RIGHT!?!?",
                    "author": "@virginmary7187",
                    "likes": 5,
                    "publishedAt": "2026-02-18T01:09:07Z"
                },
                {
                    "text": "This man sounded like he wanted to get her pregnant",
                    "author": "@JEDonnert",
                    "likes": 2,
                    "publishedAt": "2026-02-18T14:16:36Z"
                }
            ]
        }
    ]
}