{
    "videoId": "UwV_2T6sSPs",
    "history": [
        {
            "fetchedAt": "20260213_040208",
            "commentCount": 0,
            "comments": []
        },
        {
            "fetchedAt": "20260213_210857",
            "commentCount": 23,
            "comments": [
                {
                    "text": "This needs to be simplified.",
                    "author": "@TheTikTokerofYouTube",
                    "likes": 16,
                    "publishedAt": "2026-02-12T20:09:57Z"
                },
                {
                    "text": "Can we get back Slide Over's old carousel feature and get rid of this ugly glass border?",
                    "author": "@cassio-fm",
                    "likes": 15,
                    "publishedAt": "2026-02-12T23:05:01Z"
                },
                {
                    "text": "Or you can just give us back split screen with the three grey dots instead of this.",
                    "author": "@sirCreepyEdelstein",
                    "likes": 11,
                    "publishedAt": "2026-02-12T18:18:26Z"
                },
                {
                    "text": "I found iPadOS easier to use before. Now it has become very complex. It’s a pity that it always needs this window mode.",
                    "author": "@Kevvi1994",
                    "likes": 15,
                    "publishedAt": "2026-02-12T21:28:29Z"
                },
                {
                    "text": "Please give us the option to have JUST Split View and Slide Over, exactly the way it was on iPadOS 18. As a long time iPad user, this system is unusable and only gets in my way.",
                    "author": "@anianii",
                    "likes": 19,
                    "publishedAt": "2026-02-12T23:09:59Z"
                },
                {
                    "text": "I really hate windowing on my iPad. The windows hold so little information, it’s not convenient",
                    "author": "@QuattroRMT",
                    "likes": 8,
                    "publishedAt": "2026-02-12T21:31:48Z"
                },
                {
                    "text": "It’s getting so complicated…And it haves different logic than macOS, the red x button in macOS is for closing the window, but in iPadOS it’s quitting the app.",
                    "author": "@vafon3453",
                    "likes": 8,
                    "publishedAt": "2026-02-13T00:48:25Z"
                },
                {
                    "text": "So, the UI is going backwards. The whole using gestures to get two apps side-by-side didn’t really work and that’s why you added the three dots at the top of an app so you can enter half-and-half so much easier. Not only that, but you didn’t have to only choose from your apps in the dock as your second app, you could side-by-side any two apps easily. Now we’re back to gestures which I like but for a lot of users, both young and old, is not easy. There is best practice. It seems like you’re just trying to make a new operating system each year to sell iPads and you change things—but isn’t there a best way to do something? After years and years of iPadOS?",
                    "author": "@252ETC",
                    "likes": 8,
                    "publishedAt": "2026-02-12T22:30:48Z"
                },
                {
                    "text": "I miss old slide over😢",
                    "author": "@muhaiminrafid3830",
                    "likes": 26,
                    "publishedAt": "2026-02-12T17:46:42Z"
                },
                {
                    "text": "Please bring back the previous split screen in settings. Because it was so much more intuitive.",
                    "author": "@TheManInTheSu8",
                    "likes": 19,
                    "publishedAt": "2026-02-12T18:05:02Z"
                },
                {
                    "text": "Bring back Slide Over stacks.",
                    "author": "@Septoleaf",
                    "likes": 16,
                    "publishedAt": "2026-02-12T22:21:10Z"
                },
                {
                    "text": "The new windowing is excellent, but please bring back the old slide over functionalities with the multiple apps carousel, as well as the ability to use it while using MacOS mirroring via sidecar",
                    "author": "@callmesasma",
                    "likes": 5,
                    "publishedAt": "2026-02-12T21:21:42Z"
                },
                {
                    "text": "Please add the slide over app carousel!",
                    "author": "@awizzz3234",
                    "likes": 12,
                    "publishedAt": "2026-02-13T03:36:31Z"
                },
                {
                    "text": "Honestly, this is such a mess. I can't understand how you decided to ship this. Even in this carefully crafted video, I already feel disturbed by how cumbersome this is to use. I want multitasking on iPad WITHOUT the burden of a window manager. The old system was perfect. No need to remove it. Absolutely zero need.",
                    "author": "@anianii",
                    "likes": 11,
                    "publishedAt": "2026-02-12T23:14:59Z"
                },
                {
                    "text": "Just a few hours ago I disabled windowed apps after months of trying to make it work. I’ve had it. This is simply not intuitive to touch screens. Every time I try to access Notification Center now I either get this unnecessary menu bar or I resize the app. This is incredibly limiting, why all the borders of a full screen app are a resizing handle? I also can’t drag windows out anymore. I could waive an app out of the way previously, but now I need to tap the windows control button to have options, then try to tap minimize. This is not an expected behavior for a touch screen. I should not tap a button twice just to minimize or close an app. I need to be able to slide it, as Windows 8 mastered more than a decade ago. And of course, the keyboard has insane borders issue, even worse than on the iPhone, which is already a huge topic on social media on its own. Horrible update, who asked for this? It’s only redeeming quality is Liquid Glass",
                    "author": "@עידוכסלו",
                    "likes": 21,
                    "publishedAt": "2026-02-13T00:44:55Z"
                },
                {
                    "text": "It's not perfect, still space for improval....",
                    "author": "@AndreasA-o1x",
                    "likes": 2,
                    "publishedAt": "2026-02-12T22:29:12Z"
                },
                {
                    "text": "Thanks….kindly upload more tutorials videos like this",
                    "author": "@Geniusaftabalam",
                    "likes": 0,
                    "publishedAt": "2026-02-12T19:02:01Z"
                },
                {
                    "text": "I use this like my Chromebook this is the best update  thank u",
                    "author": "@Divy473",
                    "likes": 0,
                    "publishedAt": "2026-02-12T21:19:42Z"
                },
                {
                    "text": "Thank you Apple for bringing these features back!!",
                    "author": "@chrismoore8172",
                    "likes": 0,
                    "publishedAt": "2026-02-12T17:43:23Z"
                },
                {
                    "text": "Great info",
                    "author": "@allen9975",
                    "likes": 0,
                    "publishedAt": "2026-02-12T22:01:47Z"
                },
                {
                    "text": "Thank you.",
                    "author": "@mil546",
                    "likes": 0,
                    "publishedAt": "2026-02-12T21:23:10Z"
                },
                {
                    "text": "nice !",
                    "author": "@shadowgold1",
                    "likes": 0,
                    "publishedAt": "2026-02-12T17:27:42Z"
                },
                {
                    "text": "Thanks..",
                    "author": "@endangtirtana5329",
                    "likes": 0,
                    "publishedAt": "2026-02-13T04:17:08Z"
                }
            ]
        }
    ]
}