{
    "videoId": "VpzI6b5VsTA",
    "history": [
        {
            "fetchedAt": "20260217_202039",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Any other PC troubleshooting questions I can help with?",
                    "author": "@ZachsTechTurf",
                    "likes": 79,
                    "publishedAt": "2026-02-17T18:18:25Z"
                },
                {
                    "text": "Thats probably bcuz of the 2mb ram",
                    "author": "@AsianKevu",
                    "likes": 461,
                    "publishedAt": "2026-02-17T18:19:39Z"
                },
                {
                    "text": "And make sure your hdmi isnt plugged into your motherboard",
                    "author": "@RXGE-Edits",
                    "likes": 285,
                    "publishedAt": "2026-02-17T18:21:45Z"
                },
                {
                    "text": "and don’t forget to check if your PC has cpu cooler",
                    "author": "@AbandonedKinte",
                    "likes": 124,
                    "publishedAt": "2026-02-17T18:22:25Z"
                },
                {
                    "text": "I'd bet everything, that he pluged the hdmi into the motherboard.",
                    "author": "@Kcteb",
                    "likes": 12,
                    "publishedAt": "2026-02-17T19:45:49Z"
                },
                {
                    "text": "7500f, 9060xt user here. I fixed this exact issue by turning off hyper-fx or something like that on my gpu software",
                    "author": "@mr.mloteczek2215",
                    "likes": 46,
                    "publishedAt": "2026-02-17T18:41:57Z"
                },
                {
                    "text": "Because Fortnite is a online game I would also check the ping and Overall Internet stability",
                    "author": "@Xavrite",
                    "likes": 22,
                    "publishedAt": "2026-02-17T18:45:25Z"
                },
                {
                    "text": "This happens all the time. You need to disable the \"family gaming controller\" thingy in network adapters/control panel. I had these stutters since I got my new PC, and after disabling that, fortnite pretty much never stutters.",
                    "author": "@nekoslayer973",
                    "likes": 4,
                    "publishedAt": "2026-02-17T19:23:47Z"
                },
                {
                    "text": "Hombre plugged his DisplayPort into the motherboard 😆",
                    "author": "@scottstorchfan",
                    "likes": 5,
                    "publishedAt": "2026-02-17T19:02:59Z"
                },
                {
                    "text": "I would also suggest benchmarking other games besides Fortnite \n\nThis is probably the fastest way to determine if it's actually the hardware or the game (idk how it could be the game but I'd still try it out)",
                    "author": "@adityaanuragi6916",
                    "likes": 2,
                    "publishedAt": "2026-02-17T19:16:22Z"
                },
                {
                    "text": "Something made me wonder if they applied thermal paste.",
                    "author": "@OnSilverWings",
                    "likes": 2,
                    "publishedAt": "2026-02-17T19:23:06Z"
                },
                {
                    "text": "What if it's because of the Wi-Fi?",
                    "author": "@DeathGamers770",
                    "likes": 12,
                    "publishedAt": "2026-02-17T18:44:32Z"
                },
                {
                    "text": "Just built my PC back up after having to replace motherboard thanks to your videos, and several other creators. Thank you!",
                    "author": "@AlwaysWright42",
                    "likes": 0,
                    "publishedAt": "2026-02-17T19:40:41Z"
                },
                {
                    "text": "Probably running 8gb system ram or have their monitor plugged into their motherboard",
                    "author": "@WayneWatson1",
                    "likes": 4,
                    "publishedAt": "2026-02-17T18:45:42Z"
                },
                {
                    "text": "Hi, great video!",
                    "author": "@Fireboy-n4k",
                    "likes": 3,
                    "publishedAt": "2026-02-17T18:18:47Z"
                },
                {
                    "text": "Don't forget to plug your monitor into the GPU and not the Motherboard, especially since many Ryzen CPUs nowadays come with a IGPU",
                    "author": "@JoJos_RetroGaminG36",
                    "likes": 1,
                    "publishedAt": "2026-02-17T19:44:51Z"
                },
                {
                    "text": "Or maybe their system is just set to use the integrated graphics, not the dedicated one.",
                    "author": "@smabedi",
                    "likes": 2,
                    "publishedAt": "2026-02-17T18:47:48Z"
                },
                {
                    "text": "Also make sure you aren’t bogging down adrenaline. A common example is having game supported fsr and then adrenaline fluid motion frames at the same time and this causes terrible gameplay behavior. For me this occurred on where winds meet and it was a stuttering mess",
                    "author": "@chaosifuzii0n157",
                    "likes": 0,
                    "publishedAt": "2026-02-17T18:55:08Z"
                },
                {
                    "text": "Make sure to plug your hdmi/display port into the gpu and not the motherboard",
                    "author": "@LavZy04",
                    "likes": 1,
                    "publishedAt": "2026-02-17T19:50:26Z"
                },
                {
                    "text": "My laptop with a 9300h and a 1650 cant run it either, but that makes more sense",
                    "author": "@mosfet-guy",
                    "likes": 1,
                    "publishedAt": "2026-02-17T18:53:21Z"
                },
                {
                    "text": "hi zach how are you doing . so i have a 14400f on a H610M K but i have a heating problem with the vrm mos as when i allow my cpu to use 100w it rocks 105C in less than 5 min , do you recommend me making a sandwich heatsink alone or should i add a mini 50mm fan too??",
                    "author": "@Maen_Alsaleh",
                    "likes": 5,
                    "publishedAt": "2026-02-17T18:20:52Z"
                },
                {
                    "text": "same problem i had with 7500f 9060xt in valorant, i had lot of microstutters, i followed a windows optimisation guide, specifically 10min one from lecctron, and now its buttery smooth again.\nso do what this vid says+ the optimization guide, and it should be good",
                    "author": "@Someone-md9vd",
                    "likes": 2,
                    "publishedAt": "2026-02-17T18:33:56Z"
                },
                {
                    "text": "Hey dude,I’ve been watching your videos for a while now and I wanted to ask a question,I’ve been into gaming for a while now,but all I’ve had to play with is my brothers old Xbox 360 and my Nintendo ds ,and the only time I’ve been getting specs of modern gaming is when I visit my friends house or when my older siblings come over,and I’ve been wanting to get my own consoles,but my parents always tell me no because gaming is useless and expensive,I’ve been hoping that you could either give me good job ideas to make my own money where I don’t need to be over 18,or you could name some stores that give modern and last generation consoles for good deals,for example,the Xbox one,ps4,maybe the Nintendo switch ,or modern consoles like the Xbox series s,ps5,and Nintendo switch 2,or if they have any budget gaming pcs under 600$",
                    "author": "@Sirvexvex99",
                    "likes": 1,
                    "publishedAt": "2026-02-17T19:10:47Z"
                },
                {
                    "text": "I have the same cpu and gpu and had the same problem apparently it had to do with a fortnite update so i had to switch from direct x12 tot performance and wait until they fixed it or there is a driver update",
                    "author": "@JoostKeustermans",
                    "likes": 1,
                    "publishedAt": "2026-02-17T19:21:42Z"
                },
                {
                    "text": "It may also be the cause of slow or not enough ram(I doubt tho but amd cpus benefit from faster ram speeds) and the psu if it's not enough wattage and basically everything else he mentioned, or it can the mobos bios, tbh it could be anything",
                    "author": "@CcGoku_solos_your_fav_verse",
                    "likes": 0,
                    "publishedAt": "2026-02-17T18:44:16Z"
                }
            ]
        }
    ]
}