{
    "videoId": "Lc2NXWbEbPI",
    "history": [
        {
            "fetchedAt": "20260228_110022",
            "commentCount": 25,
            "comments": [
                {
                    "text": "8:36 bruh why Kratos is standing like he’s coaching a little league soccer game?",
                    "author": "@gerardyimdesign",
                    "likes": 95,
                    "publishedAt": "2026-02-27T23:50:54Z"
                },
                {
                    "text": "Microsoft not giving any competition to Sony was another nail in the coffin",
                    "author": "@cdmanjak",
                    "likes": 59,
                    "publishedAt": "2026-02-28T00:14:09Z"
                },
                {
                    "text": "I tried it game is ok but the ui is crazy i cant find amything",
                    "author": "@KrOsImPL",
                    "likes": 40,
                    "publishedAt": "2026-02-28T00:34:20Z"
                },
                {
                    "text": "Kimtrails was referencing a shield if I remember right. The icons were the same but one had a higher capacity when you hover over it to look at the stats.",
                    "author": "@DrazenX195",
                    "likes": 15,
                    "publishedAt": "2026-02-27T23:26:47Z"
                },
                {
                    "text": "8:25 dear god looks more AI generated than the fake journalist",
                    "author": "@oddec6142",
                    "likes": 25,
                    "publishedAt": "2026-02-28T00:10:33Z"
                },
                {
                    "text": "Polls said they expect to see 250k people playing the beta",
                    "author": "@TyrantsRuin",
                    "likes": 12,
                    "publishedAt": "2026-02-27T23:31:34Z"
                },
                {
                    "text": "Any chance you could lower the volume of the background muzak on these videos? Love you guys and the commentary but I feel like I'm going standing in a Disney elevator with that tune.",
                    "author": "@gwarden_nz",
                    "likes": 16,
                    "publishedAt": "2026-02-28T03:30:56Z"
                },
                {
                    "text": "Sony really killed BluePoint in favor of more stuff like this. They could have had them printing money in the back with remakes to help fund these dumbass live service projects at the very least.",
                    "author": "@vilumino7397",
                    "likes": 129,
                    "publishedAt": "2026-02-27T23:24:58Z"
                },
                {
                    "text": "The UI did feel horrible for Marathon, but goddamn do Bungie know how to make a shooter that feels good to, well, shoot.",
                    "author": "@pellistv",
                    "likes": 100,
                    "publishedAt": "2026-02-27T23:42:19Z"
                },
                {
                    "text": "How do you even do an AI review of a brand new product? It's just generating believable human language, but it doesn't actually know anything about the thing you're asking it to review. Either the review will be entirely generic and non-specific (possibly pulling from reviews of earlier entries in the same franchise/genre if those are in its training data) OR you'd have to quickly feed it every other brand new review of the game the second after they are published and then instantly generate a review from the information in all those reviews......which is just straight up plagiarism",
                    "author": "@MrDanlancelot",
                    "likes": 10,
                    "publishedAt": "2026-02-28T01:16:00Z"
                },
                {
                    "text": "been looking forward to that Kane remaster",
                    "author": "@Sumer-Akkad",
                    "likes": 3,
                    "publishedAt": "2026-02-27T23:45:36Z"
                },
                {
                    "text": "I wish marathon wasn't an extraction shooter :( Love the style of it.\nWould have loved a new standard shooter halo type game with a good campaign and MP",
                    "author": "@torvasdh",
                    "likes": 73,
                    "publishedAt": "2026-02-28T00:07:12Z"
                },
                {
                    "text": "8:36\nThis is not god of war this is creator of conflict",
                    "author": "@Navonex",
                    "likes": 3,
                    "publishedAt": "2026-02-28T01:25:35Z"
                },
                {
                    "text": "background music is a little loud guys but otherwise a great show",
                    "author": "@khcstewie",
                    "likes": 2,
                    "publishedAt": "2026-02-28T02:09:58Z"
                },
                {
                    "text": "Can u turn the music up? I can almost hear commentary in this vid",
                    "author": "@ian-0",
                    "likes": 6,
                    "publishedAt": "2026-02-28T04:46:58Z"
                },
                {
                    "text": "I could save some gaming studio a couple hundred million dollars just by saying \"No battle royales, no extraction shooters. It's fucking 2026, not 2019.\"",
                    "author": "@asacloutier7530",
                    "likes": 218,
                    "publishedAt": "2026-02-27T23:37:24Z"
                },
                {
                    "text": "It felt just like Destiny 1 Beta...which means we are the game testers and theyll build the game as it comes lol.",
                    "author": "@CloudStrifeWolf",
                    "likes": 2,
                    "publishedAt": "2026-02-28T05:49:19Z"
                },
                {
                    "text": "the marathon server test has taught me how fucking clueless the average gamer really is",
                    "author": "@digitalhellscapeproduction6438",
                    "likes": 3,
                    "publishedAt": "2026-02-28T05:40:40Z"
                },
                {
                    "text": "Changing the background music, sounds great!",
                    "author": "@seldoonnemar4459",
                    "likes": 1,
                    "publishedAt": "2026-02-27T23:59:56Z"
                },
                {
                    "text": "Been having fun with Marathon. Didn’t think I would until I gave it a shot. That said, it definitely feels like something that wasn’t made for everyone as some of its systems feel obtuse and archaic at first glance in a way thats similar to other titles that share this genre. While I was pleasantly surprised by how much I enjoyed it, I understand why other players would rather spend their time and money elsewhere.",
                    "author": "@kqian349",
                    "likes": 16,
                    "publishedAt": "2026-02-28T00:28:15Z"
                },
                {
                    "text": "Sony is only considering dropping their games from PC because Xbox is going to have access to PC game stores with the next console so they don't want them to have their exclusives",
                    "author": "@Reesesotg",
                    "likes": 9,
                    "publishedAt": "2026-02-28T00:02:16Z"
                },
                {
                    "text": "Brians 5 Second Review next week: a ball and cup",
                    "author": "@danjamesdixon9835",
                    "likes": 1,
                    "publishedAt": "2026-02-28T09:05:18Z"
                },
                {
                    "text": "The background music track in this video is awesome i love how poppy and funky it is",
                    "author": "@connoredling8864",
                    "likes": 1,
                    "publishedAt": "2026-02-28T05:17:37Z"
                },
                {
                    "text": "What happened to Jill?",
                    "author": "@hellifirebringer4794",
                    "likes": 1,
                    "publishedAt": "2026-02-27T23:25:10Z"
                },
                {
                    "text": "The fog is probably to hide how small the maps are. Hah.",
                    "author": "@LLAAPPSSEE",
                    "likes": 1,
                    "publishedAt": "2026-02-28T10:52:50Z"
                }
            ]
        }
    ]
}