{
    "videoId": "DEW8MDMqOXQ",
    "history": [
        {
            "fetchedAt": "20260212_004542",
            "commentCount": 100,
            "comments": [
                {
                    "text": "Necesitamos que todas las canciones del album tengan video",
                    "author": "@KevinEspinal-b7o",
                    "likes": 1557,
                    "publishedAt": "2026-02-11T15:17:23Z"
                },
                {
                    "text": "AQUI LOS QUE QUIEREN QUE EL SIGUIENTE SEA LA YUGULAR 👇",
                    "author": "@EstebanTamayorivas",
                    "likes": 2055,
                    "publishedAt": "2026-02-11T17:05:49Z"
                },
                {
                    "text": "Aquí los que estuvieron antes de que salga 👇❤\n(Te amo rosi gracias por sacar un videoclip de mi cancion fav de lux)",
                    "author": "@GaelParisi",
                    "likes": 1049,
                    "publishedAt": "2026-02-09T20:58:53Z"
                },
                {
                    "text": "HOW MANY INTERNATIONAL FANS ARE HERE???",
                    "author": "@ryannnnn.nn9",
                    "likes": 366,
                    "publishedAt": "2026-02-11T18:50:30Z"
                },
                {
                    "text": "Esto es una interpretación libre, pero creo que quiere darnos a entender esto:\n\nRosalía yace sobre la arena implacable del desierto. Su cuerpo no apareció allí por azar; fue desechada, arrojada al vacío por manos anónimas. Mientras el calor la consume y su rostro roza el suelo, los fragmentos de un amor terrenal la inundan.\nSon recuerdos tangibles: una piel que pudo tocar, una mirada que fue real, un vínculo que, aunque físico, la dejó vulnerable y a la deriva. El silencio del desierto se quiebra con el rugido de un motor. Un Rolls-Royce se desliza por el horizonte como un espejismo de metal. Al\ndetenerse, de él desciende una figura cuya esencia desafía la lógica; no es un ser humano, es una presencia fuera de este mundo. Sin mediar palabra, este guía espiritual la levanta del polvo y la traslada a un refugio seguro, lejos del abandono.\nEn ese santuario, Rosalía experimenta una metamorfosis. \n\nLogra conectar finalmente con un amor espiritual, una fuerza superior que trasciende la carne y los recuerdos del pasado.\nComprende que, para nacer de nuevo, debe destruir el último rastro de su antigua vida.\nCon una determinación absoluta, prende fuego al Rolls-Royce. Mientras las llamas devoran el símbolo del lujo y el ego, Rosalía no solo observa el incendio: utiliza el calor de esa destrucción para encender su propia luz interna, una llama que ya nada ni nadie podrá apagar.",
                    "author": "@raycrq",
                    "likes": 330,
                    "publishedAt": "2026-02-11T20:21:33Z"
                },
                {
                    "text": "The beauty of this album makes my heart explode",
                    "author": "@MarinaAndTheDevil",
                    "likes": 538,
                    "publishedAt": "2026-02-11T17:07:31Z"
                },
                {
                    "text": "La Yugular sería visualmente impactante si usa todas esas cosas que menciona. ❤❤.",
                    "author": "@rafaelrivera364",
                    "likes": 587,
                    "publishedAt": "2026-02-09T21:33:29Z"
                },
                {
                    "text": "Estamos todos???? 🥂🎥🤍🤍",
                    "author": "@LaRosaliaFans",
                    "likes": 1082,
                    "publishedAt": "2026-02-11T16:34:46Z"
                },
                {
                    "text": "Who else expected La Rumba Del Perdón to immediately start playing at the end? 🤣💿✨",
                    "author": "@ItsRichieT",
                    "likes": 169,
                    "publishedAt": "2026-02-11T17:39:00Z"
                },
                {
                    "text": "She got to be to the next half time show of the Superbowl ❤‍🔥",
                    "author": "@Ismael-u1x8v",
                    "likes": 348,
                    "publishedAt": "2026-02-11T17:34:34Z"
                },
                {
                    "text": "International Rosalía fans, unite",
                    "author": "@jessiestoykova",
                    "likes": 335,
                    "publishedAt": "2026-02-11T16:38:18Z"
                },
                {
                    "text": "Es mi canción favorita de este disco. Es preciosa y muy pura. ¡Mucho amor desde Taiwán! Estoy aprendiendo español por Rosalía. LUX me inspiró a estudiar este idioma.",
                    "author": "@jyunn2604",
                    "likes": 485,
                    "publishedAt": "2026-02-11T16:03:35Z"
                },
                {
                    "text": "Ella se sentia bien con esa persona y de pronto la abandona en medio de la nada, dios es el que la carga y llega a salvarla de esa situación 🤍",
                    "author": "@IranCarolinaHernandezPaz",
                    "likes": 360,
                    "publishedAt": "2026-02-11T17:11:55Z"
                },
                {
                    "text": "Cada vez que alguien me da un like vuelvo a escuchar esta joya🎉",
                    "author": "@IsselAlonso",
                    "likes": 2,
                    "publishedAt": "2026-02-12T00:10:50Z"
                },
                {
                    "text": "Qué hermosa ella y qué hermoso todo esto. Me llegó al corazón.",
                    "author": "@tonyrosamusic",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:44:40Z"
                },
                {
                    "text": "Necesitamos video de 'reliquia '😢",
                    "author": "@BlastLlanos",
                    "likes": 172,
                    "publishedAt": "2026-02-10T05:28:43Z"
                },
                {
                    "text": "NO SOY UNA SANTA PERO CON LUX ESTOY BLESSED 💫",
                    "author": "@vitorkauan3245",
                    "likes": 73,
                    "publishedAt": "2026-02-11T17:02:16Z"
                },
                {
                    "text": "Hoy mi mamá hubiera cumplido 43 años, y esta es mi canción favorita de LUX, el hecho de que le haya sacado video clip se siente como un abrazo 🤍",
                    "author": "@NicolasBenitez-kh9lo",
                    "likes": 138,
                    "publishedAt": "2026-02-11T17:25:40Z"
                },
                {
                    "text": "My interpretation: Watching it, I felt like it visually deepens everything the lyrics suggest about detachment and transformation. The desert setting immediately struck me as a space of stripping away, no distractions, no luxury, just exposure. Seeing her lying on the ground, almost as if fallen or emptied out, contrasted so strongly with the sensual, glamorous scenes inside the car. That back-and-forth feels intentional: wealth and intimacy on one side, dust and vulnerability on the other. The lover is never shown, which to me makes it less about a specific person and more about presence… something unseen that lifts her but doesn’t overshadow her. And when the car burns, echoing the line about lighting her light with the Rolls-Royce she’ll set on fire, it feels like a chosen renunciation rather than a tragedy. By the end, when she stands calmly watching it burn, there’s no panic, only a sense of peace. It doesn’t feel like a breakup story; it feels like freedom arriving precisely when there’s nothing left to lose, when love becomes the only real capital. Also in the part she sings “tu amor será mi capital…” knowing she wrote this lyrics inspired in St Teresa de Àvila I cannot but hear something about how Teresa used to call her greatest lover: “Mi Capitán!” It is so close…. Looove this album so much!!! ❤",
                    "author": "@bruno_amor",
                    "likes": 55,
                    "publishedAt": "2026-02-11T17:28:43Z"
                },
                {
                    "text": "Simplemente preciosa y la canción también 🤍",
                    "author": "@ToniMendozaMusic",
                    "likes": 1,
                    "publishedAt": "2026-02-12T00:39:33Z"
                },
                {
                    "text": "Sauvignon Blanc habla de abandonar todo lo que tenemos para poder amar a alguien. Está inspirada en esa idea de dejarlo todo para seguir a Dios y entregarnos a Él, sin aferrarnos a lo material. Rosalía lo expresa de una forma más romántica, pero el trasfondo se siente más profundo, casi espiritual.\nEl video refuerza esto, hace alusión a Jesús en el desierto, salvando o guiando a otros. Ese “ser invisible” que conduce el auto y llega hasta donde Rosalía está inmóvil en el suelo y la levanta puede interpretarse como una presencia divina que la rescata.\nLa letra funciona como ese espejo de entrega total por amor, con frases como: “No tengo miedo del pasado… a tu lado mi futuro será dorado”, que transmiten confianza absoluta y fe.",
                    "author": "@brunorivvt",
                    "likes": 1730,
                    "publishedAt": "2026-02-11T17:12:07Z"
                },
                {
                    "text": "ALBÜM OF THE YEAR (greetings from Türkiye!",
                    "author": "@eiji7713",
                    "likes": 47,
                    "publishedAt": "2026-02-11T17:27:55Z"
                },
                {
                    "text": "AQUI LOS QUE QUIEREN QUE EL SIGUIENTE SEA DIOS ES UN STALKER 👇🏻🙇🏻‍♀️",
                    "author": "@kristalineclair",
                    "likes": 3,
                    "publishedAt": "2026-02-11T23:16:22Z"
                },
                {
                    "text": "ok period",
                    "author": "@plznta",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:42:32Z"
                },
                {
                    "text": "Necesitamos el video De Dios es un Stalker o Reliquia 😋",
                    "author": "@estebanramirez6285",
                    "likes": 33,
                    "publishedAt": "2026-02-11T18:15:34Z"
                },
                {
                    "text": "Un álbum con belleza, un álbum lleno de luz en un mundo oscuro. 🍷🤍",
                    "author": "@Afanador02",
                    "likes": 95,
                    "publishedAt": "2026-02-11T16:26:58Z"
                },
                {
                    "text": "En los peores momentos de la vida SIEMPRE hay alguien que te rescata y te lleva a la felicidad. Fue precioso ❤",
                    "author": "@stockcillo12",
                    "likes": 34,
                    "publishedAt": "2026-02-11T17:08:22Z"
                },
                {
                    "text": "Que hayan vídeoclips de La Yugular, Reliquia y Magnolias todos los necesitamos por favooooooor 🤩🤩🤩🤩",
                    "author": "@bernalcamachomiguelangel6105",
                    "likes": 32,
                    "publishedAt": "2026-02-11T17:13:35Z"
                },
                {
                    "text": "perfectaaaaa💞💞💞💞como vuela la niñaaa",
                    "author": "@pablonacarino1",
                    "likes": 1,
                    "publishedAt": "2026-02-11T18:29:58Z"
                },
                {
                    "text": "Precioso!! ❤",
                    "author": "@ursinafitipaldi",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:43:41Z"
                },
                {
                    "text": "Video de Divinize y Magnolias!!! Por favor",
                    "author": "@Lilybethbc",
                    "likes": 57,
                    "publishedAt": "2026-02-09T21:57:45Z"
                },
                {
                    "text": "Esta canción me hace recordar lo que siento y me hace proyectar al futuro con mi mentalidad y de no tener miedo de nada 0:53",
                    "author": "@isa.natali",
                    "likes": 17,
                    "publishedAt": "2026-02-11T18:49:57Z"
                },
                {
                    "text": "que satisfactorio se siente cuando Dios la levanta y la lleva sin miedo",
                    "author": "@A01-h8f",
                    "likes": 21,
                    "publishedAt": "2026-02-11T18:14:33Z"
                },
                {
                    "text": "Magnolias igual necesita un vídeo esa canción es muy hermosa",
                    "author": "@wilmcqueen1447",
                    "likes": 2,
                    "publishedAt": "2026-02-12T00:11:19Z"
                },
                {
                    "text": "Jaw dropped con esa escena levantándola del suelo. Lo increíble que es esta persona? flipante.",
                    "author": "@Jorj_404",
                    "likes": 2,
                    "publishedAt": "2026-02-11T18:54:45Z"
                },
                {
                    "text": "LO GUAPA QUE ESTA PORFAVORRR ❤❤",
                    "author": "@130719641",
                    "likes": 45,
                    "publishedAt": "2026-02-11T17:10:02Z"
                },
                {
                    "text": "Pero se puede ser más bella? ❤❤❤❤ y la elegancia y lo que transmite …. Nadie como ella 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽",
                    "author": "@ANGELPL5148",
                    "likes": 5,
                    "publishedAt": "2026-02-11T18:52:00Z"
                },
                {
                    "text": "Aquí en este video es tan parecida a Penélope a finales de los 90s",
                    "author": "@beltranfrances4768",
                    "likes": 5,
                    "publishedAt": "2026-02-11T18:25:02Z"
                },
                {
                    "text": "Dios es un stalker próximo porfa o el que sea me encanta LUX",
                    "author": "@Coconete2306",
                    "likes": 34,
                    "publishedAt": "2026-02-11T17:36:05Z"
                },
                {
                    "text": "Damn, especially justo lo que pienso es mi salvador. Lo veo como uno mismo es su propio salvador.",
                    "author": "@SanthiagoHH",
                    "likes": 0,
                    "publishedAt": "2026-02-11T18:56:25Z"
                },
                {
                    "text": "I need Reliquia music video too please 🙏",
                    "author": "@NizarNoor",
                    "likes": 72,
                    "publishedAt": "2026-02-10T08:56:35Z"
                },
                {
                    "text": "La voz de Rosalía atraviesa las entrañas y llega al alma ❤",
                    "author": "@npf2163",
                    "likes": 8,
                    "publishedAt": "2026-02-11T20:58:35Z"
                },
                {
                    "text": "Graba el videoclip de De Madrugá esta Semana Santa en Sevilla vestida de mantilla",
                    "author": "@franmontoro_",
                    "likes": 0,
                    "publishedAt": "2026-02-11T17:54:30Z"
                },
                {
                    "text": "Estoy viendo varias interpretaciones del vídeo y eso es muy bello por qué eso es arte 😍.\n\nDesde mi perspectiva, considero que la canción se la dedica a sí misma, y sí, también al deshacerse de todo lo material ella logra cierta \"elevación\" o \"vibración\" espiritual, por eso esa \"Divinidad\" ahora la toma en sus brazos, ella ya se encuentra en otro \"nivel de conciencia\" que es el amor propio, y se da cuenta que no necesita lo material para amarse, sí no solo ella misma, y su mera existencia... 🥹🫶🏻",
                    "author": "@victoramaya168",
                    "likes": 0,
                    "publishedAt": "2026-02-11T19:36:17Z"
                },
                {
                    "text": "Todo lo que representa el coche , todo lo que tenía dentro de el y que la dejó herida y abandonada en medio de la nada,lo hace saltar por lo aires... La han rescatado y todo lo anterior lo estimó pérdida y basura",
                    "author": "@dianafernandezperez4602",
                    "likes": 25,
                    "publishedAt": "2026-02-11T18:56:53Z"
                },
                {
                    "text": "Ahhh la escena en la que es cargada por una presencia invisible, uff, lloree, hermoso vida, Rosalia elegancia y guapura pura",
                    "author": "@simonemontiel816",
                    "likes": 3,
                    "publishedAt": "2026-02-11T22:29:05Z"
                },
                {
                    "text": "This is, to me, the most beautiful song of the entire album it deserved a music video soooo bad and the video is absolutely astonishingly beautiful",
                    "author": "@landryzxx",
                    "likes": 38,
                    "publishedAt": "2026-02-11T17:06:34Z"
                },
                {
                    "text": "este video se escapó del museo",
                    "author": "@YouTubeLatam",
                    "likes": 2,
                    "publishedAt": "2026-02-12T00:06:15Z"
                },
                {
                    "text": "Grité!! 🔥🔥🔥🔥😍😍😍😍🥹🥹🥹🥹🤌🔝🔝🔝🔝",
                    "author": "@Rapunzelitah1",
                    "likes": 0,
                    "publishedAt": "2026-02-11T17:40:10Z"
                },
                {
                    "text": "El vídeo es simple, pero supera el de la perla, o me equivoco?",
                    "author": "@rosalialyricslux",
                    "likes": 44,
                    "publishedAt": "2026-02-11T17:10:40Z"
                },
                {
                    "text": "La mejor canción del album, Sauvignon Blanc y al final quemo el Rolls-Royce como menciona la letra, me encanta lo que transmite me hace sentir identificado, Dios bendiga siempre a nuestra Rosalía❤️",
                    "author": "@iamHorizon24",
                    "likes": 14,
                    "publishedAt": "2026-02-11T17:31:34Z"
                },
                {
                    "text": "QUE ALGUIEN ME EXPLIQUE PORQUE TODO LO QUE HACE ROSI ES TAN PERFECTO",
                    "author": "@alirioalvarez1188",
                    "likes": 24,
                    "publishedAt": "2026-02-11T17:07:31Z"
                },
                {
                    "text": "No puedo parar de llorar con esta canción pffff joder",
                    "author": "@IamhugoGarciA",
                    "likes": 0,
                    "publishedAt": "2026-02-11T19:34:59Z"
                },
                {
                    "text": "Esa es la idea, dejarlo todo atrás. Bonita canción y bonito video.",
                    "author": "@Julipato-e5b",
                    "likes": 0,
                    "publishedAt": "2026-02-11T20:01:05Z"
                },
                {
                    "text": "Recordar la posibilidad de ser amado y haber amado, de volver a lo que por un momento nos rescato, algo que después de vuelve olvido, que dejas, que quema. Es verse de frente vulnerable, pero fuerte, porque no necesitas ser rescatado por nadie, nada màs que por uno mismo, allí también se encuentra y se pierde el amor. ¡Dios salve a la Rosalía!",
                    "author": "@hectorarchilajr5525",
                    "likes": 18,
                    "publishedAt": "2026-02-11T17:49:40Z"
                },
                {
                    "text": "Sauvignon Blanc es increíblemente hermosa, ojalá la siguiente sea Reliquia, sería totalmente legendario 💫🤍",
                    "author": "@Alearias_ohbl",
                    "likes": 10,
                    "publishedAt": "2026-02-11T18:39:00Z"
                },
                {
                    "text": "ESTO ES MINIMALISMO PURO, increíble ! 🎉🎉🎉🎉 ❤ chapo!  Alguien que por fin entiende transmitir, con fotografía y perspectiva. Bobos los que critican no entienden NADA.",
                    "author": "@vivianacarolinanavaochoa5743",
                    "likes": 18,
                    "publishedAt": "2026-02-11T17:24:27Z"
                },
                {
                    "text": "Hermosisimooo. Parece Neuquén el paisaje del fondo",
                    "author": "@luciakleinesamson710",
                    "likes": 0,
                    "publishedAt": "2026-02-11T20:22:41Z"
                },
                {
                    "text": "Este tema va directo al alma, gracias Dios por estar siempre conmigo ❤",
                    "author": "@cecilialopresti9145",
                    "likes": 0,
                    "publishedAt": "2026-02-11T22:38:22Z"
                },
                {
                    "text": "Aquí antes del millón like 0:25 ???",
                    "author": "@IsselAlonso",
                    "likes": 51,
                    "publishedAt": "2026-02-11T17:29:46Z"
                },
                {
                    "text": "Una caricia al corazón… la escucharé cada vez que le den ❤ gracias Rosalía, por esta flor",
                    "author": "@JaimeCarrera-q3y",
                    "likes": 11,
                    "publishedAt": "2026-02-11T18:03:13Z"
                },
                {
                    "text": "Joder; ¡QUÉ PRECIOSIDAD!",
                    "author": "@LEO-v6u4f",
                    "likes": 14,
                    "publishedAt": "2026-02-11T18:05:02Z"
                },
                {
                    "text": "Yo nunca regalaré mi piano de pared. 🎼❤️🎹",
                    "author": "@stephanieperez6640",
                    "likes": 0,
                    "publishedAt": "2026-02-11T20:32:41Z"
                },
                {
                    "text": "Guardé mi copa de vino para este momento... ♥",
                    "author": "@Akari86-86",
                    "likes": 1,
                    "publishedAt": "2026-02-12T00:18:45Z"
                },
                {
                    "text": "Mi futuro se bien que será dorado 🫶",
                    "author": "@ldrxhoney",
                    "likes": 27,
                    "publishedAt": "2026-02-09T22:41:57Z"
                },
                {
                    "text": "Rosalia, eres increíble.",
                    "author": "@ferrandonat8971",
                    "likes": 11,
                    "publishedAt": "2026-02-09T21:16:14Z"
                },
                {
                    "text": "Sauvignon Blanc como nuevo single y con video y de repente la vida tomó sentido ✨💆🏻‍♂️",
                    "author": "@wilfransuarez5784",
                    "likes": 12,
                    "publishedAt": "2026-02-11T17:24:34Z"
                },
                {
                    "text": "Hermosa representación de lo que es ser salvado y entregarlo todo sin pensar en el pasado ❤",
                    "author": "@angelsequera1",
                    "likes": 2,
                    "publishedAt": "2026-02-11T20:06:01Z"
                },
                {
                    "text": "te amo rosalia quiero un savignon blanc a tu lado",
                    "author": "@labellezaperdida",
                    "likes": 0,
                    "publishedAt": "2026-02-11T19:26:40Z"
                },
                {
                    "text": "Cuántos apoyan a la Rosalía antes del millón aquí 👇",
                    "author": "@IsselAlonso",
                    "likes": 15,
                    "publishedAt": "2026-02-11T17:23:04Z"
                },
                {
                    "text": "Aun no supero la Perla y viene con estaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa🥲",
                    "author": "@genskye2",
                    "likes": 3,
                    "publishedAt": "2026-02-11T18:10:45Z"
                },
                {
                    "text": "Siempre te voy a decir lo mismo, gracias … nos regalas tanta belleza , poesía e inspiración. Tus obras nos sanan y embellecen este mundo .",
                    "author": "@gabrielasofiamartin669",
                    "likes": 14,
                    "publishedAt": "2026-02-11T18:17:08Z"
                },
                {
                    "text": "La más hermosa canción ever❤❤❤",
                    "author": "@paolarodriguezmartinez587",
                    "likes": 0,
                    "publishedAt": "2026-02-11T19:20:43Z"
                },
                {
                    "text": "Soy yo quíen la carga y le da su futuro dorado❤",
                    "author": "@danilLinaresblanco-z9j",
                    "likes": 0,
                    "publishedAt": "2026-02-11T17:31:58Z"
                },
                {
                    "text": "Cuando he visto el Roll Roice y pensado, lo quema!!",
                    "author": "@09luisen",
                    "likes": 12,
                    "publishedAt": "2026-02-11T17:18:57Z"
                },
                {
                    "text": "Esta canción y el video con ella es una carta de amor a Dios, es la desapropiacion de todo lo material para juntarnos con lo divino y lo espiritual, esto Rosi lo ha dicho en varias entrevistas, cuando dice “ya no quiero perlas ni caviar tu amor sera mi capital” “que mas da si te tengo a ti no necesito nada mas”. \nEs Perfecta",
                    "author": "@laurafernandez7819",
                    "likes": 18,
                    "publishedAt": "2026-02-11T19:52:27Z"
                },
                {
                    "text": "Album of the century 🤍✨",
                    "author": "@reamdelrey",
                    "likes": 39,
                    "publishedAt": "2026-02-09T21:18:43Z"
                },
                {
                    "text": "Lo amee!!! 😮😮😮❤ ahora necesito el videoclip de Dios es un stalker ❤",
                    "author": "@Eduflor_es",
                    "likes": 0,
                    "publishedAt": "2026-02-11T19:16:12Z"
                },
                {
                    "text": "We need La Rumba Del Perdon next Rosa 🙏🙏",
                    "author": "@unbotheredguy22",
                    "likes": 3,
                    "publishedAt": "2026-02-11T19:27:15Z"
                },
                {
                    "text": "Te vas a ganar el Grammy 2027 ❤❤",
                    "author": "@salomeh1446",
                    "likes": 73,
                    "publishedAt": "2026-02-11T18:41:04Z"
                },
                {
                    "text": "Estamos todos aquí verdad",
                    "author": "@JoséLuísOrtuño-l3b",
                    "likes": 4,
                    "publishedAt": "2026-02-11T18:15:20Z"
                },
                {
                    "text": "Rosalía deberías hacer más flamenco gitaneo y tangos con esa voz que es oro como hace 7 años nena ❤🎉🎉🎉🎉🎉🎉 tu eres arte 🎭",
                    "author": "@javsross-k1u",
                    "likes": 0,
                    "publishedAt": "2026-02-11T18:08:03Z"
                },
                {
                    "text": "Quiero volver amar asi mismo de la manera q esta cancion me hace sentir",
                    "author": "@PerlaMunoz-i4q",
                    "likes": 2,
                    "publishedAt": "2026-02-11T21:08:16Z"
                },
                {
                    "text": "Una canción sobre el minimalismo del amor, justo la tarde que estoy empezando a deshacerme de cosas en mi piso,.. Y eso quizá me lleve a tener la paz mental que necesito para la relación que estoy empezando a la que quizá espero poder decirle lo mismo que esta canción. Otra maravilla de este disco.",
                    "author": "@tiparracofino-i9e",
                    "likes": 5,
                    "publishedAt": "2026-02-11T18:52:21Z"
                },
                {
                    "text": "me encanta la voz de ROSALÍA ❤",
                    "author": "@-Saijo.Juri.",
                    "likes": 3,
                    "publishedAt": "2026-02-11T22:29:22Z"
                },
                {
                    "text": "Falta Porcelana ❤️‍🩹😭😭",
                    "author": "@nellyarreola191",
                    "likes": 19,
                    "publishedAt": "2026-02-09T21:54:32Z"
                },
                {
                    "text": "Cuando Dios ve, te levanta, te sostiene y te aparta de lo malo . ❤",
                    "author": "@TopMussica",
                    "likes": 0,
                    "publishedAt": "2026-02-11T18:37:36Z"
                },
                {
                    "text": "Esa voz de Rosalia no para de erizar la piel de todos ❤",
                    "author": "@leito4ngel",
                    "likes": 1,
                    "publishedAt": "2026-02-11T20:29:58Z"
                },
                {
                    "text": "Cuando empieza \"tu y tu compadre\"",
                    "author": "@thianruizz",
                    "likes": 15,
                    "publishedAt": "2026-02-11T17:05:32Z"
                },
                {
                    "text": "QUE LE SAQUE VIDEO A PORCELANA PLIS😭",
                    "author": "@BrandonFelipeRodriguezMend-l3v",
                    "likes": 5,
                    "publishedAt": "2026-02-09T20:40:41Z"
                },
                {
                    "text": "Dale Rosi. Estamos con la copa en la mano",
                    "author": "@HugoLealMusic",
                    "likes": 5,
                    "publishedAt": "2026-02-10T00:42:56Z"
                },
                {
                    "text": "Te amo mucho mucho mi Rosalía hermosa 💜 amo todo lo que haces 💜",
                    "author": "@ChristianUgalde-y8t",
                    "likes": 0,
                    "publishedAt": "2026-02-11T17:51:32Z"
                },
                {
                    "text": "El video no está a la altura de la canción... pero que más da, la canción es tan hermosa  que no precisa nada mas.",
                    "author": "@letramos998",
                    "likes": 0,
                    "publishedAt": "2026-02-11T18:28:37Z"
                },
                {
                    "text": "She is lost in the dessert (life) because of the luxury she had in her life that is why the dress and pearls, then she gets saved by a invisible divine power and ends up lighting up her Rolce Royce as a symbol of change in her habits.",
                    "author": "@Lorelorelorelerolorelorelo",
                    "likes": 9,
                    "publishedAt": "2026-02-11T20:50:58Z"
                },
                {
                    "text": "Este disco es místico. Soy afortunado de vivir en la misma época que Rosalía.",
                    "author": "@Tatseryu27",
                    "likes": 7,
                    "publishedAt": "2026-02-11T17:00:23Z"
                },
                {
                    "text": "We love you Rosalia from Ecuador. 🇪🇨",
                    "author": "@Bmt4l2t",
                    "likes": 11,
                    "publishedAt": "2026-02-09T20:55:16Z"
                },
                {
                    "text": "Me emocioné gracias por darnos esta obra de arte estrella mundial ✨✨✨✨",
                    "author": "@CristiansebastianDonato",
                    "likes": 0,
                    "publishedAt": "2026-02-11T18:07:05Z"
                },
                {
                    "text": "Hasta las lagrimas ❤ te amo Rosa",
                    "author": "@AnaLauraGauna",
                    "likes": 0,
                    "publishedAt": "2026-02-11T17:59:51Z"
                },
                {
                    "text": "Aún no sale completo y ya se siente la intención, el silencio, la imagen y el peso artístico. Digan lo que digan, esto va a ser una obra maestra, todo apunta a algo grande y profundamente cuidado 🎬✨🤍",
                    "author": "@pablopicaso9170",
                    "likes": 8,
                    "publishedAt": "2026-02-10T00:40:53Z"
                },
                {
                    "text": "La canción que quiero escuchar en un balcón tomando una copa de Sauvignon Blanc acompañado de esa persona cuando la encuentre, en la noche.",
                    "author": "@saturno.efimero",
                    "likes": 16,
                    "publishedAt": "2026-02-11T17:33:40Z"
                }
            ]
        },
        {
            "fetchedAt": "20260212_005159",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Necesitamos que todas las canciones del album tengan video",
                    "author": "@KevinEspinal-b7o",
                    "likes": 1569,
                    "publishedAt": "2026-02-11T15:17:23Z"
                },
                {
                    "text": "AQUI LOS QUE QUIEREN QUE EL SIGUIENTE SEA LA YUGULAR 👇",
                    "author": "@EstebanTamayorivas",
                    "likes": 2070,
                    "publishedAt": "2026-02-11T17:05:49Z"
                },
                {
                    "text": "Aquí los que estuvieron antes de que salga 👇❤\n(Te amo rosi gracias por sacar un videoclip de mi cancion fav de lux)",
                    "author": "@GaelParisi",
                    "likes": 1050,
                    "publishedAt": "2026-02-09T20:58:53Z"
                },
                {
                    "text": "Alguien más siente que el chico del video se parece a Emilio Sakraya?",
                    "author": "@michelleyanez6021",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:48:29Z"
                },
                {
                    "text": "HOW MANY INTERNATIONAL FANS ARE HERE???",
                    "author": "@ryannnnn.nn9",
                    "likes": 367,
                    "publishedAt": "2026-02-11T18:50:30Z"
                },
                {
                    "text": "The beauty of this album makes my heart explode",
                    "author": "@MarinaAndTheDevil",
                    "likes": 539,
                    "publishedAt": "2026-02-11T17:07:31Z"
                },
                {
                    "text": "La Yugular sería visualmente impactante si usa todas esas cosas que menciona. ❤❤.",
                    "author": "@rafaelrivera364",
                    "likes": 588,
                    "publishedAt": "2026-02-09T21:33:29Z"
                },
                {
                    "text": "Estamos todos???? 🥂🎥🤍🤍",
                    "author": "@LaRosaliaFans",
                    "likes": 1083,
                    "publishedAt": "2026-02-11T16:34:46Z"
                },
                {
                    "text": "Esto es una interpretación libre, pero creo que quiere darnos a entender esto:\n\nRosalía yace sobre la arena implacable del desierto. Su cuerpo no apareció allí por azar; fue desechada, arrojada al vacío por manos anónimas. Mientras el calor la consume y su rostro roza el suelo, los fragmentos de un amor terrenal la inundan.\nSon recuerdos tangibles: una piel que pudo tocar, una mirada que fue real, un vínculo que, aunque físico, la dejó vulnerable y a la deriva. El silencio del desierto se quiebra con el rugido de un motor. Un Rolls-Royce se desliza por el horizonte como un espejismo de metal. Al\ndetenerse, de él desciende una figura cuya esencia desafía la lógica; no es un ser humano, es una presencia fuera de este mundo. Sin mediar palabra, este guía espiritual la levanta del polvo y la traslada a un refugio seguro, lejos del abandono.\nEn ese santuario, Rosalía experimenta una metamorfosis. \n\nLogra conectar finalmente con un amor espiritual, una fuerza superior que trasciende la carne y los recuerdos del pasado.\nComprende que, para nacer de nuevo, debe destruir el último rastro de su antigua vida.\nCon una determinación absoluta, prende fuego al Rolls-Royce. Mientras las llamas devoran el símbolo del lujo y el ego, Rosalía no solo observa el incendio: utiliza el calor de esa destrucción para encender su propia luz interna, una llama que ya nada ni nadie podrá apagar.",
                    "author": "@raycrq",
                    "likes": 334,
                    "publishedAt": "2026-02-11T20:21:33Z"
                },
                {
                    "text": "Who else expected La Rumba Del Perdón to immediately start playing at the end? 🤣💿✨",
                    "author": "@ItsRichieT",
                    "likes": 172,
                    "publishedAt": "2026-02-11T17:39:00Z"
                },
                {
                    "text": "International Rosalía fans, unite",
                    "author": "@jessiestoykova",
                    "likes": 335,
                    "publishedAt": "2026-02-11T16:38:18Z"
                },
                {
                    "text": "Es mi canción favorita de este disco. Es preciosa y muy pura. ¡Mucho amor desde Taiwán! Estoy aprendiendo español por Rosalía. LUX me inspiró a estudiar este idioma.",
                    "author": "@jyunn2604",
                    "likes": 488,
                    "publishedAt": "2026-02-11T16:03:35Z"
                },
                {
                    "text": "Ella se sentia bien con esa persona y de pronto la abandona en medio de la nada, dios es el que la carga y llega a salvarla de esa situación 🤍",
                    "author": "@IranCarolinaHernandezPaz",
                    "likes": 360,
                    "publishedAt": "2026-02-11T17:11:55Z"
                },
                {
                    "text": "im a filipino and im here to say that rosalia will win album of the year next year. thank you.",
                    "author": "@sebwolfmusic",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:50:55Z"
                },
                {
                    "text": "She got to be to the next half time show of the Superbowl ❤‍🔥",
                    "author": "@Ismael-u1x8v",
                    "likes": 349,
                    "publishedAt": "2026-02-11T17:34:34Z"
                },
                {
                    "text": "Necesitamos video de 'reliquia '😢",
                    "author": "@BlastLlanos",
                    "likes": 172,
                    "publishedAt": "2026-02-10T05:28:43Z"
                },
                {
                    "text": "NO SOY UNA SANTA PERO CON LUX ESTOY BLESSED 💫",
                    "author": "@vitorkauan3245",
                    "likes": 74,
                    "publishedAt": "2026-02-11T17:02:16Z"
                },
                {
                    "text": "Hoy mi mamá hubiera cumplido 43 años, y esta es mi canción favorita de LUX, el hecho de que le haya sacado video clip se siente como un abrazo 🤍",
                    "author": "@NicolasBenitez-kh9lo",
                    "likes": 138,
                    "publishedAt": "2026-02-11T17:25:40Z"
                },
                {
                    "text": "Lux é um dos melhores álbuns que já ouvi e com uma excelência e riqueza que faz dele um dos melhores álbuns já feitos na história e merece todos os prêmios possíveis!",
                    "author": "@NilsonVersace",
                    "likes": 1,
                    "publishedAt": "2026-02-12T00:49:12Z"
                },
                {
                    "text": "Cada vez que alguien me da un like vuelvo a escuchar esta joya🎉",
                    "author": "@IsselAlonso",
                    "likes": 2,
                    "publishedAt": "2026-02-12T00:10:50Z"
                },
                {
                    "text": "Sauvignon Blanc habla de abandonar todo lo que tenemos para poder amar a alguien. Está inspirada en esa idea de dejarlo todo para seguir a Dios y entregarnos a Él, sin aferrarnos a lo material. Rosalía lo expresa de una forma más romántica, pero el trasfondo se siente más profundo, casi espiritual.\nEl video refuerza esto, hace alusión a Jesús en el desierto, salvando o guiando a otros. Ese “ser invisible” que conduce el auto y llega hasta donde Rosalía está inmóvil en el suelo y la levanta puede interpretarse como una presencia divina que la rescata.\nLa letra funciona como ese espejo de entrega total por amor, con frases como: “No tengo miedo del pasado… a tu lado mi futuro será dorado”, que transmiten confianza absoluta y fe.",
                    "author": "@brunorivvt",
                    "likes": 1740,
                    "publishedAt": "2026-02-11T17:12:07Z"
                },
                {
                    "text": "ALBÜM OF THE YEAR (greetings from Türkiye!",
                    "author": "@eiji7713",
                    "likes": 47,
                    "publishedAt": "2026-02-11T17:27:55Z"
                },
                {
                    "text": "My interpretation: Watching it, I felt like it visually deepens everything the lyrics suggest about detachment and transformation. The desert setting immediately struck me as a space of stripping away, no distractions, no luxury, just exposure. Seeing her lying on the ground, almost as if fallen or emptied out, contrasted so strongly with the sensual, glamorous scenes inside the car. That back-and-forth feels intentional: wealth and intimacy on one side, dust and vulnerability on the other. The lover is never shown, which to me makes it less about a specific person and more about presence… something unseen that lifts her but doesn’t overshadow her. And when the car burns, echoing the line about lighting her light with the Rolls-Royce she’ll set on fire, it feels like a chosen renunciation rather than a tragedy. By the end, when she stands calmly watching it burn, there’s no panic, only a sense of peace. It doesn’t feel like a breakup story; it feels like freedom arriving precisely when there’s nothing left to lose, when love becomes the only real capital. Also in the part she sings “tu amor será mi capital…” knowing she wrote this lyrics inspired in St Teresa de Àvila I cannot but hear something about how Teresa used to call her greatest lover: “Mi Capitán!” It is so close…. Looove this album so much!!! ❤",
                    "author": "@bruno_amor",
                    "likes": 55,
                    "publishedAt": "2026-02-11T17:28:43Z"
                },
                {
                    "text": "Tão doce e suave. Essa musica tem um toque diferente, uma energia palpável, um sentimento visceral. Amei todo o visual ❤❤",
                    "author": "@mateus2407",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:50:21Z"
                },
                {
                    "text": "Paz, chill amor romance",
                    "author": "@micarigazzi",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:49:10Z"
                }
            ]
        },
        {
            "fetchedAt": "20260212_005547",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Necesitamos que todas las canciones del album tengan video",
                    "author": "@KevinEspinal-b7o",
                    "likes": 1574,
                    "publishedAt": "2026-02-11T15:17:23Z"
                },
                {
                    "text": "AQUI LOS QUE QUIEREN QUE EL SIGUIENTE SEA LA YUGULAR 👇",
                    "author": "@EstebanTamayorivas",
                    "likes": 2071,
                    "publishedAt": "2026-02-11T17:05:49Z"
                },
                {
                    "text": "Aquí los que estuvieron antes de que salga 👇❤\n(Te amo rosi gracias por sacar un videoclip de mi cancion fav de lux)",
                    "author": "@GaelParisi",
                    "likes": 1050,
                    "publishedAt": "2026-02-09T20:58:53Z"
                },
                {
                    "text": "HOW MANY INTERNATIONAL FANS ARE HERE???",
                    "author": "@ryannnnn.nn9",
                    "likes": 369,
                    "publishedAt": "2026-02-11T18:50:30Z"
                },
                {
                    "text": "Esto es una interpretación libre, pero creo que quiere darnos a entender esto:\n\nRosalía yace sobre la arena implacable del desierto. Su cuerpo no apareció allí por azar; fue desechada, arrojada al vacío por manos anónimas. Mientras el calor la consume y su rostro roza el suelo, los fragmentos de un amor terrenal la inundan.\nSon recuerdos tangibles: una piel que pudo tocar, una mirada que fue real, un vínculo que, aunque físico, la dejó vulnerable y a la deriva. El silencio del desierto se quiebra con el rugido de un motor. Un Rolls-Royce se desliza por el horizonte como un espejismo de metal. Al\ndetenerse, de él desciende una figura cuya esencia desafía la lógica; no es un ser humano, es una presencia fuera de este mundo. Sin mediar palabra, este guía espiritual la levanta del polvo y la traslada a un refugio seguro, lejos del abandono.\nEn ese santuario, Rosalía experimenta una metamorfosis. \n\nLogra conectar finalmente con un amor espiritual, una fuerza superior que trasciende la carne y los recuerdos del pasado.\nComprende que, para nacer de nuevo, debe destruir el último rastro de su antigua vida.\nCon una determinación absoluta, prende fuego al Rolls-Royce. Mientras las llamas devoran el símbolo del lujo y el ego, Rosalía no solo observa el incendio: utiliza el calor de esa destrucción para encender su propia luz interna, una llama que ya nada ni nadie podrá apagar.",
                    "author": "@raycrq",
                    "likes": 336,
                    "publishedAt": "2026-02-11T20:21:33Z"
                },
                {
                    "text": "The beauty of this album makes my heart explode",
                    "author": "@MarinaAndTheDevil",
                    "likes": 539,
                    "publishedAt": "2026-02-11T17:07:31Z"
                },
                {
                    "text": "La Yugular sería visualmente impactante si usa todas esas cosas que menciona. ❤❤.",
                    "author": "@rafaelrivera364",
                    "likes": 588,
                    "publishedAt": "2026-02-09T21:33:29Z"
                },
                {
                    "text": "Estamos todos???? 🥂🎥🤍🤍",
                    "author": "@LaRosaliaFans",
                    "likes": 1083,
                    "publishedAt": "2026-02-11T16:34:46Z"
                },
                {
                    "text": "Who else expected La Rumba Del Perdón to immediately start playing at the end? 🤣💿✨",
                    "author": "@ItsRichieT",
                    "likes": 172,
                    "publishedAt": "2026-02-11T17:39:00Z"
                },
                {
                    "text": "im a filipino and im here to say that rosalia will win album of the year next year. thank you.",
                    "author": "@sebwolfmusic",
                    "likes": 1,
                    "publishedAt": "2026-02-12T00:50:55Z"
                },
                {
                    "text": "International Rosalía fans, unite",
                    "author": "@jessiestoykova",
                    "likes": 335,
                    "publishedAt": "2026-02-11T16:38:18Z"
                },
                {
                    "text": "Es mi canción favorita de este disco. Es preciosa y muy pura. ¡Mucho amor desde Taiwán! Estoy aprendiendo español por Rosalía. LUX me inspiró a estudiar este idioma.",
                    "author": "@jyunn2604",
                    "likes": 488,
                    "publishedAt": "2026-02-11T16:03:35Z"
                },
                {
                    "text": "Ella se sentia bien con esa persona y de pronto la abandona en medio de la nada, dios es el que la carga y llega a salvarla de esa situación 🤍",
                    "author": "@IranCarolinaHernandezPaz",
                    "likes": 360,
                    "publishedAt": "2026-02-11T17:11:55Z"
                },
                {
                    "text": "Alguien más siente que el chico del video se parece a Emilio Sakraya?",
                    "author": "@michelleyanez6021",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:48:29Z"
                },
                {
                    "text": "Mi mente al terminar: Tú y tu compadre 💃",
                    "author": "@rodri681",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:52:05Z"
                },
                {
                    "text": "Necesitamos video de 'reliquia '😢",
                    "author": "@BlastLlanos",
                    "likes": 172,
                    "publishedAt": "2026-02-10T05:28:43Z"
                },
                {
                    "text": "She got to be to the next half time show of the Superbowl ❤‍🔥",
                    "author": "@Ismael-u1x8v",
                    "likes": 349,
                    "publishedAt": "2026-02-11T17:34:34Z"
                },
                {
                    "text": "NO SOY UNA SANTA PERO CON LUX ESTOY BLESSED 💫",
                    "author": "@vitorkauan3245",
                    "likes": 74,
                    "publishedAt": "2026-02-11T17:02:16Z"
                },
                {
                    "text": "Lux é um dos melhores álbuns que já ouvi e com uma excelência e riqueza que faz dele um dos melhores álbuns já feitos na história e merece todos os prêmios possíveis!",
                    "author": "@NilsonVersace",
                    "likes": 1,
                    "publishedAt": "2026-02-12T00:49:12Z"
                },
                {
                    "text": "My interpretation: Watching it, I felt like it visually deepens everything the lyrics suggest about detachment and transformation. The desert setting immediately struck me as a space of stripping away, no distractions, no luxury, just exposure. Seeing her lying on the ground, almost as if fallen or emptied out, contrasted so strongly with the sensual, glamorous scenes inside the car. That back-and-forth feels intentional: wealth and intimacy on one side, dust and vulnerability on the other. The lover is never shown, which to me makes it less about a specific person and more about presence… something unseen that lifts her but doesn’t overshadow her. And when the car burns, echoing the line about lighting her light with the Rolls-Royce she’ll set on fire, it feels like a chosen renunciation rather than a tragedy. By the end, when she stands calmly watching it burn, there’s no panic, only a sense of peace. It doesn’t feel like a breakup story; it feels like freedom arriving precisely when there’s nothing left to lose, when love becomes the only real capital. Also in the part she sings “tu amor será mi capital…” knowing she wrote this lyrics inspired in St Teresa de Àvila I cannot but hear something about how Teresa used to call her greatest lover: “Mi Capitán!” It is so close…. Looove this album so much!!! ❤",
                    "author": "@bruno_amor",
                    "likes": 55,
                    "publishedAt": "2026-02-11T17:28:43Z"
                },
                {
                    "text": "Hoy mi mamá hubiera cumplido 43 años, y esta es mi canción favorita de LUX, el hecho de que le haya sacado video clip se siente como un abrazo 🤍",
                    "author": "@NicolasBenitez-kh9lo",
                    "likes": 138,
                    "publishedAt": "2026-02-11T17:25:40Z"
                },
                {
                    "text": "Sauvignon Blanc habla de abandonar todo lo que tenemos para poder amar a alguien. Está inspirada en esa idea de dejarlo todo para seguir a Dios y entregarnos a Él, sin aferrarnos a lo material. Rosalía lo expresa de una forma más romántica, pero el trasfondo se siente más profundo, casi espiritual.\nEl video refuerza esto, hace alusión a Jesús en el desierto, salvando o guiando a otros. Ese “ser invisible” que conduce el auto y llega hasta donde Rosalía está inmóvil en el suelo y la levanta puede interpretarse como una presencia divina que la rescata.\nLa letra funciona como ese espejo de entrega total por amor, con frases como: “No tengo miedo del pasado… a tu lado mi futuro será dorado”, que transmiten confianza absoluta y fe.",
                    "author": "@brunorivvt",
                    "likes": 1747,
                    "publishedAt": "2026-02-11T17:12:07Z"
                },
                {
                    "text": "ALBÜM OF THE YEAR (greetings from Türkiye!",
                    "author": "@eiji7713",
                    "likes": 47,
                    "publishedAt": "2026-02-11T17:27:55Z"
                },
                {
                    "text": "I NEED MIO CRISTO MV PLS\nI NEED YOU TO HAVE A FULL OPERA ORCHESTRA IN HEAVEN WHILE WATCHING THE WORLD END BELOW YOU",
                    "author": "@sebwolfmusic",
                    "likes": 0,
                    "publishedAt": "2026-02-12T00:54:54Z"
                },
                {
                    "text": "perfectaaaaa💞💞💞💞como vuela la niñaaa",
                    "author": "@pablonacarino1",
                    "likes": 1,
                    "publishedAt": "2026-02-11T18:29:58Z"
                }
            ]
        }
    ]
}