{
    "videoId": "vbF62DXzKdU",
    "history": [
        {
            "fetchedAt": "20260214_085047",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Nice to see my favorite TCG is finally getting some love! But my God are these pre-order prices for FB09 out of control.",
                    "author": "@ShakaCollectsAZ",
                    "likes": 14,
                    "publishedAt": "2026-02-13T21:47:13Z"
                },
                {
                    "text": "Bought Son Goku, story of a forming wish alt art psa 10 for 7k usd!!!! Ya it’s expensive but I’m super happy because I don’t think it’ll be that low ever again! Has a 38 psa pop and there’s reports you have to buy around 100 BOXES to have a CHANCE at packing it! So gorgeous",
                    "author": "@jrdnLC",
                    "likes": 6,
                    "publishedAt": "2026-02-13T22:54:46Z"
                },
                {
                    "text": "I just started playing fusion world via the online client and im shocked at how much fun ive been having.. its lead me here. I would love to build some decks and attempt to play at local events...just unsure how healthy the playerbase is atm. Its such a fun tcg",
                    "author": "@StickyShoes34",
                    "likes": 0,
                    "publishedAt": "2026-02-14T08:28:48Z"
                },
                {
                    "text": "Awsome video like always, Love seeing more Dragonball Content. Working hard to get to this lvl.",
                    "author": "@CollectibleKhime",
                    "likes": 4,
                    "publishedAt": "2026-02-13T21:22:57Z"
                },
                {
                    "text": "I collect both. Both fusion world and master share the same back design, so although they are not compatible in terms of gameplay, they share the same intellectual property. Reminds me of Pokémon’s card and the e-reader variants.",
                    "author": "@TheNumberblocks35",
                    "likes": 0,
                    "publishedAt": "2026-02-14T04:43:17Z"
                },
                {
                    "text": "I've been finally watching DB Super and loving it. I feel good about getting some cards of this. Starting with Super versions of Videl and Android 18 😅. Hey, I'm a Saiyan, I love strong women.",
                    "author": "@tayloreh",
                    "likes": 1,
                    "publishedAt": "2026-02-14T07:47:58Z"
                },
                {
                    "text": "I like fusion world the cards look less busy and give more room for the artwork been enjoying collecting this TCG. I hope I could get the next set without problems.",
                    "author": "@Jojoborat123",
                    "likes": 2,
                    "publishedAt": "2026-02-13T21:46:45Z"
                },
                {
                    "text": "Love your vids bro ty for blessing me on my work break 🙏🏽",
                    "author": "@Nobody-we7kl",
                    "likes": 1,
                    "publishedAt": "2026-02-13T22:13:36Z"
                },
                {
                    "text": "Bought the last two shallot starter deck for $43 on Amazon and my wife pulled the vegito scr I was so happy. Now once the realm of the gods box arrives we need that vegeta god rare 😂",
                    "author": "@docholiday9513",
                    "likes": 1,
                    "publishedAt": "2026-02-13T23:12:38Z"
                },
                {
                    "text": "Hopefully this hype cools down so I can get in, loved Dragon Ball since I was a kid, but these prices are insane",
                    "author": "@TommyNoVercetti",
                    "likes": 0,
                    "publishedAt": "2026-02-14T00:05:16Z"
                },
                {
                    "text": "I gave up on Pokemon and discovered.the magna set but ofc prices are exploding",
                    "author": "@juggie19",
                    "likes": 1,
                    "publishedAt": "2026-02-14T02:01:20Z"
                },
                {
                    "text": "Dragonball has the fanbase thats for sure 💯",
                    "author": "@BigtheJoes",
                    "likes": 0,
                    "publishedAt": "2026-02-13T23:27:04Z"
                },
                {
                    "text": "is the new set ultra bout worth to pre order ?",
                    "author": "@mage4925",
                    "likes": 3,
                    "publishedAt": "2026-02-13T21:18:47Z"
                },
                {
                    "text": "Serious question…bought that Son goku 777 in a psa 10 a year ago and its like 13k last few sales…wtf do i do with this thing?! Is this real or a micro bubble?",
                    "author": "@medcardman",
                    "likes": 2,
                    "publishedAt": "2026-02-13T21:46:02Z"
                },
                {
                    "text": "I pulled the Son Goten SCR** out of 4 booster packs. Now I'm a believer.",
                    "author": "@rrrriiiccchhh",
                    "likes": 0,
                    "publishedAt": "2026-02-13T22:20:01Z"
                },
                {
                    "text": "I ve been opening booster box dragon ball since 2022 and I have grails!!!!",
                    "author": "@jericonatividad9873",
                    "likes": 1,
                    "publishedAt": "2026-02-13T23:08:38Z"
                },
                {
                    "text": "Fusion world is goated",
                    "author": "@darkjord5823",
                    "likes": 2,
                    "publishedAt": "2026-02-13T22:33:20Z"
                },
                {
                    "text": "🙏🏻🙏🏻",
                    "author": "@jasonsilva9444",
                    "likes": 0,
                    "publishedAt": "2026-02-14T06:03:01Z"
                },
                {
                    "text": "Dragon ball cards are all the same looking except for the manga energy markers. Other than that, it’s just the foiling.",
                    "author": "@Nonetheless-k9b",
                    "likes": 0,
                    "publishedAt": "2026-02-14T04:10:20Z"
                },
                {
                    "text": "I friken love dragonball. I like Pokemon cards over dragon ball but dragon ball anime is better than any anime ever created. I will die on that hill. I do love fusion world because the art looks so clean to me and I love when it depicts specific scenes from the anime. I hate how expensive cards are though. Before I can pick up a $20-$40 SCR but now those same cards are like $100-$200. I don’t like opening packs because the pull rates are brutal. Ehh I will ride out the storm.",
                    "author": "@samersalama6275",
                    "likes": 1,
                    "publishedAt": "2026-02-13T22:55:12Z"
                },
                {
                    "text": "Honestly I feel like the recent pump of DBZ and OP are just poke bro pumping up cards in other tcg to dump to get their money bag for the 30th anniversary and hoard that",
                    "author": "@TheBoombooman",
                    "likes": 0,
                    "publishedAt": "2026-02-14T03:21:35Z"
                },
                {
                    "text": "If yall wanna collect dragon go ahead just dont buy the scalper prices, not worth it trust me and wait till it drops.",
                    "author": "@penguin707gunner",
                    "likes": 1,
                    "publishedAt": "2026-02-13T23:03:21Z"
                },
                {
                    "text": "Which one are more valuables English or Japanese",
                    "author": "@Leblon_James",
                    "likes": 0,
                    "publishedAt": "2026-02-14T00:47:08Z"
                },
                {
                    "text": "I think fusion world is killing masters right now prices been soaring also they alternate arts are getting better",
                    "author": "@MakaveliUltra",
                    "likes": 0,
                    "publishedAt": "2026-02-13T23:08:15Z"
                },
                {
                    "text": "W dragon ball",
                    "author": "@T.E.Q.",
                    "likes": 1,
                    "publishedAt": "2026-02-13T21:11:09Z"
                }
            ]
        }
    ]
}