{
    "videoId": "iMPfDZv07xo",
    "history": [
        {
            "fetchedAt": "20260214_212222",
            "commentCount": 25,
            "comments": [
                {
                    "text": "The REAL villain of Silksong is the head scientist who becomes the unraveled in whiteward as the caretaker tells us that he’s to blame for injecting silk into everyone which is what allowed the haunting to get them so easily",
                    "author": "@TheDisciple_NBCC",
                    "likes": 288,
                    "publishedAt": "2026-02-14T19:13:38Z"
                },
                {
                    "text": "We all know it’s savage beastfly",
                    "author": "@Stupidbeans-q5j",
                    "likes": 182,
                    "publishedAt": "2026-02-14T19:11:01Z"
                },
                {
                    "text": "what do you mean no reason? there was an empty spot on my shelf!",
                    "author": "@ravioliis_",
                    "likes": 41,
                    "publishedAt": "2026-02-14T19:17:46Z"
                },
                {
                    "text": "The real villain is the Skull Tyrant for killing my boy Pilby.",
                    "author": "@tankz613",
                    "likes": 21,
                    "publishedAt": "2026-02-14T19:58:47Z"
                },
                {
                    "text": "To me it's the Conductors, because they were the ones that made the Citadel this gilded and rich place at the costs of the pilgrims in the Underworks and the ecossystem of Bilewater, Putrid Ducts, Sinner's Road, Greymoor and Verdania",
                    "author": "@lil_ghost19",
                    "likes": 75,
                    "publishedAt": "2026-02-14T19:17:16Z"
                },
                {
                    "text": "To be a villain is to cause problems knowingly and on purpose, my girl Lace was just trying to help destroy her mother and help save Hornet and Pharloom! Retract that \"honorable\" mention!!!",
                    "author": "@ImpostorTheNovaTar",
                    "likes": 26,
                    "publishedAt": "2026-02-14T19:21:22Z"
                },
                {
                    "text": "GMS seems more like she's desperately trying to escape, rather than actively attempting to sabatoge the citizens.",
                    "author": "@saffi_taffi",
                    "likes": 58,
                    "publishedAt": "2026-02-14T19:15:51Z"
                },
                {
                    "text": "I think it’s Grand Mama, the Weavers, and the Conductors, but really it could’ve all been avoided if they were peaceful and they didn’t make war with other tribes and there was no Haunting.",
                    "author": "@nachoguy12",
                    "likes": 39,
                    "publishedAt": "2026-02-14T19:11:23Z"
                },
                {
                    "text": "I’m pretty sure that  Conductors not only continued sustaining the order created by Weathers, but actually made it way worse. \nNot to say that Citadel was great during Weathers time, but the extraction and implantation of silks, as well as segregation among common bugs were implemented by Conductors, not Weathers, since according to Pious Isamor, who used to greet everyone at the Citadel entrance, and now is hidden from anyone’s eyes, all common bugs were equal. And atrocities with silk are stated to be done by common bugs who aimed to become immortal.",
                    "author": "@gikkik1821",
                    "likes": 7,
                    "publishedAt": "2026-02-14T19:46:06Z"
                },
                {
                    "text": "To be fair, the fourth heart looks cool displayed in your home",
                    "author": "@herbertdesmarais1375",
                    "likes": 2,
                    "publishedAt": "2026-02-14T20:08:08Z"
                },
                {
                    "text": "I thought maybe it was the void in the third act but I realize it doesn't have a mind of his own except for ghost \nMaybe it's the friends that hornet made in the long way\n\nAlso maybe if the weavers and GMS weren't such assholes none of this wouldn't have happen just saying though",
                    "author": "@Beef-jerky-yummy",
                    "likes": 18,
                    "publishedAt": "2026-02-14T19:11:11Z"
                },
                {
                    "text": "One notable fact though, the conductors are possibly even worse because the statue near the dead psalm keeper actually states the purpose of the citedal very outright to pilgrims, even mentions how the citadel was actually very bare bones with the weavers, so much of the poverty was by them 😊",
                    "author": "@pimpingporygon7157",
                    "likes": 10,
                    "publishedAt": "2026-02-14T19:22:57Z"
                },
                {
                    "text": "Definitely the Conductors and the general Citadel.",
                    "author": "@Insert_C0OL-name.s",
                    "likes": 3,
                    "publishedAt": "2026-02-14T20:01:49Z"
                },
                {
                    "text": "I reject that last option, sure I didn't need the 4th heart, but I WANTED the achievement",
                    "author": "@miguellopes7627",
                    "likes": 2,
                    "publishedAt": "2026-02-14T19:55:16Z"
                },
                {
                    "text": "Grand Mother Silk just wanted to build a kingdom, the weavers got mad at her because she didn’t tell them they were adopted and took over, they then hired people who ruined the taxes, Silk then tried to save everyone from the taxes by controlling them to piss off the conductors",
                    "author": "@GetSansed",
                    "likes": 6,
                    "publishedAt": "2026-02-14T19:30:22Z"
                },
                {
                    "text": "citadel in general, phantom, zylotol,  architects, khann, judges, sister splinter, sentinels and choruses are all good candidates as well, not necessarily for the entirety of pharloom but some parts",
                    "author": "@عبادمحمد-ص3س",
                    "likes": 12,
                    "publishedAt": "2026-02-14T19:17:45Z"
                },
                {
                    "text": "There's no villian. Everything just happened so perfectly to make an entire mess and bring chaos. After all of that, Hornet might be the closest to a villain due to some of her Cruel but UNNECESSARY actions. *I think she could calm everything down but she didn't just to desight her home or be more powerful.*",
                    "author": "@Bae_Neko",
                    "likes": 7,
                    "publishedAt": "2026-02-14T19:25:08Z"
                },
                {
                    "text": "The snail shamans are the ones responsible for causing the void to haunt pharloom in the first place, granted it was silk who unintentionally spread the void onto the everyone who was victims of the haunting and lace who wanted all of pharloom to be destroyed by the void",
                    "author": "@McCageNM",
                    "likes": 3,
                    "publishedAt": "2026-02-14T19:22:08Z"
                },
                {
                    "text": "it's Sherma masterminding it all from behind that veneer of cuteness and innocence",
                    "author": "@moog5260",
                    "likes": 0,
                    "publishedAt": "2026-02-14T21:14:39Z"
                },
                {
                    "text": "Things are grim, you say?",
                    "author": "@josemontalvo7601",
                    "likes": 7,
                    "publishedAt": "2026-02-14T19:11:35Z"
                },
                {
                    "text": "I would say the answer is \"All of the Above\", this was a snowball effect. Like... one group didn't do it very well but the next one did it even worse.",
                    "author": "@ashbellrideoux3781",
                    "likes": 1,
                    "publishedAt": "2026-02-14T20:16:41Z"
                },
                {
                    "text": "This is where I get really confused, because I think that the culprits are GMS, the weavers and the higher cast bugs, like the conductors. GMS probably for the downfall of the other tribes/kingdoms, the weavers for the f'ed up religious system (I'm not certain if they were the ones that came up with that), and the conductors for the experiments with silk that ended up starting the haunting? I get more confused the more I read about it 😅",
                    "author": "@priscilanosoma",
                    "likes": 2,
                    "publishedAt": "2026-02-14T19:30:08Z"
                },
                {
                    "text": "actually the citadel wasn't built when silk was in power, the weaver made it so that the lower bugs of pharloom could sing the song (also known as... the silksong wow crazy right ?) to keep silk asleep, so everything that you say in the video is a problem caused by the weavers.\nI'm not saying silk is good, I mean, she did do some bad thing.\nI think the clearest exemple of this is phantom. Silk made her but discarded her right away, but the weaver trapped her in the exaust organ and forced her to work for the citadel.\nI think that there is no true big bad, rather multiple bugs who ended up creating the cause of the problem, made the problem and then perpatuated it",
                    "author": "@Volumix-1",
                    "likes": 3,
                    "publishedAt": "2026-02-14T19:43:16Z"
                },
                {
                    "text": "A couple weeks ago I commented how does this guy only have 20k subscribers. Now you are 40k. Keep on keeping on. Your content is great.",
                    "author": "@andybotros520",
                    "likes": 0,
                    "publishedAt": "2026-02-14T19:18:24Z"
                },
                {
                    "text": "Silksong is a story of “passing the buck” so to speak. The Weavers passed their burden onto the conductors, who then passed it onto the lesser bugs. Who inevitably “dropped the ball shaped silk”",
                    "author": "@Allday524",
                    "likes": 0,
                    "publishedAt": "2026-02-14T21:09:12Z"
                }
            ]
        }
    ]
}