{
    "videoId": "AmTugTZ6tYU",
    "history": [
        {
            "fetchedAt": "20260227_170019",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Keine PC-Version, kein Kauf.",
                    "author": "@Matvo",
                    "likes": 37,
                    "publishedAt": "2026-02-27T15:16:53Z"
                },
                {
                    "text": "Wenn Sony die Spiele parallel am PC veröffentlichen würde, hätte ich wesentlich mehr davon gekauft.\nSo schaue ich mir das auf twitch/youtube an und vergesse das Spiel dann.",
                    "author": "@Quickben11",
                    "likes": 54,
                    "publishedAt": "2026-02-27T15:04:50Z"
                },
                {
                    "text": "Hat Sony nicht in einem ihrer letzten Geschäftsberichte gesagt, dass die PC Ports sich massiv gut verkaufen und Gelddruck Maschinen sind? Die Ports zurück zu fahren würde denen also viel weniger Geld einbringen.\n\nAuch grade wenn man die alternative sieht und gute Ports Leute gezielt davon abhält sich die Games auf dem PC einfach zu ziehen und zu Emulieren.",
                    "author": "@JanPlays-nx5qp",
                    "likes": 45,
                    "publishedAt": "2026-02-27T15:18:47Z"
                },
                {
                    "text": "Aus der Allergie von Ubisoft ist Clair Obscure entstanden, also Danke Ubisoft, dass Ihr eure besten Mitarbeiter gehen lassen habt, so konnten Sie ein Spiel erschaffen, welches für euch die Pest ist.",
                    "author": "@christophcpg7789",
                    "likes": 39,
                    "publishedAt": "2026-02-27T14:48:10Z"
                },
                {
                    "text": "Habe ich da eine Spezi Dose entdeckt😁😁😁",
                    "author": "@vincentvelentine8796",
                    "likes": 3,
                    "publishedAt": "2026-02-27T14:59:28Z"
                },
                {
                    "text": "Da schrumpft sie weiter, die Hoffnung auf Gran Turismo für PC…",
                    "author": "@Philster42",
                    "likes": 12,
                    "publishedAt": "2026-02-27T14:57:55Z"
                },
                {
                    "text": "Es wäre sehr ärgerlich, wenn Horizon 3 nicht mehr für den PC erscheinen würde. Die Open World sah auf dem PC immer super aus.",
                    "author": "@IchbinSiriusyt",
                    "likes": 6,
                    "publishedAt": "2026-02-27T15:37:37Z"
                },
                {
                    "text": "Die Pupillen von Paul... Sind das diese rechteckigen Pupillen vor denen mich meine Mutter immer gewarnt hat, die man von zu vielem Zocken bekommt? ^^ Vielleicht auch einer dieser Reptiloiden ;-)",
                    "author": "@KlausGuenhardt1704",
                    "likes": 2,
                    "publishedAt": "2026-02-27T14:53:11Z"
                },
                {
                    "text": "Irgendwie ist es schon lachhaft wie viele Live-Service-Games verkacken, ein Grab nach dem anderen wird geschaufelt und die \"großen\" Publisher füllen langsam aber sicher den Friedhof weiter auf.\nEin generischer Shooter nach dem anderen egal ob Ego-Shooter oder Hero-Shooter...\nEs sind mitlerweile soooo unfassbar langweilige Spiele, dass keines davon auch nur ansatzweise meine Zeit verdient.",
                    "author": "@oC0NC1Lo",
                    "likes": 6,
                    "publishedAt": "2026-02-27T14:57:38Z"
                },
                {
                    "text": "Bezüglich Playstation sehe ich das so, dass ich allgemein sehr glücklich damit bin, physische Versionen kaufen zu können",
                    "author": "@my-kill4714",
                    "likes": 5,
                    "publishedAt": "2026-02-27T14:51:16Z"
                },
                {
                    "text": "Ich meine warum erzählt einer eurer Redakteure dass 40 € vollpreis sind 40 € sind kein vollpreis",
                    "author": "@gosx9786",
                    "likes": 2,
                    "publishedAt": "2026-02-27T16:03:12Z"
                },
                {
                    "text": "Last of Us hat 60k Bewertungen. Das sollten mindestens 2 Mio verkaufte Spiele sein. Das soll sich für einen einfachen Port nicht finanziell lohnen? Da müssen sie doch wieder irgendwelche Fantasie Zahlen in die Rechnung aufgenommen haben.",
                    "author": "@chibisf4",
                    "likes": 6,
                    "publishedAt": "2026-02-27T15:45:53Z"
                },
                {
                    "text": "War interessant zu sehen, wie bei Marathon gestern nach dem Peak von 143k alle paar Minuten die Spielerzahlen um 1k droppten.",
                    "author": "@Fab1LouS",
                    "likes": 0,
                    "publishedAt": "2026-02-27T15:08:56Z"
                },
                {
                    "text": "horizon hunters gathering sollte auch dieses wochenende spielbar sein (fragt nicht wieso sich sony selbst im weg steht mit ihren beiden live service spielen)",
                    "author": "@verax1499",
                    "likes": 0,
                    "publishedAt": "2026-02-27T14:55:32Z"
                },
                {
                    "text": "Marathon ist halt echt nicht meins, so ein Operator-Game, mit Indie Grafik. Ich hoffe Bungie kommt durch und kann evtl. ein gutes SPACE-Shooter-MMO machen ^^",
                    "author": "@tuarth9562",
                    "likes": 16,
                    "publishedAt": "2026-02-27T14:36:09Z"
                },
                {
                    "text": "ich hoffe, dass Sony die Playstationspiele weiterhin nachreicht, wenn auch später. Die Spiele laufen mit dementsprechender Hardware richtig gut und flüssig. Vom PC möchte ich einfach nicht mehr weg. Die PS3 war für mich damals noch interessant, da sie eine Vielzahl exklusiver Titel hatte, das war eine geile Zeit. Die PS4 hat leider nur Staub gefressen und seit dem bin ich raus. Ich will mir nicht für ein paar Spiele wie ein God of War oder ein Uncharted extra eine Konsole anschaffen müssen, bei der ich dann beim zocken seufzend die Vorzüge meines PC's vermisse. Eine Plattform für alle Spiele zuhaben ob neu oder alt und das mit immer besser werdender Qualität ist Luxus.",
                    "author": "@curtisgamer9310",
                    "likes": 5,
                    "publishedAt": "2026-02-27T15:06:03Z"
                },
                {
                    "text": "Hab Gesten die Marathon beta für ps5 geladen und nach ungefähr 7 Minuten ausgemacht und deinstalliert \nDie Steuerung ist lahm",
                    "author": "@OneGuyInSpace",
                    "likes": 0,
                    "publishedAt": "2026-02-27T15:41:00Z"
                },
                {
                    "text": "Zum Wochenende könnt ihr auch Anno 117 gratis spielen.",
                    "author": "@konradhentschel9386",
                    "likes": 0,
                    "publishedAt": "2026-02-27T16:51:12Z"
                },
                {
                    "text": "Das größte Spiel auf dem Markt GTA hält vom PC auch nicht viel. Zeitverzögerte Releases lohnen sich für Sony nur mäßig. GTA ist ein eigenes Phänomen.",
                    "author": "@GhostRider-ex6qb",
                    "likes": 11,
                    "publishedAt": "2026-02-27T14:39:55Z"
                },
                {
                    "text": "Grund für Sony könnte natürlich zum einen die Steam Machine sein, die PS spiele auf einer anderen Plattform auch ins Wohnzimmer bringen könnte und auch die Gerüchte, zur Windows Xbox, auf der auch Steam und damit PS spiele laufen würden. Als ehemaliger PS Main der zum High End PC gewechselt ist, finde ich es natürlich schade, die Exclusives wieder auf der limitierten Hardware spielen zu müssen.",
                    "author": "@samatomke",
                    "likes": 1,
                    "publishedAt": "2026-02-27T15:08:58Z"
                },
                {
                    "text": "Spiele nicht gleichzeitig auf allen Systemen zu releasen und sich dann über Performance zu beschweren, ist ein wenig realitätsfern. Aber nun ja, ich lasse mich nicht zwingen, eine Konsole zu kaufen.",
                    "author": "@ANTheWhizkid",
                    "likes": 2,
                    "publishedAt": "2026-02-27T15:36:17Z"
                },
                {
                    "text": "Sony hat doch immer von den Ports geschwärmt. Was stimmt denn nun?",
                    "author": "@andrewbasket3712",
                    "likes": 1,
                    "publishedAt": "2026-02-27T15:36:24Z"
                },
                {
                    "text": "Hoffentlich kommt ein dritter Mittelerde mordors schatten teil.❤",
                    "author": "@xELVIKOx",
                    "likes": 0,
                    "publishedAt": "2026-02-27T16:22:46Z"
                },
                {
                    "text": "Es gibt mehr gute Spiele als man Zeit hätte sie zu spielen ... was jucken mich da Exclusives ... wenn die mein Geld nicht haben wollen kriegts jemand anders.",
                    "author": "@akaMokassin",
                    "likes": 1,
                    "publishedAt": "2026-02-27T16:51:04Z"
                },
                {
                    "text": "exklusivität bringt niemandem was - auch sony nicht. zudem waren die bisherigen portierungen \"sehr erfolgreich\", wie sony sich auch schon mehrfach offiziell eingestanden hat. wäre ein ziemlich unsympathischer fail-move, wenn sie davon jetzt wieder abrücken 🤷",
                    "author": "@sunnyschramm9650",
                    "likes": 3,
                    "publishedAt": "2026-02-27T15:29:36Z"
                }
            ]
        }
    ]
}