{
    "videoId": "q0N-l9mb518",
    "history": [
        {
            "fetchedAt": "20260214_212222",
            "commentCount": 25,
            "comments": [
                {
                    "text": "I genuinely think the fantastic 4 should always have a team up with each other and should never be separated… just my way of thinking tho…",
                    "author": "@CloudedRio",
                    "likes": 158,
                    "publishedAt": "2026-02-14T18:42:32Z"
                },
                {
                    "text": "When you know this team up will be added to the base kit next patch but you just cant prove it.",
                    "author": "@theskullboy8700",
                    "likes": 97,
                    "publishedAt": "2026-02-14T18:41:04Z"
                },
                {
                    "text": "Agreed man. Fantastic mains having been asking for this to be added into the kit. Getting it as a teamup is so underwhelming, especially for a character that have infinite creative applications",
                    "author": "@facelessnameless",
                    "likes": 18,
                    "publishedAt": "2026-02-14T19:45:23Z"
                },
                {
                    "text": "With how busted these new characters are. This shit should have just been a part of his basis kit.",
                    "author": "@andrepicsan2809",
                    "likes": 18,
                    "publishedAt": "2026-02-14T18:46:32Z"
                },
                {
                    "text": "Agreed \nSometimes they should just add these team ups to the base character\nLike ultron\nLet his beam heal and damage like jeff but cut the damage",
                    "author": "@saibot7962",
                    "likes": 53,
                    "publishedAt": "2026-02-14T18:37:11Z"
                },
                {
                    "text": "They’re probably testing to see if it’s broken in low elo because he’s already a server admin in low elo and on console. \nWhen they make this change I hope his next team up is an independent mobility team up. Like daredevil’s hook, he grabs the ceiling or a wall and launches himself away from the fight. Or an alternative is a single target burst damage somehow, maybe like Thing’s gamma team up.",
                    "author": "@Nb_2089",
                    "likes": 14,
                    "publishedAt": "2026-02-14T18:57:27Z"
                },
                {
                    "text": "Facts twin..  this should have been on the norm with Mr F",
                    "author": "@iLLuMiNaTeDSiN",
                    "likes": 5,
                    "publishedAt": "2026-02-14T18:41:59Z"
                },
                {
                    "text": "To me, this just seems like they couldnt come up with anything to give Reed as a team up so they just threw him a QOL as a team up. I mean hell they couldnt even be bothered to give Torch anything after they took his team up away lol",
                    "author": "@King0nyx",
                    "likes": 2,
                    "publishedAt": "2026-02-14T20:00:19Z"
                },
                {
                    "text": "Agreed definitely not gonna stop people from throwing 😂",
                    "author": "@yellowflash029",
                    "likes": 2,
                    "publishedAt": "2026-02-14T18:42:53Z"
                },
                {
                    "text": "This is like letting Thor cancel the Lightning mode,its a simple change but big for the hero",
                    "author": "@WiskinWaffles",
                    "likes": 0,
                    "publishedAt": "2026-02-14T20:21:06Z"
                },
                {
                    "text": "Man being stretchy man and not being able to go big sounds awful",
                    "author": "@BeatShaman",
                    "likes": 1,
                    "publishedAt": "2026-02-14T19:30:20Z"
                },
                {
                    "text": "Yea this doesn't even feel like a team-up \nFeels like qol they too scared to give reed 😅",
                    "author": "@bigred212",
                    "likes": 2,
                    "publishedAt": "2026-02-14T18:41:01Z"
                },
                {
                    "text": "They may be adding a new fantastic 4 team up in a later season",
                    "author": "@commit2gr8ness",
                    "likes": 1,
                    "publishedAt": "2026-02-14T19:08:00Z"
                },
                {
                    "text": "I feel like it's only good for when you're low health and don't have your invulnerability mode, so you can big mode for instant HP",
                    "author": "@Fedor1288",
                    "likes": 1,
                    "publishedAt": "2026-02-14T19:15:12Z"
                },
                {
                    "text": "Honestly I feel like he should be a tank at this point. His damage out put is sub par but his survivalbilty is insane. Great for holding points and peeling.",
                    "author": "@qveltz5258",
                    "likes": 0,
                    "publishedAt": "2026-02-14T21:18:00Z"
                },
                {
                    "text": "I’m pretty sure they’re just trial running it  to give it to him next season",
                    "author": "@jacobbailey9773",
                    "likes": 0,
                    "publishedAt": "2026-02-14T20:45:35Z"
                },
                {
                    "text": "Holy 8 head. Mf aint got no hairline",
                    "author": "@BobTheBuidler",
                    "likes": 0,
                    "publishedAt": "2026-02-14T19:11:08Z"
                },
                {
                    "text": "RIO SEES ME FR.",
                    "author": "@jordanarcher6790",
                    "likes": 0,
                    "publishedAt": "2026-02-14T19:57:37Z"
                },
                {
                    "text": "They are probably testing the balance of this, \n\nSince with on-demand Big Mode\n\nyou basically have a free full-hp heal any time you want without having to NOT attack as a drawback\n\nsince you can just revert back to small mode if you didn't want to actually use Big Mode",
                    "author": "@Ardeleus",
                    "likes": 21,
                    "publishedAt": "2026-02-14T18:39:31Z"
                },
                {
                    "text": "Yeah this should be part of his base kit. Sorry Fantastic mains hope yall get this team up for your games <3",
                    "author": "@Charmaclysm",
                    "likes": 0,
                    "publishedAt": "2026-02-14T20:09:30Z"
                },
                {
                    "text": "Insane that isn't base kit",
                    "author": "@dopeman4ever",
                    "likes": 0,
                    "publishedAt": "2026-02-14T19:16:38Z"
                },
                {
                    "text": "Yeah, unlike the things’s new team up. This definitely doesn’t even feel like a team up. This should’ve just been a buff",
                    "author": "@SirUncutTTV",
                    "likes": 0,
                    "publishedAt": "2026-02-14T18:45:58Z"
                },
                {
                    "text": "I’m telling yall now as a peak celestial 2 Mr fantastic if they give me this teamup on his base kit it easily push mf fent into eternity at most. A tier hero for sure.",
                    "author": "@glokkarot",
                    "likes": 0,
                    "publishedAt": "2026-02-14T18:50:42Z"
                },
                {
                    "text": "Ur cooking",
                    "author": "@Mrfruitchew",
                    "likes": 0,
                    "publishedAt": "2026-02-14T21:09:35Z"
                },
                {
                    "text": "Yo Rio..talk di tings bruv! This literally should’ve been a quality of life change for Mr Fantastic, this would automatically add to his utility as a hybrid character, especially in the damage department 🤷🏾‍♂️",
                    "author": "@royster90s",
                    "likes": 0,
                    "publishedAt": "2026-02-14T20:52:33Z"
                }
            ]
        }
    ]
}