{
    "videoId": "6JF0KJPwCAQ",
    "history": [
        {
            "fetchedAt": "20260213_210912",
            "commentCount": 7,
            "comments": [
                {
                    "text": "Hi everyone! Here's a follow up to my last soil blocking video which you can watch here if you haven't already- https://youtu.be/ByLv8lVglj8\n\nThis new one covers what can go wrong when making soil blocks and I also demonstrate how to make them using a smaller, more affordable soil blocker if you're sowing seeds on a smaller scale than I am.",
                    "author": "@joegardenerTV",
                    "likes": 1,
                    "publishedAt": "2026-02-13T14:10:43Z"
                },
                {
                    "text": "Anything you can teach on soil blocking is great! I bought  a soil blocker but nervous to use it because of all of the negative videos about them and the lack of good how to videos.",
                    "author": "@laurasgardensanctuary",
                    "likes": 2,
                    "publishedAt": "2026-02-13T14:41:13Z"
                },
                {
                    "text": "Thank you.  I picked up some great tips, even the use of a gooseneck watering bottle. You're easy to learn from. I discovered you when you set up your beautiful greenhouse.",
                    "author": "@gailzharv",
                    "likes": 0,
                    "publishedAt": "2026-02-13T17:27:26Z"
                },
                {
                    "text": "I bought the swift nanos because of your video. Thx! Some of your links are bad, unavailable, the soil mixing tub for one. That can be picked up at Home Depot for $8.00! It’s called a cement mixing tub.",
                    "author": "@debsmith8102",
                    "likes": 0,
                    "publishedAt": "2026-02-13T20:39:32Z"
                },
                {
                    "text": "I have those 4 and 5 blocks and the mini blocker. I like the idea and it create nice blocks. But for some reason the roots cannot penetrate the blocks despite the are wet enough, even to wet for my feelings. \nTriede many soil recipe ...",
                    "author": "@jakehohoho7534",
                    "likes": 0,
                    "publishedAt": "2026-02-13T16:56:27Z"
                },
                {
                    "text": "I've never had an issue with my small size soil blocks.\nOnly squash, cukes and melons get a larger size soil block.\nI always sift before using.  I use a very moist soil and a spatula to make sure the material is well packed into the maker. \nEach year I get better at timing so I go straight to the garden and skip potting up to a pot.\nAlways double check if my seed does (or does not) want heat mat or light. Never let my cat walk across the seeds😂 and water slowly on the side, draining off anything left in the tray after 5 minutes.",
                    "author": "@victorialg1270",
                    "likes": 0,
                    "publishedAt": "2026-02-13T17:48:49Z"
                },
                {
                    "text": "Can you confirm using BX picking out bigger chunks? The screening thing threw me whether it is a necessary step or not.",
                    "author": "@billsnyder6945",
                    "likes": 0,
                    "publishedAt": "2026-02-13T17:16:35Z"
                }
            ]
        }
    ]
}