{
    "videoId": "1_f3LK4RT6s",
    "history": [
        {
            "fetchedAt": "20260217_202040",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Hey everyone, sorry about the bad news. I actually decided to quit this project around October of last year, but wanted to be sure before making a video.",
                    "author": "@Codeer",
                    "likes": 617,
                    "publishedAt": "2026-02-17T13:18:24Z"
                },
                {
                    "text": "Takes courage to make decisions like this. Look forward to your future projects :)",
                    "author": "@lewispearson",
                    "likes": 855,
                    "publishedAt": "2026-02-17T13:22:06Z"
                },
                {
                    "text": "Aw man, well it was fun while it lasted",
                    "author": "@totoisayal5045",
                    "likes": 269,
                    "publishedAt": "2026-02-17T13:18:17Z"
                },
                {
                    "text": "It's sad to see the project end, but I'm sure the next project will be just as good if not better, take your time",
                    "author": "@Ваша-местная-рыба",
                    "likes": 304,
                    "publishedAt": "2026-02-17T13:22:53Z"
                },
                {
                    "text": "Hey man, from a fellow indie GameDev, it happens!! The project looked really cool, but some things just dont work out. Good luck on the next journeys!!",
                    "author": "@aquacron4548",
                    "likes": 70,
                    "publishedAt": "2026-02-17T13:29:10Z"
                },
                {
                    "text": "No doubts I've always had an impression, that this game is just a sandbox for many mechanics, features, ideas you wanted to try out. I've never expected it end up as a whole game. So, it served its goal, I believe, and we'll see many of those in your future games. The videos were fun, interesting, educational for me. Thanks a lot and hope to see your next game soon!",
                    "author": "@dftpunk",
                    "likes": 105,
                    "publishedAt": "2026-02-17T14:06:35Z"
                },
                {
                    "text": "This is genuinely heartbreaking to me",
                    "author": "@benablelife",
                    "likes": 583,
                    "publishedAt": "2026-02-17T13:18:38Z"
                },
                {
                    "text": "Have you considered open sourcing the game to public. I would like to play the raw version of this game. Also community may fork from it and create their own version of the game and it would be a fun concept.\n\nI can understand if you are against this idea.",
                    "author": "@12c1aditya2",
                    "likes": 73,
                    "publishedAt": "2026-02-17T14:08:31Z"
                },
                {
                    "text": "Can't wait to see what you're working on. Keep up the good work dude! I'm glad to see you grow as a developer.",
                    "author": "@GodWithAnUnholyAmountOfPickles",
                    "likes": 12,
                    "publishedAt": "2026-02-17T13:36:29Z"
                },
                {
                    "text": "you’re the one who got me into game development man, i hope the best for you and any new journeys you might have! C:",
                    "author": "@usernameforgottoexist",
                    "likes": 8,
                    "publishedAt": "2026-02-17T14:32:56Z"
                },
                {
                    "text": "This was actually one of the indie game projects that stood out to me when I first followed it so I hope you that you don't completely throw it out. but, If you can make something more intentional and better in a shorter time with one of those other projects you showed, then I'm all for it. Good luck on your next journey!",
                    "author": "@zeeh7438",
                    "likes": 60,
                    "publishedAt": "2026-02-17T13:41:18Z"
                },
                {
                    "text": "As sad as this is, the fact that you identified and made such a hard decision is super admirable. It's one thing to make a game, but being self-reflective enough to know what is and isn't working is another. There's no doubt that what you've learned from this project will inform and help you build your next projects - as you said, practice makes a world of difference.\n\nLook forward to seeing what you get up to next - take your time. We'll be here!",
                    "author": "@DarkDax",
                    "likes": 3,
                    "publishedAt": "2026-02-17T15:58:58Z"
                },
                {
                    "text": "This is sad I remember checking every day for a new video.I have never seen a game this cool.",
                    "author": "@wina9224",
                    "likes": 9,
                    "publishedAt": "2026-02-17T13:28:33Z"
                },
                {
                    "text": "\"Oh man, overshot my scope again\"\n[+ New Project]\n\n\nThe fact is, you're learned a ton of new skills along the course of this project that will make the next one go even better. Good luck on the next one!",
                    "author": "@thelonecabbage7834",
                    "likes": 2,
                    "publishedAt": "2026-02-17T19:14:04Z"
                },
                {
                    "text": "That's fine, don't let comments sway your decision. It's so easy for someone to say \"damn that's so sad i really wanted to play this game\", but it translates to the next couple years of you spending many hours every day working on it, which isn't really reasonable to ask for. I'm happy to hear you've started working on some other new projects",
                    "author": "@tqwewe",
                    "likes": 8,
                    "publishedAt": "2026-02-17T14:15:30Z"
                },
                {
                    "text": "Thank you for sharing. Takes guts to do this. Looking forward to following your next steps!",
                    "author": "@R1ckJ4m3s",
                    "likes": 0,
                    "publishedAt": "2026-02-17T18:02:43Z"
                },
                {
                    "text": "Ts such a sad moment for those that waited long 😭",
                    "author": "@jabberwock9899",
                    "likes": 6,
                    "publishedAt": "2026-02-17T13:19:37Z"
                },
                {
                    "text": "It's a shame, but you learned a lot. This will be useful for any future projects. You're very skilled. Keep it up, friend!",
                    "author": "@Crisisdarkness",
                    "likes": 4,
                    "publishedAt": "2026-02-17T13:53:50Z"
                },
                {
                    "text": "This wonderful project and its devlogs inspired me to start learning Unity back in 2021, it truly means a lot to me.\nWishing you luck on what's next and thank you for everything.❤",
                    "author": "@Ghalux",
                    "likes": 2,
                    "publishedAt": "2026-02-17T13:35:05Z"
                },
                {
                    "text": "Good on you for knowing when to stop, it was almost certainly a difficult decision. Best of luck in the next endeavor, will stay tuned to see it.",
                    "author": "@BaugipGames",
                    "likes": 1,
                    "publishedAt": "2026-02-17T15:14:55Z"
                },
                {
                    "text": "Always sad to see but I hope you take everything you've learned into the next game and I'm excited to see the next step of the journey!",
                    "author": "@dev.dream.podcast",
                    "likes": 0,
                    "publishedAt": "2026-02-17T16:29:11Z"
                },
                {
                    "text": "The climbing mechanic feels like it should be a stealth game. Climbing to different areas to kill the target, and the gun mode could be to just go ham. It could be like hitman but more freeing. For example you play as a thing that will destroy an evil company or something. You sneak to kill the leader because if you go in guns blazing he will evacuate, then you shoot up the rest to clear the level, or keep sneaking. I feel like the mechanics can be salvaged, but I completely understand why you would stop.",
                    "author": "@InvasionAnimation",
                    "likes": 24,
                    "publishedAt": "2026-02-17T14:05:34Z"
                },
                {
                    "text": "Remember watching ur video on my phone before getting a pc now i have a pc and started game deving\nhope u can cook more peak games",
                    "author": "@raichu1873",
                    "likes": 1,
                    "publishedAt": "2026-02-17T18:01:24Z"
                },
                {
                    "text": "Excited to see what you do next though!",
                    "author": "@demospongiae3893",
                    "likes": 1,
                    "publishedAt": "2026-02-17T17:40:41Z"
                },
                {
                    "text": "loved the journey of this game and the dev logs. It was never about the end product but how you got there. So just keep going, keep creating what you love",
                    "author": "@freshmango9723",
                    "likes": 1,
                    "publishedAt": "2026-02-17T15:20:04Z"
                }
            ]
        }
    ]
}