{
    "videoId": "DpICnfXlbfg",
    "history": [
        {
            "fetchedAt": "20260227_050018",
            "commentCount": 25,
            "comments": [
                {
                    "text": "Spidey taking notes from naymor",
                    "author": "@eighty-star5133",
                    "likes": 64,
                    "publishedAt": "2026-02-27T02:36:38Z"
                },
                {
                    "text": "90% of rivals issues would be solved if the community wasn't so toxic",
                    "author": "@MarcusBrody-u1s",
                    "likes": 85,
                    "publishedAt": "2026-02-27T02:43:04Z"
                },
                {
                    "text": "I feel like ive heard of this in history before",
                    "author": "@Lewis-ec5sn",
                    "likes": 37,
                    "publishedAt": "2026-02-27T02:41:47Z"
                },
                {
                    "text": "the entire southern water tribe 😭 Welcomes spiderman",
                    "author": "@armanikillebrew786",
                    "likes": 7,
                    "publishedAt": "2026-02-27T03:32:48Z"
                },
                {
                    "text": "The sad part that no one really ever talks about this when you have a good Spider-Man player and I don’t mean just carrying a game but like they’re genuinely some of the best teammates I’ve ever had in the game like they’re nice people they give directions ask the team opinion, coordination, etc. \n\n\nlike same thing applies to some Jeffs, even though I hate them too but the good ones when they cook they cook and they’re willing to swap it’s too bad it gets overshadow with the bad ones cause it’s so common",
                    "author": "@TRJ42",
                    "likes": 26,
                    "publishedAt": "2026-02-27T02:46:40Z"
                },
                {
                    "text": "A healer is literally a strategist in this game, if they tell you to change YOU CHANGE, THEY CONTROL THE STRATEGY, THAT'S THE POINT.\nIf you don't, don't play the game",
                    "author": "@tobubiify",
                    "likes": 8,
                    "publishedAt": "2026-02-27T03:16:41Z"
                },
                {
                    "text": "Lol this is hilarious because I just faced an enemy team with a spider man and he made our team surrender our healers never lived past spawn the healer said im surrendering I said dont use this match as practice since we gonna lose anyway lol",
                    "author": "@bdtjoe",
                    "likes": 4,
                    "publishedAt": "2026-02-27T03:07:42Z"
                },
                {
                    "text": "😂",
                    "author": "@keepitthuggy",
                    "likes": 0,
                    "publishedAt": "2026-02-27T03:15:10Z"
                },
                {
                    "text": "I’m the same way fr. I don’t want to hear nun coming from a damn rokket",
                    "author": "@Andretti2Tone",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:41:44Z"
                },
                {
                    "text": "Not every dive dps but always a dive dps 😂",
                    "author": "@x-Agony93-x",
                    "likes": 1,
                    "publishedAt": "2026-02-27T03:41:23Z"
                },
                {
                    "text": "I WAS HERE FOR THIS CONVO",
                    "author": "@ktthompson8635",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:00:22Z"
                },
                {
                    "text": "Shit is wild bro",
                    "author": "@Dwayne9",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:54:31Z"
                },
                {
                    "text": "Ya know what? He's stupid, but I get it. Mfs will tell you how to play tank and they know nothing about the role and just think you have to press w and you have infinite health.",
                    "author": "@YAXZDND",
                    "likes": 29,
                    "publishedAt": "2026-02-27T02:50:17Z"
                },
                {
                    "text": "some may think spider man is out of line for that . BUT\nthere players that instant lock DPs fail at it then swap straight to strategist when we have one  or two tanks.\ninstead of picking a different DPs .",
                    "author": "@turboyabo864",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:54:57Z"
                },
                {
                    "text": "The healer is the best person to give commands because they see everything. A tanks really just be paying attention to the front and IF they turn about they will see what happens in the backline. Dps usually pay attention to their on stuff busy flanking diving ect... but the support pays attention to the whole game and whole team. The ults, when to ults, who is about to go down, who is out of position who is struggling, who is doing well they usually know why the team is losing and how to fix it. If a support tells you swtich, switch if a support tells you 2 tanks go 2 tanks, if need peels, peel. People think the support role is meaningless  and cheer on kills and damage. But the support is the most important role. The whole game goes around the support. In high elo its all about what supports your using and their ult that determines who wins the game.",
                    "author": "@NIKKI-7-7",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:04:02Z"
                },
                {
                    "text": "Unreal",
                    "author": "@jowaynejdfcornwall1766",
                    "likes": 0,
                    "publishedAt": "2026-02-27T03:20:43Z"
                },
                {
                    "text": "Spiderman mains just cant get right bruh😂",
                    "author": "@gr8dmoore17",
                    "likes": 0,
                    "publishedAt": "2026-02-27T03:12:09Z"
                },
                {
                    "text": "I HAVEN'T BEEN ABLE TO HEAL YOU SPIDERMAN, WHY YOU KEEP DYING??",
                    "author": "@90fif",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:56:47Z"
                },
                {
                    "text": "Nah, I’ve had some bad games and I’ve done horrible today but I legit swapped off Strange when I was 4-5 and went Invis. Even though I ended with 16-11, we still won because of a swap. Same reason I just go Mag or Emma if I’m getting countered on Rogue. 😭",
                    "author": "@JalenS2K",
                    "likes": 4,
                    "publishedAt": "2026-02-27T02:39:34Z"
                },
                {
                    "text": "Yoo I’m dead😂😂",
                    "author": "@KAZZrants",
                    "likes": 1,
                    "publishedAt": "2026-02-27T03:09:20Z"
                },
                {
                    "text": "Healers are untouchable third class citizens he’s right",
                    "author": "@masonarmand8988",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:58:43Z"
                },
                {
                    "text": "lmao",
                    "author": "@bananadog01",
                    "likes": 1,
                    "publishedAt": "2026-02-27T02:44:38Z"
                },
                {
                    "text": "People gotta realize man, just cause they are your main, doesn't mean you NEVER are gonna have bad/off days with them lmao",
                    "author": "@CalBaylor",
                    "likes": 0,
                    "publishedAt": "2026-02-27T03:39:22Z"
                },
                {
                    "text": "Said healer like it was a slur",
                    "author": "@darkzmbee",
                    "likes": 0,
                    "publishedAt": "2026-02-27T03:42:16Z"
                },
                {
                    "text": "Dps can't tell anyone anything. The role is too easy.",
                    "author": "@Mrdarkknight2000",
                    "likes": 0,
                    "publishedAt": "2026-02-27T04:28:37Z"
                }
            ]
        }
    ]
}