{
    "videoId": "SEXLpnXHQKE",
    "history": [
        {
            "fetchedAt": "20260220_080531",
            "commentCount": 15,
            "comments": [
                {
                    "text": "Hi Sifat,just watched in my lunch break. You never disappoint, another great walk. Thank you.",
                    "author": "@Catherine07-s9z",
                    "likes": 2,
                    "publishedAt": "2026-02-19T02:00:29Z"
                },
                {
                    "text": "Thank you for your videos. And yes I’m so over that song haha",
                    "author": "@samm3114",
                    "likes": 2,
                    "publishedAt": "2026-02-19T02:01:54Z"
                },
                {
                    "text": "Hi evryone",
                    "author": "@Connieriley-z8h",
                    "likes": 3,
                    "publishedAt": "2026-02-19T02:32:43Z"
                },
                {
                    "text": "Good evening Sifat. I will watch in the morning, like I always do, when I can't watch life. Look forward to another great walk.",
                    "author": "@27tania",
                    "likes": 1,
                    "publishedAt": "2026-02-19T02:05:23Z"
                },
                {
                    "text": "I  wannna comme to  THE NYC",
                    "author": "@bindukeshav-m8f",
                    "likes": 0,
                    "publishedAt": "2026-02-19T12:57:07Z"
                },
                {
                    "text": "Be safe",
                    "author": "@kuuiporica2198",
                    "likes": 0,
                    "publishedAt": "2026-02-19T07:27:06Z"
                },
                {
                    "text": "I get that 21:30  because I had notice when background music was on during a video.. I had to take it down.",
                    "author": "@DMillerFlorida",
                    "likes": 1,
                    "publishedAt": "2026-02-19T02:49:37Z"
                },
                {
                    "text": "Your Waking videos are outstanding.",
                    "author": "@SELLC608",
                    "likes": 0,
                    "publishedAt": "2026-02-19T01:53:22Z"
                },
                {
                    "text": "Hi Sifat 🙂",
                    "author": "@PaulaCanham-z8e",
                    "likes": 2,
                    "publishedAt": "2026-02-19T02:49:27Z"
                },
                {
                    "text": "Sifat - Other streams are having the same issues.",
                    "author": "@Debby-q4x",
                    "likes": 0,
                    "publishedAt": "2026-02-19T09:38:10Z"
                },
                {
                    "text": "Good evening happy one day in Manhattan February 18, 2026 right above 6:00 PM outside temperature is 33 Fahrenheit which is -4 Celsius. I’ve been in very good life stream starting off at Grand Central terminal headed all the way down to Fifth Avenue head all the way down to Times Square and then wrap it up here at Rockefeller Center taking a subway back to Queen and I really love the entire video because I really loved everything that you just did even though that I already had the Wi-Fi lagging but hey, I left everything if you hear more popular when you come into New York City, but at least you got a chance to eat everything together thank you for sharing this whole entire video for me. I will always be truly good and grateful to myself into one another. I hit the button subscribe if I haven’t and love everything till a nice day stay safe stay positive and keep exploring New York City with you. Have a great night. Tell your family and say hello and please be careful. Thank you for sharing this whole entire video with your mom and I always appreciate your show😎👍!!",
                    "author": "@BabysharkBrooklyn",
                    "likes": 2,
                    "publishedAt": "2026-02-19T00:01:19Z"
                },
                {
                    "text": "Good evening Sifat Happy Wednesday in Manhattan February 18th 2026 right above 5:00p.m. outside temperature 🌡 is 40 Fahrenheit which is 14 Celsius. Yesterday I really enjoy the Chinese festival at China 🇨🇳 Town the dragon 🐉 🎆 🎇 🧨 🎆 fireworks foods every. It's a rainy 🌧 night in New York city. Bryant Park I shall go ice skating rink and enjoy and have fun. In Time Square so heavy rain 🌧 shower. I really enjoy the rain 🌧. Thank you for everything you done for me. I  hit the like button subscribe to your channels. I'll see you tomorrow. Till then I'll stay safe 🙏 stay positive 🙏 and keep exploring New York City with you. Good night and tell your family I say hello 👨‍👩‍👧‍👦. I always appreciate your show 😎 👍 ❤ 🙏 🤗 🫂 🫂 🫂.",
                    "author": "@heribertosantana9158",
                    "likes": 3,
                    "publishedAt": "2026-02-19T00:04:59Z"
                },
                {
                    "text": "Thanks Sifat for your stream tonight . I think it was the weather and fog cause  it to look that way. Anyway you are still the best . Your walks are always amazing.  Stay safe have a great night.👋💕🙏",
                    "author": "@MadgeLovedbyGod",
                    "likes": 4,
                    "publishedAt": "2026-02-19T00:08:38Z"
                },
                {
                    "text": "Sifat, love your work, your show, content, have been watching a long time. However, this stream by far was one of the most difficult to watch and, frankly, just bad. I know you are testing a lot these days. However, please slow down, BE PATIENT, listen to your live audience trying to better understand what they are saying plus ask better questions of them, as well as address the issues as they arise. You are a great content creator, do great work, and yes, want to improve your setup. Just don't let it get in the way of EVERY stream. Since the new year began and you have stopped using your phone to stream full-time, there has been a larger issue, more than a regular stream glitch. You ask for our feedback. As a channel supporter, I share mine with you. Stay safe and healthy.",
                    "author": "@Tyler-Durden333",
                    "likes": 3,
                    "publishedAt": "2026-02-19T00:35:32Z"
                },
                {
                    "text": "全米で最も人口密度が低く、イエローストーン国立公園で有名な、ワイオミング州を基準に、米国に世界、日本を分析してるから。From🇯🇵",
                    "author": "@ボムボムオブジェ",
                    "likes": 0,
                    "publishedAt": "2026-02-19T03:03:37Z"
                }
            ]
        }
    ]
}